package ga.osipov.main_window;

import java.awt.EventQueue;
import java.awt.event.ActionEvent;
import java.awt.event.ActionListener;

import javax.swing.JButton;
import javax.swing.JCheckBox;
import javax.swing.JComboBox;
import javax.swing.JFrame;
import javax.swing.JLabel;
import javax.swing.JPanel;
import javax.swing.JScrollPane;
import javax.swing.JTabbedPane;
import javax.swing.JTable;
import javax.swing.JTextField;
import javax.swing.SpringLayout;
import javax.swing.SwingConstants;
import javax.swing.table.DefaultTableModel;

public class newwindow {

	private JFrame frmvb;
	private JTextField textField;
	private JTextField textField_1;
	private JTextField textField_2;
	private JTextField textField_3;
	private JTextField textField_4;
	private JTextField textField_5;
	private JTextField textField_6;
	private JTextField textField_7;
	private JTextField textField_8;
	private JTextField textField_9;
	private JTextField textField_10;
	private JTextField textField_11;
	private JTextField textField_12;
	private JTextField textField_13;
	private JTextField textField_14;
	private JTextField textField_15;
	private JTextField textField_16;
	private JTextField textField_17;
	private JTextField textField_18;
	private JTextField textField_19;
	private JTextField textField_20;
	private JTextField textField_21;
	private JTextField textField_22;
	private JTextField textField_23;
	private JTextField textField_24;
	private JTextField textField_25;
	private JTextField textField_26;
	private JTextField textField_27;
	private JTextField textField_28;
	private JTextField textField_29;
	private JTextField textField_30;
	private JTextField textField_31;
	private JTextField textField_32;
	private JTextField textField_33;
	private JTextField textField_34;
	private JTextField textField_35;
	private JTextField textField_36;
	private JTextField textField_37;
	private JTextField textField_38;
	private JTextField textField_39;
	private JTextField textField_40;
	private JTextField textField_41;
	private JTextField textField_42;
	private JTextField textField_43;
	private JTextField textField_44;
	private JTextField textField_45;
	private JTextField textField_46;
	private JTextField textField_47;
	private JTextField textField_48;
	private JTextField textField_49;
	private JTextField textField_50;
	private JTextField textField_51;
	private JTextField textField_52;
	private JTextField textField_53;
	private JTextField textField_54;
	private JTextField textField_55;
	private JTextField textField_56;
	private JTextField textField_57;
	private JTextField textField_58;
	private JTextField textField_59;
	private JTextField textField_60;
	private JTextField textField_61;
	private JTextField textField_62;
	private JTextField textField_63;
	private JTextField textField_64;
	private JTextField textField_65;
	private JTextField textField_66;
	private JTextField textField_67;
	private JTextField textField_68;
	private JTextField textField_69;
	private JTextField textField_70;
	private JTextField textField_71;
	private JTextField textField_72;
	private JTextField textField_73;
	private JTextField textField_74;
	private JTextField textField_75;
	private JTextField textField_76;
	private JTextField textField_77;
	private JTextField textField_78;
	private JTextField textField_79;
	private JTextField textField_80;
	private JTextField textField_81;
	private JTextField textField_82;
	private JTextField textField_83;
	private JTextField textField_86;
	private JTextField textField_84;
	private JTextField textField_85;
	private JTextField textField_87;
	private JTextField textField_88;
	private JTextField textField_89;
	private JTextField textField_90;
	private JTextField textField_91;
	private JTextField textField_92;
	private JTextField textField_93;
	private JTextField textField_94;
	private JTextField textField_95;
	private JTextField textField_96;
	private JTextField textField_97;
	private JTextField textField_98;
	private JTextField textField_99;
	private JTextField textField_100;
	private JTextField textField_101;
	private JTextField textField_102;
	private JTextField textField_103;
	private JTextField textField_104;
	private JTextField textField_105;
	private JTextField textField_106;
	private JTextField textField_107;
	private JTextField textField_108;
	private JTextField textField_109;
	private JTextField textField_110;
	private JTextField textField_111;
	private JTextField textField_112;
	private JTextField textField_113;
	private JTextField textField_114;
	private JTextField textField_115;
	private JTextField textField_116;
	private JTextField textField_117;
	private JTextField textField_118;
	private JTextField textField_119;
	private JTextField textField_120;
	private JTextField textField_121;
	private JTextField textField_122;
	private JTextField textField_123;
	private JTextField textField_124;
	private JTextField textField_125;
	private JTextField textField_126;
	private JTextField textField_127;
	private JTextField textField_128;
	private JTextField textField_129;
	private JTextField textField_130;
	private JTextField textField_131;
	private JTextField textField_132;
	private JTextField textField_133;
	private JTextField textField_134;
	private JTextField textField_135;
	private JTextField textField_136;
	private JTextField textField_137;
	private JTextField textField_138;
	private JTextField textField_139;
	private JTextField textField_140;
	private JTextField textField_141;
	private JTextField textField_142;
	private JTextField textField_143;
	private JTextField textField_144;
	private JTextField textField_145;
	private JTextField textField_146;
	private JTextField textField_147;
	private JTextField textField_148;
	private JTextField textField_149;
	private JTextField textField_150;
	private JTextField textField_151;
	private JTextField textField_152;
	private JTextField textField_153;
	private JTextField textField_154;
	private JTextField textField_155;
	private JTextField textField_156;
	private JTextField textField_157;
	private JTextField textField_158;
	private JTextField textField_159;
	private JTextField textField_160;
	private JTextField textField_161;
	private JTextField textField_162;
	private JTextField textField_163;
	private JTextField textField_164;
	private JTextField textField_165;
	private JTextField textField_166;
	private JTextField textField_167;
	private JTextField textField_168;
	private JTextField textField_169;
	private JTextField textField_170;
	private JTextField textField_171;
	private JTextField textField_172;
	private JTextField textField_173;
	private JTextField textField_174;
	private JTextField textField_175;
	private JTextField textField_176;
	private JTextField textField_177;
	private JTextField textField_178;
	private JTextField textField_179;
	private JTextField textField_180;
	private JTextField textField_181;
	private JTextField textField_182;
	private JTextField textField_183;
	private JTextField textField_184;
	private JTextField textField_185;
	private JTextField textField_186;
	private JTextField textField_187;
	private JTextField textField_188;
	private JTextField textField_189;
	private JTextField textField_190;
	private JTextField textField_191;
	private JTextField textField_192;
	private JTextField textField_193;
	private JTextField textField_194;
	private JTextField textField_195;
	private JTextField textField_196;
	private JTextField textField_197;
	private JTextField textField_198;
	private JTextField textField_199;
	private JTextField textField_200;
	private JTextField textField_201;
	private JTextField textField_202;
	private JTable table;
	private JTable table_1;
	private JTextField textField_203;
	private JTextField textField_204;
	private JTextField textField_205;
	private JTextField textField_206;
	private JTextField textField_207;
	private JTextField textField_208;
	
	/**
	 * Launch the application.
	 */
	public static void main(String[] args) {
		EventQueue.invokeLater(new Runnable() {
			public void run() {
				try {
					newwindow window = new newwindow();
					window.frmvb.setVisible(true);
				} catch (Exception e) {
					e.printStackTrace();
				}
			}
		});
	}

	/**
	 * Create the application.
	 */
	public newwindow() {
		initialize();
	}

	/**
	 * Initialize the contents of the frame.
	 */
	private void initialize() {
		
		
		
		String[] MegTitul = {
				"образованием земельного участка путем объединения земельных участков с кадастровыми номерами _",
				"образованием _ земельных участков путем раздела земельного участка с кадастровым номером _, расположенного _",
				"образованием _ земельных участков путем перераспределения земельных участков с кадастровыми номерами _",
				"исправлением ошибки в местоположении границ земельного участка с кадастровым номером _, расположенного _",
				"образованием земельного участка путем выдела в счет доли (долей) в праве общей собственности на земельный участок с кадастровым номером _, расположенный _",
				"образованием _ земельных участков путем выдела в счет доли (долей) в праве общей собственности на земельный участок с кадастровым номером _, расположенный _",
				"образованием земельного участка (земельных участков) из состава единого землепользования с кадастровым номером _",
				"образованием земельного участка из земель, находящихся в государственной или муниципальной собственности, расположенного _",
				"образованием части (частей) земельного участка с кадастровым номером _, расположенного _",
				"образованием части (частей) земельного участка с кадастровым номером _, расположенного _",
				"уточнением части (частей) с учетным номером _ земельного участка с кадастровым номером _, расположенного _",

			};
		
		String[] SposobTitul = {
				"Выдел",
				"Раздел",
				"Раздел с измененным земельным участком",
				"Перераспределение",
				"Образование из земель",
				"Объединение",
				"Перераспределение с землями"
			};
		
		String[] TypeOrg = {
				"Российское юридическое лицо", "Орган государственное власти, орган местного самоуправления", "Иностранное юридическое лицо"	
		};
		
		String[] SodTypeDoc = {
				"Образ документа", "Электронный документ (должен быть представлен одним файлом)"	
		};
		
		String[] DocCode = {
				"008001000000 Документы, удостоверяющие личность физического лица",
				"008001001000 Паспорт гражданина Российской Федерации",	
				"008001002000 Паспорт гражданина СССР",	
				"008001003000 Паспорт гражданина иностранного государства",	
				"008001004000 Общегражданский заграничный паспорт",	
				"008001005000 Заграничный паспорт Министерства морского флота",	
				"008001006000 Дипломатический паспорт",	
				"008001007000 Паспорт моряка (удостоверение личности моряка)",	
				"008001008000 Военный билет военнослужащего",	
				"008001009000 Временное удостоверение, выданное взамен военного билета",	
				"008001010000 Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33",	
				"008001011000 Свидетельство о рождении",	
				"008001012000 Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу",	
				"008001013000 Вид на жительство иностранного гражданина или лица без гражданства",	
				"008001014000 Справка об освобождении из мест лишения свободы",	
				"008001015000 Временное удостоверение личности гражданина Российской Федерации",	
				"008001016000 Удостоверение вынужденного переселенца",	
				"008001017000 Разрешение на временное проживание в Российской Федерации",	
				"008001018000 Удостоверение беженца в Российской Федерации",	
				"008001019000 Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем",	
				"008001020000 Свидетельство о предоставлении временного убежища на территории Российской Федерации",	
				"008001099000 Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность",	
				"008002000000 Документы., идентифицирующие юридическое лицо",	
				"008002001000 Свидетельство о государственной регистрации юридического лица",	
				"008002002000 Свидетельство о внесении записей в ЕГРЮЛ",	
				"008002004000 Устав",	
				"008002005000 Учредительный договор",	
				"008002006000 Положение (общее положение об организации)",	
				"008002007000 Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН",	
				"008002008000 Выписка из ЕГРЮЛ",	
				"008002099000 Иной документ",	
				"555001000000 Квитанция",	
				"555002000000 Платёжное поручение",	
				"555003000000 Чек",	
				"555004000000 Подтверждение электронного платежа",	
				"555005000000 Документ, подтверждающий право заявителя на безвозмездное получение сведений",
				"558100000000 ЗАЯВЛЕНИЯ",
				"558101000000 Заявления и запросы, связанные с государственным кадастровым учётом",
				"558101010000 Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости",
				"558101020000 Заявление о постановке на государственный кадастровый учёт объекта недвижимости",
				"558101030000 Заявление о государственном кадастровом учёте изменений объекта недвижимости",
				"558101040000 Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)",
				"558101050000 Запрос о предоставлении сведений об ОКС",
				"558101060000 Заявление о снятии с государственного кадастрового учёта объекта недвижимости",
				"558101070000 Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости",
				"558101080000 Заявление об исправлении кадастровой ошибки",
				"558101090000 Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости",
				"558101090100 Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости",
				"558101090200 Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пункте",
				"558101100000 Заявление о представлении дополнительных документов на государственный кадастровый учёт",
				"558101110000 Внутриведомственный запрос информации государственного кадастра недвижимости",
				"558101120000 Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости",
				"558101130000 Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости",
				"558101140000 Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке",
				"558101150000 Заявление о прекращении осуществления кадастрового учёта",
				"558101160000 Межведомственный запрос документов в органах государственной власти и органах местного самоуправления",
				"558101170000 Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёт)' и (или) технической инвентаризации",
				"558102000000 Заявления и запросы, связанные с регистрацией прав",
				"558102010000 Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество",
				"558102020000 Заявление о государственной регистрации прекращения права (ограничения (обременения) права)",
				"558102030000 Заявление о внесении изменений в ЕГРП",
				"558102040000 Заявление об исправлении технической ошибки",
				"558102050000 Заявление о представлении дополнительных документов для государственной регистрации прав",
				"558102060000 Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним",
				"558102070000 Заявление о возобновлении государственной регистрации",
				"558102080000 Заявление о прекращении государственной регистрации",
				"558102090000 Заявление о повторной выдаче свидетельства о государственной регистрации права",
				"558102100000 Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним",
				"558102110000 Заявление о постановке на учёт бесхозяйных недвижимых вещей",
				"558102120000 Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)",
				"558102130000 Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме",
				"558102140000 Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сдел",
				"558102150000 Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке",
				"558102160000 Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)",
				"558102170000 Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права",
				"558102180000 Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недви>",
				"558102190000 Заявление о скреплении добавочного листа (добавочных листов) с закладной",
				"558102200000 Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним",
				"558102210000 Заявление о государственной регистрации законного владельца закладной",
				"558102220000 Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке",
				"558103000000 Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр",
				"558103010000 Заявление о постановке на государственный учёт объекта учёта",
				"558103020000 Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства",
				"558103030000 Заявление о государственном учёте изменений объекта учёта",
				"558103040000 Заявление о снятии с государственного учёта объекта учёта",
				"558103050000 Заявление об исправлении технической ошибки",
				"558103060000 Заявление об исключении сведений из ЕГРОКС, носящих временный характер",
				"558103070000 Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр",
				"558103080000 Запрос о предоставлении сведений, внесенных в Единый государственный реестр",
				"558103090000 Заявление о представлении дополнительных документов на государственный учёт",
				"558104000000 Заявление о возврате платежа",
				"558199000000 Иное заявление",
				"558200000000 ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА",
				"558201000000 Описание земельных участков",
				"558202000000 Землеустроительное дело",
				"558203000000 Межевой план",
				"558204000000 Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН",
				"558205000000 Технический паспорт объекта учёта",
				"558205010000 Технический паспорт домовладения",
				"558205020000 Технический паспорт здания (строения)",
				"558205030000 Технический паспорт жилого помещения (квартиры)",
				"558205040000 Технический паспорт объекта индивидуального жилищного строительства",
				"558205050000 Технический паспорт сооружения",
				"558205060000 Технический паспорт объекта незавершённого строительства",
				"558206000000 Выписка из технического паспорта",
				"558207000000 Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка",
				"558208000000 Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель",
				"558209000000 Документ (копия), подтверждающий установленное разрешенное использование земельного участка",
				"558210000000 Кадастровый план земельного участка (выписка из государственного земельного кадастра)",
				"558211000000 Планы иных объектов недвижимости",
				"558211010000 Технический план здания, сооружения, помещения либо объекта незавершённого строительства",
				"558211020000 План участка лесного фонда",
				"558211030000 План объекта недвижимости",
				"558211040000 Экспликация к поэтажному плану",
				"558212000000 Декларация об объекте недвижимости",
				"558213000000 Кадастровый паспорт объекта недвижимости",
				"558213010000 Кадастровый паспорт земельного участка",
				"558213020000 Кадастровый паспорт помещения (выписка из ГКН)",
				"558213030000 Кадастровый паспорт здания, сооружения, объекта незавершённого строительства",
				"558214000000 Кадастровая выписка об объекте недвижимости",
				"558214010000 Кадастровая выписка о земельном участке",
				"558214020000 Кадастровая выписка о здании, сооружении, объекте незавершённого строительства",
				"558216000000 Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения",
				"558217000000 Кадастровый план территории",
				"558218000000 Кадастровая справка о кадастровой стоимости объекта недвижимости",
				"558219000000 Акт обследования, подтверждающий прекращение существования объекта учёта",
				"558220000000 Документы, в виде которых предоставляются сведения Единого государственного реестра",
				"558220010000 Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета",
				"558220020000 Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта",
				"558220030000 Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета",
				"558221000000 ПРОЧИЕ",
				"558221010000 Решение о необходимости устранения кадастровой ошибки",
				"558221020000 Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации",
				"558221030000 Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта",
				"558221040000 Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны",
				"558221050000 Решение о присвоении, изменении адреса",
				"558221060000 Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах",
				"558221070000 Документ, содержащий сведения об адресе объекта недвижимости",
				"558221080000 Акт об утверждении результатов определения кадастровой стоимости",
				"558221990000 Иной документ, содержащий описание объекта",
				"558222000000 Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международны!",
				"558223000000 Соглашение об изменении границ между субъектами Российской Федерации",
				"558224000000 Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований",
				"558225000000 Акт уполномоченного органа об установлении или изменении границ населённых пунктов",
				"558226000000 Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах",
				"558227000000 Решение об установлении или изменении границ зон с особыми условиями использования территорий",
				"558228000000 Правовой акт, которым утверждены или изменены правила землепользования и застройки",
				"558229000000 Документ, подтверждающий изменение назначения помещения",
				"558230000000 Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение",
				"558231000000 Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ",
				"558232000000 Документы, воспроизводящие сведения об изменении назначения помещения",
				"558233000000 Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение",
				"558234000000 Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ",
				"558235000000 Документ, подтверждающий изменение назначения здания",
				"558236000000 Документ, подтверждающий изменение назначения сооружения",
				"558237000000 Решение о предоставлении разрешения на условно разрешенный вид использования",
				"558238000000 Решение об определении (изменении) вида разрешенного использования",
				"558239000000 Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования",
				"558240000000 Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса",
				"558241000000 Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения",
				"558242000000 Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации",
				"558243000000 Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации",
				"558244000000 Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона \"Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации\", в отношении объекта недвижимости",
				"558245000000 Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации",
				"558246000000 Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия",
				"558247000000 Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования",
				"558248000000 Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка",
				"558249000000 Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости",
				"558250000000 Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий",
				"558251000000 Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах",
				"558252000000 Карта (план) объекта землеустройства",
				"558253000000 Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка",
				"558254000000 Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)",
				"558254010000 Землеустроительная документация",
				"558254020000 Лесоустроительная документация",
				"558254030000 Документы градостроительного зонирования (Правила землепользования и застройки)",
				"558254040000 Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка",
				"558254050000 Копия проекта межевания земельных участков",
				"558254060000 Акт отвода земельных участков в натуре",
				"558254070000 Проект границ земельных участков",
				"558254080000 Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан",
				"558254090000 Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения",
				"558254100000 Решение о предварительном согласовании мест размещения объектов",
				"558254110000 Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков",
				"558254120000 Копия документа, подтверждающего согласование проекта межевания земельного участка",
				"558254130000 Возражения заинтересованных лиц по поводу местоположения границ земельного участка",
				"558254140000 Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка",
				"558254150000 Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий",
				"558254990000 Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)",
				"558255000000 Картографические материалы",
				"558256000000 Материалы картографо-геодезического фонда",
				"558257000000 Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка",
				"558257010000 Федеральный закон",
				"558257020000 Закон субъекта Российской Федерации",
				"558257030000 Нормативный правовой акт органа местного самоуправления",
				"558258000000 Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости",
				"558259000000 Протокол образования земельных участков",
				"558260000000 Чертеж (абрис) помещения",
				"558261000000 Проектная документация здания",
				"558262000000 Проектная документация сооружения",
				"558263000000 Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости",
				"558264000000 Решение суда",
				"558299000000 Иной документ, содержащий описание объекта",
				"558300000000 ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ",
				"558301000000 Документы, подтверждающие полномочия представителя",
				"558301010000 Доверенность",
				"558301020000 Свидетельство о рождении",
				"558301030000 Свидетельство об усыновлении",
				"558301040000 Решение суда",
				"558301050000 Определение суда",
				"558301060000 Протокол об избрании (единоличного исполнительного органа юридического лица)",
				"558301070000 Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)",
				"558301080000 Приказ о назначении (руководителя или иного уполномоченного лица)",
				"558301090000 Решение органов опеки и попечительства",
				"558301100000 Договор коммерческого представительства",
				"558301110000 Договор доверительного управления",
				"558301120000 Постановление судебного пристава-исполнителя",
				"558301130000 Протокол общего собрания",
				"558301140000 Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя",
				"558301990000 Иной документ",
				"558400000000 ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)",
				"558401000000 Правоустанавливающие и правоудостоверяющие документы",
				"558401010000 Договоры / соглашения",
				"558401010100 Сделки об отчуждении",
				"558401010101 Договор купли-продажи",
				"558401010102 Договор мены",
				"558401010103 Договор дарения",
				"558401010104 Договор ренты",
				"558401010105 Договор пожизненного содержания с иждивением",
				"558401010106 Договор приватизации (договор передачи объекта недвижимости в собственность)",
				"558401010200 Другие сделки",
				"558401010201 Договор участия в долевом строительстве",
				"558401010202 Соглашение об определении (перераспределении) долей в праве общей долевой собственности",
				"558401010203 Брачный договор",
				"558401010204 Соглашение об отступном",
				"558401010205 Соглашение о разделе имущества",
				"558401010206 Соглашение о выделе доли",
				"558401010207 Инвестиционный договор (договор об инвестировании)",
				"558401010208 Мировое соглашение",
				"558401010209 Договор аренды (субаренды)",
				"558401010210 Договор об ипотеке",
				"558401010211 Договор безвозмездного срочного пользования земельным участком",
				"558401010212 Кредитный договор",
				"558401010213 Договор займа",
				"558401010214 Соглашение об установлении сервитута",
				"558401010215 Соглашение об изменении содержания закладной",
				"558401010216 Дополнительное соглашение (соглашение об изменении условий договора) к договору",
				"558401010217 Соглашение о расторжении договора",
				"558401010218 Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)",
				"558401010219 Договор простого товарищества (договор о совместной деятельности)",
				"558401010220 Государственный контракт",
				"558401010299 Иная сделка",
				"558401020000 Акты органов государственной власти или органов местного самоуправления",
				"558401020100 Федеральный закон",
				"558401020200 Указ Президента Российской Федерации",
				"558401020300 Постановление Правительства Российской Федерации",
				"558401020400 Закон (законы Российской Федерации, субъекта Российской Федерации)",
				"558401020500 Документ о предоставлении земельных участков",
				"558401020600 Решение об образовании земельных участков",
				"558401020700 Акт об установлении сервитута",
				"558401020800 Акт об установлении ограничения (обременения)",
				"558401029900 Иные акты органов государственной власти или органов местного самоуправления",
				"558401030000 Свидетельство о праве на наследство",
				"558401030100 Свидетельство о праве на наследство по закону",
				"558401030200 Свидетельство о праве на наследство по завещанию",
				"558401040000 Вступившие в силу судебные акты",
				"558401040100 Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости",
				"558401040200 Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости",
				"558401040300 Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости (части объекта недвижимости)",
				"558401049900 Иные предусмотренные законодательством судебные акты",
				"558401050000 Акты (свидетельства) о правах на объекты недвижимости",
				"558401050100 Регистрационное удостоверение",
				"558401050200 Свидетельство о праве на землю",
				"558401050300 Государственный акт о праве на землю",
				"558401050400 Свидетельство о праве собственности",
				"558401059900 Иные акты, свидетельства о правах на объекты недвижимости",
				"558401060000 Документы на вновь возведенный (реконструированный) объект",
				"558401060100 Разрешение на ввод объекта в эксплуатацию",
				"558401060200 Разрешение на строительство",
				"558401060300 Акт ввода в эксплуатацию",
				"558401060400 Копия решения о создании искусственного земельного участка",
				"558401070000 Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества",
				"558401070100 Выписка из похозяйственной книги о наличии у гражданина права на земельный участок",
				"558401070200 Кадастровый паспорт объекта недвижимости",
				"558401070300 Декларация об объекте недвижимого имущества",
				"558401080000 Прочие правоустанавливающие документы",
				"558401080100 Передаточный акт",
				"558401080200 Разделительный баланс",
				"558401080300 План приватизации",
				"558401080400 Правила доверительного управления",
				"558401080500 Акт описи и ареста имущества",
				"558401080600 Протокол о выделе земельного участка в счет земельной доли",
				"558401080700 Протокол общего собрания собственников помещений в многоквартирном доме",
				"558401080800 Отказ одаряемого принять дар (отказ от дара)",
				"558401080900 Соглашение о новации",
				"558401081000 Соглашение о разделе наследственного имущества",
				"558401081100 Соглашение об уплате алиментов",
				"558401081200 Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя",
				"558401089900 Иной документ",
				"558402000000 СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ",
				"558402010000 Согласие супруга на совершение сделки",
				"558402020000 Согласие органов опеки и попечительства",
				"558402030000 Свидетельство о заключении брака",
				"558402040000 Свидетельство о расторжении брака",
				"558402050000 Решение об одобрении (о совершении) сделки",
				"558402060000 Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)",
				"558402070000 Справка о заинтересованных лицах в сделке",
				"558402080000 Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)",
				"558402090000 Выписка из лицевого счета (сведения о лицах., сохраняющих право проживания в жилом помещении после перехода права на него)",
				"558402100000 Протокол о результатах торгов",
				"558402110000 Лицензия (лицензия на осуществление определенных видов деятельности)",
				"558402120000 Проектная декларация",
				"558402130000 Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)",
				"558402140000 Решение о создании юридического лица",
				"558402150000 Решение о реорганизации юридического лица",
				"558402160000 Решение о ликвидации юридического лица",
				"558402170000 Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)",
				"558402180000 Исполнительный лист",
				"558402190000 Договор поручения",
				"558402200000 Бухгалтерский баланс",
				"558402210000 Закладная",
				"558402220000 Добавочный лист к закладной",
				"558402230000 Выписка из реестра муниципальной собственности",
				"558402240000 Выписка из реестра собственности субъекта Российской Федерации",
				"558402250000 Выписка из реестра федерального имущества",
				"558402260000 Жилищный сертификат",
				"558402270000 Аудиторское заключение",
				"558402280000 Отчет о проведении независимой оценки (акт оценки)",
				"558402390000 Акт инвентаризации",
				"558402400000 Охранное обязательство собственника объекта культурного наследия",
				"558402990000 Иной документ",
				"558403000000 ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП",
				"558403010000 Свидетельство о государственной регистрации права",
				"558403020000 Выписка о правах на объект недвижимого имущества",
				"558403030000 Выписка о переходе прав на объект недвижимого имущества",
				"558403040000 Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества",
				"558403050000 Выписка о признании правообладателя недееспособным или ограниченно дееспособным",
				"558403060000 Справка о содержании правоустанавливающих документов на объект недвижимого имущества",
				"558403070000 Справка о лицах, получивших сведения об объекте недвижимого имущества",
				"558403080000 Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме",
				"558403090000 Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества",
				"558403100000 Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался",
				"558403110000 Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт",
				"558403120000 Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество",
				"558403990000 Иной документ",
				"558404000000 Соглашения и согласия об образовании земельных участков",
				"558404010000 Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков",
				"558404020000 Согласие на образование земельных участков",
				"558404030000 Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей",
				"558404040000 Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей",
				"558405000000 Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП",
				"558405010000 Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность",
				"558405020000 Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением соглас",
				"558405030000 Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов",
				"558405040000 Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов",
				"558405990000 Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП",
				"558500000000 Решения, уведомления, расписки",
				"558501000000 Документы о результатах государственного кадастрового учёта",
				"558501010000 РЕШЕНИЯ",
				"558501010100 Решение об отказе в предоставлении запрашиваемых сведений",
				"558501010200 Решение об отказе в исправлении кадастровой ошибки",
				"558501010300 Решение об отказе в исправлении технической ошибки",
				"558501010400 Решение об исправлении технической и кадастровой ошибок",
				"558501010500 Решение об отказе в осуществлении кадастровой процедуры",
				"558501010600 Решение о приостановлении осуществления кадастровой процедуры",
				"558501010700 Решение об отказе в снятии приостановления",
				"558501010800 Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица",
				"558501010900 Решение об отказе в выдаче кадастрового паспорта",
				"558501011000 Решение об осуществлении кадастровой процедуры",
				"558501011100 Решение об аннулировании кадастровых сведений",
				"558501011200 Решение об отклонении заявления об исправлении технической ошибки",
				"558501011300 Решение о внесении записи о наличии возражения",
				"558501011400 Решение о погашении записи о наличии возражения",
				"558501011500 Решение о внесении записи о заявлении о невозможности государственной регистрации",
				"558501011600 Решение о погашении записи о заявлении о невозможности государственной регистрации",
				"558501020000 УВЕДОМЛЕНИЯ",
				"558501020100 Уведомление об отсутствии в ГКН запрашиваемых сведений",
				"558501020200 Уведомление об осуществлённом кадастровом учёте",
				"558501020300 Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС",
				"558501020400 Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС",
				"558501020500 Уведомление об устранении технической ошибки в сведениях ГКН",
				"558501020600 Уведомление об отказе в выдаче сведений об ОКС",
				"558501020700 Уведомление о приостановлении осуществления кадастровой процедуры",
				"558501020800 Уведомление об отказе в осуществлении кадастровой процедуры",
				"558501020900 Уведомление о регистрации права",
				"558501021000 Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного",
				"558501021100 Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного",
				"558501021200 Уведомление о снятии с учёта имущества в качестве бесхозяйного",
				"558501021300 Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения",
				"558501030000 ПРОЧИЕ",
				"558501030100 Расписка в получении соответствующих документов для проведения государственного кадастрового учёта",
				"558501030200 Протокол проверки документов",
				"558501030300 Акт определения кадастровой стоимости земельных участков",
				"558501030400 Протокол выявления технической ошибки",
				"558501030500 Акт определения кадастровой стоимости объектов недвижимости",
				"558501039900 Иные документы",
				"558502000000 ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ",
				"558502010000 УВЕДОМЛЕНИЯ, СООБЩЕНИЯ",
				"558502010100 Уведомление о приостановлении государственной регистрации прав",
				"558502010200 Уведомление о прекращении государственной регистрации прав",
				"558502010300 Уведомление о зарегистрированных ограничениях (обременениях) прав",
				"558502010400 Уведомление о внесении изменений в ЕГРП",
				"558502010500 Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним",
				"558502010600 Сообщение об отказе в государственной регистрации прав",
				"558502010700 Сообщение об отказе в предоставлении сведений из ЕГРП",
				"558502010800 Уведомление об отсутствии в ЕГРП запрашиваемых сведений",
				"558502010900 Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним",
				"558502011000 Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права",
				"558502011100 Уведомление о возврате приложенных к заявлению документов без рассмотрения",
				"558502011200 Уведомление о государственной регистрации прекращения ограничения (обременения)",
				"558502011300 Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества",
				"558502011400 Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем",
				"558502011500 Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным",
				"558502011600 Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)",
				"558502011700 Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета",
				"558502020000 ПРОЧИЕ",
				"558502020100 Расписка в получении документов на государственную регистрацию прав",
				"558502029900 Иной документ",
				"558601000000 Расписка в получении извещений о проведении собрания о согласовании местоположения границ",
				"558602000000 Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ",
				"558603000000 Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания",
				"558699000000 Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка"
		};
		
		String[] SysCoord= {
				"WGS 84 (Меркатор)",
				"WGS 84 (долгота/широта)",
				"NAD 83 (долгота/широта)",
				"МСК-01 зона 1 Республика Адыгея",
				"МСК-01 зона 2 Республика Адыгея",
				"МСК-02 зона 1 Республика Башкортостан",
				"МСК-02 зона 2 Республика Башкортостан",
				"МСК-03 зона 1 Республика Бурятия",
				"МСК-03 зона 2 Республика Бурятия",
				"МСК-03 зона 3 Республика Бурятия",
				"МСК-03 зона 4 Республика Бурятия",
				"МСК-03 зона 5 Республика Бурятия",
				"МСК-03 зона 6 Республика Бурятия",
				"МСК-03 зона 7 Республика Бурятия",
				"МСК-04 зона 1 Республика Алтай",
				"МСК-04 зона 2 Республика Алтай",
				"МСК-05 зона 1 Республика Дагестан",
				"МСК-06 зона 1 Республика Ингушетия",
				"МСК-07 зона 1 Кабардино-Балкарская Республика",
				"МСК-08 зона 1 Республика Калмыкия",
				"МСК-08 зона 2 Республика Калмыкия",
				"МСК-08 зона 3 Республика Калмыкия",
				"МСК-09 зона 1 Республика Карачаево-Черкесия",
				"МСК-10 зона 1 (6 градусная) Республика Карелия",
				"МСК-10 зона 2 (6 градусная) Республика Карелия",
				"МСК-11 зона 1 Республика Коми",
				"МСК-11 зона 2 Республика Коми",
				"МСК-11 зона 3 Республика Коми",
				"МСК-11 зона 4 Республика Коми",
				"МСК-11 зона 5 Республика Коми",
				"МСК-11 зона 6 Республика Коми",
				"МСК-11 зона 7 Республика Коми",
				"МСК-11 зона 8 Республика Коми",
				"МСК-11 зона 9 Республика Коми",
				"МСК-12 зона 1 Республика Марий Эл",
				"МСК-12 зона 2 Республика Марий Эл",
				"МСК-13 зона 1 Республика Мордовия",
				"МСК-13 зона 2 Республика Мордовия",
				"МСК-14 зона 1 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 2 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 3 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 4 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 5 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 6 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 7 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 8 (6 градусная) Республика Саха (Якутия)",
				"МСК-14 зона 9 (6 градусная) Республика Саха (Якутия)",
				"МСК-15 зона 1 Северная Осетия - Алания",
				"МСК-16 зона 1 Республика Татарстан",
				"МСК-16 зона 2 Республика Татарстан",
				"МСК-16 зона 3 Республика Татарстан",
				"МСК-18 зона 1 Удмуртская Республика",
				"МСК-18 зона 2 Удмуртская Республика",
				"МСК-20 зона 1 Чеченская Республика",
				"МСК-20 зона 2 Чеченская Республика",
				"МСК-21 зона 1 Чувашская Республика",
				"МСК-21 зона 2 Чувашская Республика",
				"МСК-22 зона 1 Алтайский край",
				"МСК-22 зона 2 Алтайский край",
				"МСК-22 зона 3 Алтайский край",
				"МСК-23 зона 1 Краснодарский край",
				"МСК-23 зона 2 Краснодарский край",
				"МСК-24 зона 1 (6 градусная) Красноярский край",
				"МСК-24 зона 2 (6 градусная) Красноярский край",
				"МСК-24 зона 3 (6 градусная) Красноярский край",
				"МСК-24 зона 4 (6 градусная) Красноярский край",
				"МСК-24 зона 5 (6 градусная) Красноярский край",
				"МСК-24 зона 6 (6 градусная) Красноярский край",
				"МСК-25 зона 1 Приморский край",
				"МСК-25 зона 2 Приморский край",
				"МСК-25 зона 3 Приморский край",
				"МСК-25 зона 4 Приморский край",
				"МСК-26 зона 1 Ставропольский край",
				"МСК-26 зона 2 Ставропольский край",
				"МСК-27 зона 1 Хабаровский край",
				"МСК-27 зона 2 Хабаровский край",
				"МСК-27 зона 3 Хабаровский край",
				"МСК-27 зона 4 Хабаровский край",
				"МСК-27 зона 5 Хабаровский край",
				"МСК-27 зона 6 Хабаровский край",
				"МСК-28 зона 1 Амурская область",
				"МСК-28 зона 2 Амурская область",
				"МСК-28 зона 3 Амурская область",
				"МСК-28 зона 4 Амурская область",
				"МСК-28 зона 5 Амурская область",
				"МСК-29 зона 1 (6 градусная) Архангельская область",
				"МСК-29 зона 2 (6 градусная) Архангельская область",
				"МСК-29 зона 3 (6 градусная) Архангельская область",
				"МСК-29 зона 4 (6 градусная) Архангельская область",
				"МСК-30 зона 1 Астраханская область",
				"МСК-30 зона 2 Астраханская область",
				"МСК-31 зона 1 Белгородская область",
				"МСК-31 зона 2 Белгородская область",
				"МСК-32 зона 1 Брянская область",
				"МСК-32 зона 2 Брянская область",
				"МСК-33 от СК-63 зона 1 Владимирская область",
				"МСК-33 от СК-63 зона 2 Владимирская область",
				"МСК-33 от СК-63 зона 3 Владимирская область",
				"МСК-33 от СК-95 Владимирская область",
				"МСК-34 зона 1 Волгоградская область",
				"МСК-34 зона 2 Волгоградская область",
				"МСК-35 зона 1 Вологодская область",
				"МСК-35 зона 2 Вологодская область",
				"МСК-35 зона 3 Вологодская область",
				"МСК-35 зона 4 Вологодская область",
				"МСК-36 зона 1 Воронежская область",
				"МСК-36 зона 2 Воронежская область",
				"МСК-37 зона 1 Ивановская область",
				"МСК-37 зона 2 Ивановская область",
				"МСК-38 зона 1 Иркутская область",
				"МСК-38 зона 2 Иркутская область",
				"МСК-38 зона 3 Иркутская область",
				"МСК-38 зона 4 Иркутская область",
				"МСК-38 зона 5 Иркутская область",
				"МСК-38 зона 6 Иркутская область",
				"МСК-38 зона 7 Иркутская область",
				"МСК-38 зона 8 Иркутская область",
				"МСК-39 зона 1 Калининградская область",
				"МСК-40 зона 1 Калужская область",
				"МСК-41 зона 1 (6 градусная) Камчатский край",
				"МСК-41 зона 2 (6 градусная) Камчатский край",
				"МСК-41 зона 3 (6 градусная) Камчатский край",
				"МСК-42 зона 1 Кемеровская область",
				"МСК-42 зона 2 Кемеровская область",
				"МСК-43 зона 1 Кировская область",
				"МСК-43 зона 2 Кировская область",
				"МСК-43 зона 3 Кировская область",
				"МСК-44 зона 1 Костромская область",
				"МСК-44 зона 2 Костромская область",
				"МСК-44 зона 3 Костромская область",
				"МСК-45 зона 1 Курганская область",
				"МСК-45 зона 2 Курганская область",
				"МСК-45 зона 3 Курганская область",
				"МСК-46 зона 1 Курская область",
				"МСК-46 зона 2 Курская область",
				"МСК-47 зона 1 Ленинградская область",
				"МСК-47 зона 2 Ленинградская область",
				"МСК-47 зона 3 Ленинградская область",
				"МСК-1964 Санкт-Петербург",
				"МСК-48 зона 1 Липецкая область",
				"МСК-48 зона 2 Липецкая область",
				"МСК-49 зона 1 (6 градусная) Магаданская область",
				"МСК-49 зона 2 (6 градусная) Магаданская область",
				"МСК-49 зона 3 (6 градусная) Магаданская область",
				"МСК-49 зона 4 (6 градусная) Магаданская область",
				"Московская СК (EPSG:6335000)",
				"МСК-50 зона 1 Москва и Московская область",
				"МСК-50 зона 2 Москва и Московская область",
				"МСК-51 зона 1 (6 градусная) Мурманская область",
				"МСК-51 зона 2 (6 градусная) Мурманская область",
				"МСК-52 зона 1 Нижегородская область",
				"МСК-52 зона 2 Нижегородская область",
				"МСК-52 зона 3 Нижегородская область",
				"МСК-53 зона 1 Новгородская область",
				"МСК-53 зона 2 Новгородская область",
				"МСК-53 зона 3 Новгородская область",
				"МСК-54 зона 1 Новосибирская область",
				"МСК-54 зона 2 Новосибирская область",
				"МСК-54 зона 3 Новосибирская область",
				"МСК-54 зона 4 Новосибирская область",
				"МСК-55 зона 1 Омская область",
				"МСК-55 зона 2 Омская область",
				"МСК-56 зона 1 Оренбургская область",
				"МСК-56 зона 2 Оренбургская область",
				"МСК-56 зона 3 Оренбургская область",
				"МСК-56 зона 4 Оренбургская область",
				"МСК-57 зона 1 Орловская область",
				"МСК-57 зона 2 Орловская область",
				"МСК-57 зона 3 Орловская область",
				"МСК-58 зона 1 Пензенская область",
				"МСК-58 зона 2 Пензенская область",
				"МСК-59 зона 1 Пермский край",
				"МСК-59 зона 2 Пермский край",
				"МСК-59 зона 3 Пермский край",
				"МСК-60 зона 1 Псковская область",
				"МСК-60 зона 2 Псковская область",
				"МСК-60 зона 3 Псковская область",
				"МСК-61 зона 1 Ростовская область",
				"МСК-61 зона 2 Ростовская область",
				"МСК-61 зона 3 Ростовская область",
				"МСК-62 зона 1 Рязанская область",
				"МСК-62 зона 2 Рязанская область",
				"МСК-62 зона 3 Рязанская область",
				"МСК-63 зона 1 Самарская область",
				"МСК-63 зона 2 Самарская область",
				"МСК-64 зона 1 Саратовская область",
				"МСК-64 зона 2 Саратовская область",
				"МСК-64 зона 3 Саратовская область",
				"МСК-65 зона 1 Сахалинская область",
				"МСК-66 зона 1 Свердловская область",
				"МСК-66 зона 2 Свердловская область",
				"МСК-66 зона 3 Свердловская область",
				"МСК-66 зона 1 (6 градусная) Свердловская область",
				"МСК-66 зона 2 (6 градусная) Свердловская область",
				"МСК-67 зона 1 Смоленская область",
				"МСК-67 зона 2 Смоленская область",
				"МСК-67 зона 3 Смоленская область",
				"МСК-68 зона 1 Тамбовская область",
				"МСК-68 зона 2 Тамбовская область",
				"МСК-68 зона 3 Тамбовская область",
				"МСК-69 зона 1 Тверская область",
				"МСК-69 зона 2 Тверская область",
				"МСК-69 зона 3 Тверская область",
				"МСК-70 зона 1 Томская область",
				"МСК-70 зона 2 Томская область",
				"МСК-70 зона 3 Томская область",
				"МСК-70 зона 4 Томская область",
				"МСК-70 зона 5 Томская область",
				"МСК-70 зона 6 Томская область",
				"МСК-71 от СК-63 зона 1 Тульская область",
				"МСК-71 от СК-63 зона 2 Тульская область",
				"МСК-71.1 от СК-95 зона 1 Тульская область",
				"МСК-72 зона 1 (1.5 градусная) Тюменская область",
				"МСК-72 зона 2 (1.5 градусная) Тюменская область",
				"МСК-72 зона 3 (1.5 градусная) Тюменская область",
				"МСК-72 зона 4 (1.5 градусная) Тюменская область",
				"МСК-72 зона 5 (1.5 градусная) Тюменская область",
				"МСК-72 зона 6 (1.5 градусная) Тюменская область",
				"МСК-72 зона 1 Тюменская область",
				"МСК-72 зона 2 Тюменская область",
				"МСК-72 зона 3 Тюменская область",
				"МСК-72 зона 4 Тюменская область",
				"МСК-72 зона 5 Тюменская область",
				"МСК-72 зона 1 (6 градусная) Тюменская область",
				"МСК-72 зона 2 (6 градусная) Тюменская область",
				"МСК-72 зона 3 (6 градусная) Тюменская область",
				"МСК-73 зона 1 Ульяновская область",
				"МСК-73 зона 2 Ульяновская область",
				"МСК-74 зона 1 Челябинская область",
				"МСК-74 зона 2 Челябинская область",
				"МСК-74 зона 3 Челябинская область",
				"МСК-75 зона 1 Забайкальский край",
				"МСК-75 зона 2 Забайкальский край",
				"МСК-75 зона 3 Забайкальский край",
				"МСК-75 зона 4 Забайкальский край",
				"МСК-75 зона 5 Забайкальский край",
				"МСК-76 зона 1 Ярославская область",
				"МСК-76 зона 2 Ярославская область",
				"МСК-83 зона 3 (6 градусная) Ненецкий автономный округ",
				"МСК-83 зона 4 (6 градусная) Ненецкий автономный округ",
				"МСК-83 зона 5 (6 градусная) Ненецкий автономный округ",
				"МСК-83 зона 6 (6 градусная) Ненецкий автономный округ",
				"МСК-83 зона 7 (6 градусная) Ненецкий автономный округ",
				"МСК-86 зона 1 (6 градусная) Ханты-Мансийский автономный округ — Югра",
				"МСК-86 зона 2 (6 градусная) Ханты-Мансийский автономный округ — Югра",
				"МСК-86 зона 3 (6 градусная) Ханты-Мансийский автономный округ — Югра",
				"МСК-86 зона 4 (6 градусная) Ханты-Мансийский автономный округ — Югра",
				"МСК-86 зона 5 (6 градусная) Ханты-Мансийский автономный округ — Югра",
				"МСК-87 зона 3 (6 градусная) Чукотский автономный округ",
				"МСК-87 зона 4 (6 градусная) Чукотский автономный округ",
				"МСК-87 зона 5 (6 градусная) Чукотский автономный округ",
				"МСК-87 зона 6 (6 градусная) Чукотский автономный округ",
				"МСК-87 зона 7 (6 градусная) Чукотский автономный округ",
				"МСК-87 зона 8 (6 градусная) Чукотский автономный округ",
				"СК-1963 район C зона 1",
				"СК-1963 район C зона 2",
				"СК-1963 район C зона 3",
				"СК-1963 район C зона 4",
				"СК-1963 район C зона 5",
				"СК-1963 район C зона 6",
				"СК-1963 район D зона 1",
				"СК-1963 район D зона 2",
				"СК-1963 район D зона 3",
				"СК-1963 район D зона 4",
				"СК-1963 район D зона 5",
				"СК-1963 район D зона 6",
				"СК-1963 район D зона 7",
				"СК-1963 район D зона 8",
				"СК-1963 район F зона 1",
				"СК-1963 район F зона 2",
				"СК-1963 район F зона 3",
				"СК-1963 район G зона 1",
				"СК-1963 район G зона 2",
				"СК-1963 район G зона 3",
				"СК-1963 район G зона 4",
				"СК-1963 район G зона 5",
				"СК-1963 район G зона 6",
				"СК-1963 район G зона 7",
				"СК-1963 район G зона 8",
				"СК-1963 район G зона 9",
				"СК-1963 район I зона 1",
				"СК-1963 район I зона 2",
				"СК-1963 район I зона 3",
				"СК-1963 район I зона 4",
				"СК-1963 район M зона 1",
				"СК-1963 район M зона 2",
				"СК-1963 район M зона 3",
				"СК-1963 район M зона 4",
				"СК-1963 район P зона 1",
				"СК-1963 район P зона 2",
				"СК-1963 район P зона 3",
				"СК-1963 район P зона 4",
				"СК-1963 район R зона 1",
				"СК-1963 район R зона 2",
				"СК-1963 район R зона 3",
				"СК-1963 район V зона 1",
				"СК-1963 район V зона 2",
				"СК-1963 район V зона 3",
				"СК-1963 район V зона 4",
				"СК-1963 район V зона 5",
				"СК-1963 район V зона 6",
				"СК-1963 район X зона 1",
				"СК-1963 район X зона 2",
				"СК-1963 район X зона 3",
				"СК-1963 район X зона 4",
				"СК-1963 район X зона 5",
				"СК-1963 район X зона 6",
				"Пулково 1942 зона 2 ГОСТ 51794-2008",
				"Пулково 1942 зона 3 ГОСТ 51794-2008",
				"Пулково 1942 зона 4 ГОСТ 51794-2008",
				"Пулково 1942 зона 5 ГОСТ 51794-2008",
				"Пулково 1942 зона 6 ГОСТ 51794-2008",
				"Пулково 1942 зона 7 ГОСТ 51794-2008",
				"Пулково 1942 зона 8 ГОСТ 51794-2008",
				"Пулково 1942 зона 9 ГОСТ 51794-2008",
				"Пулково 1942 зона 10 ГОСТ 51794-2008",
				"Пулково 1942 зона 11 ГОСТ 51794-2008",
				"Пулково 1942 зона 12 ГОСТ 51794-2008",
				"Пулково 1942 зона 13 ГОСТ 51794-2008",
				"Пулково 1942 зона 14 ГОСТ 51794-2008",
				"Пулково 1942 зона 15 ГОСТ 51794-2008",
				"Пулково 1942 зона 16 ГОСТ 51794-2008",
				"Пулково 1942 зона 17 ГОСТ 51794-2008",
				"Пулково 1942 зона 18 ГОСТ 51794-2008",
				"Пулково 1942 зона 19 ГОСТ 51794-2008",
				"Пулково 1942 зона 20 ГОСТ 51794-2008",
				"Пулково 1942 зона 21 ГОСТ 51794-2008",
				"Пулково 1942 зона 22 ГОСТ 51794-2008",
				"Пулково 1942 зона 23 ГОСТ 51794-2008",
				"Пулково 1942 зона 24 ГОСТ 51794-2008",
				"Пулково 1942 зона 25 ГОСТ 51794-2008",
				"Пулково 1942 зона 26 ГОСТ 51794-2008",
				"Пулково 1942 зона 27 ГОСТ 51794-2008",
				"Пулково 1942 зона 28 ГОСТ 51794-2008",
				"Пулково 1942 зона 29 ГОСТ 51794-2008",
				"Пулково 1942 зона 30 ГОСТ 51794-2008",
				"Пулково 1942 ГОСТ 51794-2008",
				"Пулково 1942 (EPSG:4284)",
				"ПЗ-90",
				"ПЗ-90.00",
				"ПЗ-90.02",
				"ПЗ-90.11",
				"СК-95",
				"ГСК-2011",	
		};
		
		String[] MetodCoord = {
				"Геодезический метод",
				"Фотограмметрический метод",
				"Картометрический метод",
				"Иное описание",
				"Метод спутниковых геодезических измерений (определений)",
				"Аналитический метод"
		};
		
		String [] TypeAdr = {
				"Описание местоположения объекта недвижимости",
				"Присвоенный в установленном порядке адрес объекта недвижимости"	
		};
		
		String [] CatZeml = {
				"Земли сельскохозяйственного назначения",
				"Земли населенных пунктов",
				"Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения",
				"Земли особо охраняемых территорий и объектов",
				"Земли лесного фонда",
				"Земли водного фонда",
				"Земли запаса",
				"Категория не установлена",
		};
		
		String[] VidRazIs = {
				"в соответствии с классификатором, утвержденным приказом Минэкономразвития России от 01.09.2014 № 540",
				"в соответствии с ранее использовавшимся классификатором (dUtilizations) и сведения о разрешенном использовании в соответствии с документом",
				"из числа видов, предусмотренных градостроительным регламентом"
		};
		
		String[] DopSvedRaz = {
				"земельный участок общего пользования",
				"земельный участок расположен в границах территории общего пользования"
		};
		
		String[] CelNazForest = {
				"Защитные леса",
				"Эксплуатационные леса",
				"Резервные леса"	
		};
		
		String[] VidRazIsp = {
				"Заготовка живицы",
				"Заготовка и сбор недревесных лесных ресурсов",
				"Заготовка пищевых лесных ресурсов и сбор лекарственных растений",
				"Осуществление видов деятельности в сфере охотничьего хозяйства",
				"Ведение сельского хозяйства",
				"Осуществление научно-исследовательской деятельности, образовательной деятельности",
				"Осуществление рекреационной деятельности",
				"Создание лесных плантаций и их эксплуатация",
				"Выращивание лесных плодовых, ягодных, декоративных растений, лекарственных растений",
				"Выращивание посадочного материала лесных растений (саженцев, сеянцев)",
				"Выполнение работ по геологическому изучению недр, разработка месторождений полезных ископаемых",
				"Строительство и эксплуатация водохранилищ и иных искусственных водных объектов, а также гидротехнических сооружений, морских портов, морских терминалов, речных портов, причалов",
				"Строительство, реконструкция, эксплуатация линейных объектов",
				"Переработка древесины и иных лесных ресурсов",
				"Осуществление религиозной деятельности",
				"Иные виды, определенные в соответствии с частью 2 статьи б Лесного кодекса",
		};
		
		String[] TypePart = {
				"Образуемая", "Изменяемая", "Неизменяемая"
		};
		
		String[] VigDanRaz = {
				"Уточнение границ земельного участка (<SpecifyParcel>)",
				"Уточнение границ смежного земельного участка (<SpecifyRelatedParcel>)",
				"Уточнение границ и площади смежного земельного участка (<SpecifyParcelApproximal>)"	
		};
		
		frmvb = new JFrame();
		frmvb.setTitle("\u041C\u0435\u0436\u0435\u0432\u043E\u0439 \u043F\u043B\u0430\u043D (v1.1.1b)");
		frmvb.setBounds(100, 100, 1118, 841);
		frmvb.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
		SpringLayout springLayout = new SpringLayout();
		frmvb.getContentPane().setLayout(springLayout);
		
		JTabbedPane tabbedPane = new JTabbedPane(JTabbedPane.TOP);
		springLayout.putConstraint(SpringLayout.NORTH, tabbedPane, 10, SpringLayout.NORTH, frmvb.getContentPane());
		springLayout.putConstraint(SpringLayout.WEST, tabbedPane, 10, SpringLayout.WEST, frmvb.getContentPane());
		springLayout.putConstraint(SpringLayout.SOUTH, tabbedPane, 756, SpringLayout.NORTH, frmvb.getContentPane());
		springLayout.putConstraint(SpringLayout.EAST, tabbedPane, 1092, SpringLayout.WEST, frmvb.getContentPane());
		frmvb.getContentPane().add(tabbedPane);
		
		JPanel panel = new JPanel();
		tabbedPane.addTab("Титульный", null, panel, null);
		SpringLayout sl_panel = new SpringLayout();
		panel.setLayout(sl_panel);
		
		JLabel lblNewLabel = new JLabel("<html>*1.\u041C\u0435\u0436\u0435\u0432\u043E\u0439 \u043F\u043B\u0430\u043D \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043B\u0435\u043D \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 <br>\u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0445 \u0440\u0430\u0431\u043E\u0442 \u0432 \u0441\u0432\u044F\u0437\u0438 \u0441:</html>");
		sl_panel.putConstraint(SpringLayout.NORTH, lblNewLabel, 13, SpringLayout.NORTH, panel);
		sl_panel.putConstraint(SpringLayout.WEST, lblNewLabel, 10, SpringLayout.WEST, panel);
		sl_panel.putConstraint(SpringLayout.EAST, lblNewLabel, -793, SpringLayout.EAST, panel);
		panel.add(lblNewLabel);
		
		JComboBox comboBox = new JComboBox(MegTitul);
		sl_panel.putConstraint(SpringLayout.EAST, comboBox, -201, SpringLayout.EAST, panel);
		sl_panel.putConstraint(SpringLayout.SOUTH, comboBox, -668, SpringLayout.SOUTH, panel);
		sl_panel.putConstraint(SpringLayout.NORTH, comboBox, 14, SpringLayout.NORTH, panel);
		sl_panel.putConstraint(SpringLayout.WEST, comboBox, 290, SpringLayout.WEST, panel);
		panel.add(comboBox);
		
		comboBox.setEditable(true);
		
		JLabel label = new JLabel("*\u0421\u043F\u043E\u0441\u043E\u0431 \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u0443\u0447\u0430\u0441\u0442\u043A\u0430 (\u043E\u0432)");
		sl_panel.putConstraint(SpringLayout.NORTH, label, 11, SpringLayout.SOUTH, lblNewLabel);
		sl_panel.putConstraint(SpringLayout.WEST, label, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label);
		
		JComboBox comboBox_1 = new JComboBox(SposobTitul);
		sl_panel.putConstraint(SpringLayout.NORTH, comboBox_1, -3, SpringLayout.NORTH, label);
		panel.add(comboBox_1);
		
		JLabel label_1 = new JLabel("\u0426\u0435\u043B\u044C \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0445 \u0440\u0430\u0431\u043E\u0442");
		sl_panel.putConstraint(SpringLayout.NORTH, label_1, 26, SpringLayout.SOUTH, label);
		sl_panel.putConstraint(SpringLayout.WEST, label_1, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_1);
		
		textField = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField, -3, SpringLayout.NORTH, label_1);
		sl_panel.putConstraint(SpringLayout.WEST, textField, 33, SpringLayout.EAST, label_1);
		sl_panel.putConstraint(SpringLayout.EAST, textField, -127, SpringLayout.EAST, panel);
		panel.add(textField);
		textField.setColumns(10);
		
		JLabel label_2 = new JLabel("*3.\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0437\u0430\u043A\u0430\u0437\u0447\u0438\u043A\u0435 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0445 \u0440\u0430\u0431\u043E\u0442:");
		sl_panel.putConstraint(SpringLayout.NORTH, label_2, 6, SpringLayout.SOUTH, label_1);
		sl_panel.putConstraint(SpringLayout.WEST, label_2, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_2);
		
		JLabel label_3 = new JLabel("\u0424\u0438\u0437. \u043B\u0438\u0446\u043E:");
		sl_panel.putConstraint(SpringLayout.NORTH, label_3, 6, SpringLayout.SOUTH, label_2);
		sl_panel.putConstraint(SpringLayout.WEST, label_3, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_3);
		
		JLabel label_4 = new JLabel("\u0424\u0430\u043C\u0438\u043B\u0438\u044F");
		sl_panel.putConstraint(SpringLayout.NORTH, label_4, 27, SpringLayout.SOUTH, label_2);
		sl_panel.putConstraint(SpringLayout.WEST, label_4, 111, SpringLayout.WEST, panel);
		panel.add(label_4);
		
		textField_1 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_1, 6, SpringLayout.SOUTH, label_2);
		sl_panel.putConstraint(SpringLayout.WEST, textField_1, 27, SpringLayout.EAST, label_3);
		panel.add(textField_1);
		textField_1.setColumns(10);
		
		JLabel label_5 = new JLabel("\u0418\u043C\u044F");
		sl_panel.putConstraint(SpringLayout.NORTH, label_5, 0, SpringLayout.NORTH, label_4);
		sl_panel.putConstraint(SpringLayout.WEST, label_5, 97, SpringLayout.EAST, label_4);
		panel.add(label_5);
		
		textField_2 = new JTextField();
		sl_panel.putConstraint(SpringLayout.WEST, comboBox_1, 0, SpringLayout.WEST, textField_2);
		sl_panel.putConstraint(SpringLayout.WEST, textField_2, 32, SpringLayout.EAST, textField_1);
		sl_panel.putConstraint(SpringLayout.SOUTH, textField_2, -1, SpringLayout.NORTH, label_5);
		sl_panel.putConstraint(SpringLayout.EAST, textField_2, 141, SpringLayout.EAST, textField_1);
		panel.add(textField_2);
		textField_2.setColumns(10);
		
		textField_3 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_3, 0, SpringLayout.NORTH, label_3);
		sl_panel.putConstraint(SpringLayout.WEST, textField_3, 29, SpringLayout.EAST, textField_2);
		panel.add(textField_3);
		textField_3.setColumns(10);
		
		JLabel label_6 = new JLabel("\u041E\u0442\u0447\u0435\u0441\u0442\u0432\u043E (\u043F\u0440\u0438 \u043D\u0430\u043B\u0438\u0447\u0438\u0438)");
		sl_panel.putConstraint(SpringLayout.NORTH, label_6, 11, SpringLayout.SOUTH, textField_3);
		sl_panel.putConstraint(SpringLayout.WEST, label_6, 59, SpringLayout.EAST, label_5);
		panel.add(label_6);
		
		JLabel label_7 = new JLabel("\u2116 \u0421\u041D\u0418\u041B\u0421");
		sl_panel.putConstraint(SpringLayout.NORTH, label_7, 0, SpringLayout.NORTH, label_4);
		sl_panel.putConstraint(SpringLayout.WEST, label_7, 130, SpringLayout.EAST, label_6);
		panel.add(label_7);
		
		textField_4 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_4, 0, SpringLayout.NORTH, label_3);
		sl_panel.putConstraint(SpringLayout.WEST, textField_4, 109, SpringLayout.EAST, textField_3);
		sl_panel.putConstraint(SpringLayout.EAST, textField_4, 247, SpringLayout.EAST, textField_3);
		panel.add(textField_4);
		textField_4.setColumns(10);
		
		JLabel label_8 = new JLabel("\u041E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u044F:");
		sl_panel.putConstraint(SpringLayout.NORTH, label_8, 31, SpringLayout.SOUTH, label_3);
		sl_panel.putConstraint(SpringLayout.WEST, label_8, 10, SpringLayout.WEST, panel);
		panel.add(label_8);
		
		JLabel label_9 = new JLabel("*\u0412\u0438\u0434 \u043E\u0433\u0440\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u0438");
		sl_panel.putConstraint(SpringLayout.NORTH, label_9, 6, SpringLayout.SOUTH, label_8);
		sl_panel.putConstraint(SpringLayout.WEST, label_9, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_9);
		
		JComboBox comboBox_2 = new JComboBox(TypeOrg);
		sl_panel.putConstraint(SpringLayout.NORTH, comboBox_2, -3, SpringLayout.NORTH, label_9);
		sl_panel.putConstraint(SpringLayout.WEST, comboBox_2, 0, SpringLayout.WEST, label_4);
		sl_panel.putConstraint(SpringLayout.EAST, comboBox_2, 197, SpringLayout.WEST, label_4);
		panel.add(comboBox_2);
		
		JLabel label_10 = new JLabel("*\u041F\u043E\u043B\u043D\u043E\u0435 \u043D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435");
		sl_panel.putConstraint(SpringLayout.NORTH, label_10, 0, SpringLayout.NORTH, label_9);
		sl_panel.putConstraint(SpringLayout.WEST, label_10, 0, SpringLayout.WEST, label_6);
		panel.add(label_10);
		
		textField_5 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_5, 20, SpringLayout.SOUTH, label_6);
		sl_panel.putConstraint(SpringLayout.WEST, textField_5, 6, SpringLayout.EAST, label_10);
		sl_panel.putConstraint(SpringLayout.EAST, textField_5, 357, SpringLayout.EAST, label_10);
		panel.add(textField_5);
		textField_5.setColumns(10);
		
		JLabel label_11 = new JLabel("*\u0418\u041D\u041D (10 \u0446\u0438\u0444\u0440)");
		sl_panel.putConstraint(SpringLayout.WEST, label_11, 10, SpringLayout.WEST, panel);
		panel.add(label_11);
		
		textField_6 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, label_11, 3, SpringLayout.NORTH, textField_6);
		sl_panel.putConstraint(SpringLayout.NORTH, textField_6, 6, SpringLayout.SOUTH, comboBox_2);
		sl_panel.putConstraint(SpringLayout.WEST, textField_6, 0, SpringLayout.WEST, label_4);
		panel.add(textField_6);
		textField_6.setColumns(10);
		
		JLabel label_12 = new JLabel("\u041E\u0413\u0420\u041D");
		sl_panel.putConstraint(SpringLayout.NORTH, label_12, 3, SpringLayout.NORTH, textField_6);
		sl_panel.putConstraint(SpringLayout.EAST, label_12, 0, SpringLayout.EAST, label_2);
		panel.add(label_12);
		
		textField_7 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_7, 6, SpringLayout.SOUTH, comboBox_2);
		sl_panel.putConstraint(SpringLayout.WEST, textField_7, 0, SpringLayout.WEST, label_5);
		panel.add(textField_7);
		textField_7.setColumns(10);
		
		JLabel label_13 = new JLabel("\u0421\u0442\u0440\u0430\u043D\u0430 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438");
		sl_panel.putConstraint(SpringLayout.WEST, label_13, 22, SpringLayout.EAST, textField_7);
		sl_panel.putConstraint(SpringLayout.SOUTH, label_13, 0, SpringLayout.SOUTH, textField_6);
		panel.add(label_13);
		
		textField_8 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_8, 6, SpringLayout.SOUTH, textField_5);
		sl_panel.putConstraint(SpringLayout.WEST, textField_8, 14, SpringLayout.EAST, label_13);
		panel.add(textField_8);
		textField_8.setColumns(10);
		
		JLabel label_14 = new JLabel("*4.\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u043C \u0438\u043D\u0436\u0435\u043D\u0435\u0440\u0435");
		sl_panel.putConstraint(SpringLayout.NORTH, label_14, 24, SpringLayout.SOUTH, label_11);
		sl_panel.putConstraint(SpringLayout.WEST, label_14, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_14);
		
		JLabel label_15 = new JLabel("*\u0424\u0430\u043C\u0438\u043B\u0438\u044F");
		sl_panel.putConstraint(SpringLayout.NORTH, label_15, 6, SpringLayout.SOUTH, label_14);
		sl_panel.putConstraint(SpringLayout.WEST, label_15, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_15);
		
		textField_9 = new JTextField();
		sl_panel.putConstraint(SpringLayout.WEST, textField_9, 6, SpringLayout.EAST, label_15);
		sl_panel.putConstraint(SpringLayout.SOUTH, textField_9, 0, SpringLayout.SOUTH, label_15);
		panel.add(textField_9);
		textField_9.setColumns(10);
		
		JLabel label_16 = new JLabel("*\u0418\u043C\u044F");
		sl_panel.putConstraint(SpringLayout.NORTH, label_16, 6, SpringLayout.SOUTH, label_14);
		sl_panel.putConstraint(SpringLayout.WEST, label_16, 6, SpringLayout.EAST, textField_9);
		panel.add(label_16);
		
		textField_10 = new JTextField();
		sl_panel.putConstraint(SpringLayout.WEST, textField_10, 6, SpringLayout.EAST, label_16);
		sl_panel.putConstraint(SpringLayout.SOUTH, textField_10, 0, SpringLayout.SOUTH, label_15);
		panel.add(textField_10);
		textField_10.setColumns(10);
		
		JLabel label_17 = new JLabel("\u041E\u0442\u0447\u0435\u0441\u0442\u0432\u043E");
		sl_panel.putConstraint(SpringLayout.NORTH, label_17, 0, SpringLayout.NORTH, label_15);
		sl_panel.putConstraint(SpringLayout.WEST, label_17, 6, SpringLayout.EAST, textField_10);
		panel.add(label_17);
		
		textField_11 = new JTextField();
		sl_panel.putConstraint(SpringLayout.WEST, textField_11, 4, SpringLayout.EAST, label_17);
		sl_panel.putConstraint(SpringLayout.SOUTH, textField_11, 0, SpringLayout.SOUTH, label_15);
		panel.add(textField_11);
		textField_11.setColumns(10);
		
		JLabel label_18 = new JLabel("<html>*Номер квалификационного аттестата<br>кадастрового инженера XX-XX-N<html>");
		sl_panel.putConstraint(SpringLayout.WEST, label_18, 20, SpringLayout.EAST, textField_11);
		sl_panel.putConstraint(SpringLayout.SOUTH, label_18, 0, SpringLayout.SOUTH, label_15);
		panel.add(label_18);
		
		textField_12 = new JTextField();
		sl_panel.putConstraint(SpringLayout.WEST, textField_12, 6, SpringLayout.EAST, label_18);
		sl_panel.putConstraint(SpringLayout.SOUTH, textField_12, 0, SpringLayout.SOUTH, label_15);
		sl_panel.putConstraint(SpringLayout.EAST, textField_12, 0, SpringLayout.EAST, textField_5);
		panel.add(textField_12);
		textField_12.setColumns(10);
		
		JLabel label_19 = new JLabel("*\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u043D\u044B\u0439 \u0442\u0435\u043B");
		sl_panel.putConstraint(SpringLayout.NORTH, label_19, 6, SpringLayout.SOUTH, label_15);
		sl_panel.putConstraint(SpringLayout.WEST, label_19, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_19);
		
		textField_13 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_13, 6, SpringLayout.SOUTH, textField_9);
		sl_panel.putConstraint(SpringLayout.WEST, textField_13, 0, SpringLayout.WEST, label_4);
		panel.add(textField_13);
		textField_13.setColumns(10);
		
		JLabel label_20 = new JLabel("<html>*Почтовый адрес для связи<br>с кадастровым инженером<html>");
		sl_panel.putConstraint(SpringLayout.NORTH, label_20, 0, SpringLayout.NORTH, label_19);
		panel.add(label_20);
		
		textField_14 = new JTextField();
		sl_panel.putConstraint(SpringLayout.EAST, label_20, -6, SpringLayout.WEST, textField_14);
		sl_panel.putConstraint(SpringLayout.WEST, textField_14, 407, SpringLayout.WEST, panel);
		sl_panel.putConstraint(SpringLayout.EAST, textField_14, 0, SpringLayout.EAST, textField);
		sl_panel.putConstraint(SpringLayout.NORTH, textField_14, 6, SpringLayout.SOUTH, textField_11);
		panel.add(textField_14);
		textField_14.setColumns(10);
		
		JLabel lblEmail = new JLabel("E-mail");
		sl_panel.putConstraint(SpringLayout.NORTH, lblEmail, 22, SpringLayout.SOUTH, label_19);
		sl_panel.putConstraint(SpringLayout.WEST, lblEmail, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(lblEmail);
		
		textField_15 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_15, -3, SpringLayout.NORTH, lblEmail);
		sl_panel.putConstraint(SpringLayout.WEST, textField_15, 6, SpringLayout.EAST, lblEmail);
		sl_panel.putConstraint(SpringLayout.EAST, textField_15, 0, SpringLayout.EAST, textField_1);
		panel.add(textField_15);
		textField_15.setColumns(10);
		
		JLabel label_21 = new JLabel("*\u041D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u042E\u0420 \u043B\u0438\u0446\u0430");
		sl_panel.putConstraint(SpringLayout.NORTH, label_21, 43, SpringLayout.SOUTH, textField_13);
		sl_panel.putConstraint(SpringLayout.WEST, label_21, 0, SpringLayout.WEST, lblNewLabel);
		panel.add(label_21);
		
		textField_16 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_16, -3, SpringLayout.NORTH, label_21);
		sl_panel.putConstraint(SpringLayout.WEST, textField_16, 12, SpringLayout.EAST, label_21);
		panel.add(textField_16);
		textField_16.setColumns(10);
		
		JLabel label_22 = new JLabel("*\u0410\u0434\u0440\u0435\u0441 \u043C\u0435\u0442\u043E\u043D\u0430\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u042E\u0420 \u043B\u0438\u0446\u0430");
		sl_panel.putConstraint(SpringLayout.NORTH, label_22, 0, SpringLayout.NORTH, label_21);
		sl_panel.putConstraint(SpringLayout.WEST, label_22, 0, SpringLayout.WEST, label_5);
		panel.add(label_22);
		
		textField_17 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_17, -3, SpringLayout.NORTH, label_21);
		sl_panel.putConstraint(SpringLayout.WEST, textField_17, 7, SpringLayout.EAST, label_22);
		panel.add(textField_17);
		textField_17.setColumns(10);
		
		JLabel label_23 = new JLabel("\u0414\u0430\u0442\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u044F \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0445 \u0440\u0430\u0431\u043E\u0442");
		sl_panel.putConstraint(SpringLayout.NORTH, label_23, 0, SpringLayout.NORTH, label_21);
		sl_panel.putConstraint(SpringLayout.WEST, label_23, 6, SpringLayout.EAST, textField_17);
		panel.add(label_23);
		
		textField_18 = new JTextField();
		sl_panel.putConstraint(SpringLayout.NORTH, textField_18, -3, SpringLayout.NORTH, label_21);
		sl_panel.putConstraint(SpringLayout.WEST, textField_18, 17, SpringLayout.EAST, label_23);
		panel.add(textField_18);
		textField_18.setColumns(10);
		
		JPanel panel_5 = new JPanel();
		tabbedPane.addTab("Измененные", null, panel_5, null);
		SpringLayout sl_panel_5 = new SpringLayout();
		panel_5.setLayout(sl_panel_5);
		
		JLabel label_130 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_130, 10, SpringLayout.NORTH, panel_5);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_130, 10, SpringLayout.WEST, panel_5);
		panel_5.add(label_130);
		
		JLabel label_131 = new JLabel("1. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_131, 6, SpringLayout.SOUTH, label_130);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_131, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_131);
		
		JLabel label_132 = new JLabel("! * \u041D\u043E\u043C\u0435\u0440 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0433\u043E \u043A\u0432\u0430\u0440\u0442\u0430\u043B\u0430");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_132, 3, SpringLayout.SOUTH, label_131);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_132, 10, SpringLayout.WEST, panel_5);
		panel_5.add(label_132);
		
		textField_110 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_110, 6, SpringLayout.SOUTH, label_131);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_110, 5, SpringLayout.EAST, label_132);
		panel_5.add(textField_110);
		textField_110.setColumns(10);
		
		JLabel label_133 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_133, 6, SpringLayout.SOUTH, label_131);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_133, 6, SpringLayout.EAST, textField_110);
		panel_5.add(label_133);
		
		textField_111 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_111, -3, SpringLayout.NORTH, label_132);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_111, 6, SpringLayout.EAST, label_133);
		panel_5.add(textField_111);
		textField_111.setColumns(10);
		
		JLabel label_134 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432, \u0438\u0441\u043A\u043B\u044E\u0447\u0430\u0435\u043C\u044B\u0445 \u0438\u0437 \u0441\u043E\u0441\u0442\u0430\u0432\u0430 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u043D\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0435\u0433\u043E \u0441\u043E\u0431\u043E\u0439 \u0435\u0434\u0438\u043D\u043E\u0435 \u0437\u0435\u043C\u043B\u0435\u043F\u043E\u043B");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_134, 6, SpringLayout.SOUTH, label_132);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_134, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_134);
		
		textField_112 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_112, 0, SpringLayout.NORTH, label_134);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_112, 6, SpringLayout.EAST, label_134);
		panel_5.add(textField_112);
		textField_112.setColumns(10);
		
		JLabel label_135 = new JLabel("\u0423\u0447\u0435\u0442\u043D\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u043A\u043E\u043D\u0442\u0443\u0440\u043E\u0432 \u043C\u043D\u043E\u0433\u043E\u043A\u043E\u043D\u0442\u0443\u0440\u043D\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0435 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0435\u0442\u0441\u044F");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_135, 6, SpringLayout.SOUTH, label_134);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_135, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_135);
		
		textField_113 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_113, 6, SpringLayout.SOUTH, label_134);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_113, 18, SpringLayout.EAST, label_135);
		panel_5.add(textField_113);
		textField_113.setColumns(10);
		
		JLabel label_136 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u0438\u043B\u0438 \u0438\u043D\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u043D\u0435\u0434\u0432\u0438\u0436\u0438\u043C\u043E\u0441\u0442\u0438, \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0445 \u043D\u0430 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u043C \u0443\u0447\u0430\u0441\u0442\u043A\u0435");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_136, 12, SpringLayout.SOUTH, label_135);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_136, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_136);
		
		textField_114 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_114, 6, SpringLayout.SOUTH, textField_113);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_114, 21, SpringLayout.EAST, label_136);
		panel_5.add(textField_114);
		textField_114.setColumns(10);
		
		JLabel label_137 = new JLabel("\u0418\u043D\u044B\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_137, 26, SpringLayout.EAST, textField_114);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_137, 0, SpringLayout.SOUTH, label_136);
		panel_5.add(label_137);
		
		textField_115 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_115, 25, SpringLayout.EAST, label_137);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, textField_115, 0, SpringLayout.SOUTH, textField_114);
		panel_5.add(textField_115);
		textField_115.setColumns(10);
		
		JLabel label_138 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0442\u0441\u043A\u0443\u0430");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_138, 6, SpringLayout.SOUTH, label_136);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_138, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_138);
		
		JLabel label_139 = new JLabel("1. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0433\u0440\u0430\u043D\u0438\u0446 \u0447\u0430\u0441\u0442\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_139, 6, SpringLayout.SOUTH, label_138);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_139, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_139);
		
		textField_116 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_116, 0, SpringLayout.NORTH, label_139);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_116, 16, SpringLayout.EAST, label_139);
		panel_5.add(textField_116);
		textField_116.setColumns(10);
		
		JLabel label_140 = new JLabel("\u0427\u0430\u0441\u0442\u044C");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_140, 23, SpringLayout.EAST, textField_116);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_140, 0, SpringLayout.SOUTH, label_139);
		panel_5.add(label_140);
		
		textField_117 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_117, 11, SpringLayout.EAST, label_140);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, textField_117, 0, SpringLayout.SOUTH, textField_116);
		panel_5.add(textField_117);
		textField_117.setColumns(10);
		
		JLabel label_141 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_141, 0, SpringLayout.NORTH, label_139);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_141, 26, SpringLayout.EAST, textField_117);
		panel_5.add(label_141);
		
		textField_118 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_118, 0, SpringLayout.NORTH, label_139);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_118, 17, SpringLayout.EAST, label_141);
		panel_5.add(textField_118);
		textField_118.setColumns(10);
		
		JLabel lblX_2 = new JLabel("! X, \u043C");
		sl_panel_5.putConstraint(SpringLayout.NORTH, lblX_2, 6, SpringLayout.SOUTH, label_139);
		sl_panel_5.putConstraint(SpringLayout.WEST, lblX_2, 0, SpringLayout.WEST, label_130);
		panel_5.add(lblX_2);
		
		textField_119 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_119, 6, SpringLayout.SOUTH, label_139);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_119, 6, SpringLayout.EAST, lblX_2);
		panel_5.add(textField_119);
		textField_119.setColumns(10);
		
		JLabel lblY_1 = new JLabel("! Y, \u043C");
		sl_panel_5.putConstraint(SpringLayout.WEST, lblY_1, 6, SpringLayout.EAST, textField_119);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, lblY_1, 0, SpringLayout.SOUTH, textField_119);
		panel_5.add(lblY_1);
		
		textField_120 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_120, 16, SpringLayout.EAST, lblY_1);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, textField_120, 0, SpringLayout.SOUTH, textField_119);
		panel_5.add(textField_120);
		textField_120.setColumns(10);
		
		JLabel label_142 = new JLabel("! \u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_142, 6, SpringLayout.SOUTH, textField_116);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_142, 0, SpringLayout.WEST, label_133);
		panel_5.add(label_142);
		
		textField_121 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_121, 6, SpringLayout.SOUTH, textField_117);
		sl_panel_5.putConstraint(SpringLayout.EAST, textField_121, 0, SpringLayout.EAST, textField_114);
		panel_5.add(textField_121);
		textField_121.setColumns(10);
		
		JLabel label_143 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_143, 33, SpringLayout.EAST, textField_121);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_143, 0, SpringLayout.SOUTH, textField_121);
		panel_5.add(label_143);
		
		textField_122 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_122, 6, SpringLayout.SOUTH, textField_118);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_122, 0, SpringLayout.WEST, textField_118);
		panel_5.add(textField_122);
		textField_122.setColumns(10);
		
		JLabel label_144 = new JLabel("2. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0445 \u0433\u0440\u0430\u043D\u0438\u0446 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_144, 22, SpringLayout.SOUTH, textField_119);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_144, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_144);
		
		JLabel label_145 = new JLabel("\u0427\u0430\u0441\u0442\u044C");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_145, 0, SpringLayout.WEST, textField_116);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_145, 0, SpringLayout.SOUTH, label_144);
		panel_5.add(label_145);
		
		textField_123 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_123, 0, SpringLayout.NORTH, label_144);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_123, 6, SpringLayout.EAST, label_145);
		panel_5.add(textField_123);
		textField_123.setColumns(10);
		
		JLabel label_146 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_146, 0, SpringLayout.NORTH, label_144);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_146, 6, SpringLayout.EAST, textField_123);
		panel_5.add(label_146);
		
		textField_124 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_124, 0, SpringLayout.NORTH, label_144);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_124, 6, SpringLayout.EAST, label_146);
		panel_5.add(textField_124);
		textField_124.setColumns(10);
		
		JLabel label_147 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0443\u0442\u043E\u0447");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_147, 3, SpringLayout.NORTH, textField_123);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_147, 20, SpringLayout.EAST, textField_124);
		panel_5.add(label_147);
		
		textField_125 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_125, 0, SpringLayout.WEST, textField_118);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, textField_125, 0, SpringLayout.SOUTH, label_144);
		panel_5.add(textField_125);
		textField_125.setColumns(10);
		
		JLabel lblX_3 = new JLabel("X \u0441\u0443\u0449, \u043C");
		sl_panel_5.putConstraint(SpringLayout.NORTH, lblX_3, 23, SpringLayout.SOUTH, label_144);
		sl_panel_5.putConstraint(SpringLayout.WEST, lblX_3, 10, SpringLayout.WEST, panel_5);
		panel_5.add(lblX_3);
		
		textField_126 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_126, -3, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_126, 6, SpringLayout.EAST, lblX_3);
		panel_5.add(textField_126);
		textField_126.setColumns(10);
		
		JLabel lblY_2 = new JLabel("Y \u0441\u0443\u0449. \u043C");
		sl_panel_5.putConstraint(SpringLayout.NORTH, lblY_2, 0, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, lblY_2, 6, SpringLayout.EAST, textField_126);
		panel_5.add(lblY_2);
		
		textField_127 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_127, -3, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_127, 6, SpringLayout.EAST, lblY_2);
		panel_5.add(textField_127);
		textField_127.setColumns(10);
		
		JLabel lblX_4 = new JLabel("X \u0443\u0442\u043E\u0447, \u043C");
		sl_panel_5.putConstraint(SpringLayout.SOUTH, lblX_4, 0, SpringLayout.SOUTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.EAST, lblX_4, 0, SpringLayout.EAST, label_145);
		panel_5.add(lblX_4);
		
		textField_128 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_128, -3, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_128, 0, SpringLayout.WEST, textField_123);
		panel_5.add(textField_128);
		textField_128.setColumns(10);
		
		JLabel lblY_3 = new JLabel("Y \u0443\u0442\u043E\u0447, \u043C");
		sl_panel_5.putConstraint(SpringLayout.NORTH, lblY_3, 0, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, lblY_3, 0, SpringLayout.WEST, label_146);
		panel_5.add(lblY_3);
		
		textField_129 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_129, -3, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_129, 0, SpringLayout.WEST, textField_111);
		panel_5.add(textField_129);
		textField_129.setColumns(10);
		
		JLabel label_148 = new JLabel("! \u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_148, 0, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_148, 6, SpringLayout.EAST, textField_129);
		panel_5.add(label_148);
		
		textField_130 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_130, -3, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_130, 0, SpringLayout.WEST, label_147);
		panel_5.add(textField_130);
		textField_130.setColumns(10);
		
		JLabel label_149 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_149, 0, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_149, 6, SpringLayout.EAST, textField_130);
		panel_5.add(label_149);
		
		textField_131 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_131, 0, SpringLayout.NORTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_131, 6, SpringLayout.EAST, label_149);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, textField_131, -436, SpringLayout.SOUTH, panel_5);
		sl_panel_5.putConstraint(SpringLayout.EAST, textField_131, -32, SpringLayout.EAST, panel_5);
		panel_5.add(textField_131);
		textField_131.setColumns(10);
		
		JLabel label_150 = new JLabel("3. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_150, 25, SpringLayout.SOUTH, lblX_3);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_150, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_150);
		
		JLabel label_151 = new JLabel("! \u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_151, 6, SpringLayout.SOUTH, label_150);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_151, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_151);
		
		textField_132 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_132, 6, SpringLayout.SOUTH, label_150);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_132, 6, SpringLayout.EAST, label_151);
		panel_5.add(textField_132);
		textField_132.setColumns(10);
		
		JLabel label_152 = new JLabel("! \u041F\u043B\u043E\u0449\u0430\u0434\u044C (\u0420), \u043C2");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_152, 34, SpringLayout.EAST, textField_132);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_152, 0, SpringLayout.SOUTH, label_151);
		panel_5.add(label_152);
		
		textField_133 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_133, 0, SpringLayout.NORTH, label_151);
		sl_panel_5.putConstraint(SpringLayout.WEST, textField_133, 7, SpringLayout.EAST, label_152);
		panel_5.add(textField_133);
		textField_133.setColumns(10);
		
		JLabel label_153 = new JLabel("+-\u0414\u0435\u043B\u044C\u0442\u0430\u0420, \u043C2");
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_153, 0, SpringLayout.SOUTH, label_151);
		sl_panel_5.putConstraint(SpringLayout.EAST, label_153, 0, SpringLayout.EAST, textField_114);
		panel_5.add(label_153);
		
		textField_134 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_134, 0, SpringLayout.NORTH, label_151);
		sl_panel_5.putConstraint(SpringLayout.EAST, textField_134, 0, SpringLayout.EAST, label_137);
		panel_5.add(textField_134);
		textField_134.setColumns(10);
		
		JLabel label_154 = new JLabel("! \u0422\u0438\u043F \u0447\u0430\u0441\u0442\u0438");
		sl_panel_5.putConstraint(SpringLayout.NORTH, label_154, 29, SpringLayout.SOUTH, label_151);
		sl_panel_5.putConstraint(SpringLayout.WEST, label_154, 0, SpringLayout.WEST, label_130);
		panel_5.add(label_154);
		
		JComboBox comboBox_14 = new JComboBox(TypePart);
		sl_panel_5.putConstraint(SpringLayout.NORTH, comboBox_14, -3, SpringLayout.NORTH, label_154);
		sl_panel_5.putConstraint(SpringLayout.WEST, comboBox_14, 24, SpringLayout.EAST, label_154);
		panel_5.add(comboBox_14);
		
		JLabel label_155 = new JLabel("! \u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_5.putConstraint(SpringLayout.WEST, label_155, 0, SpringLayout.WEST, textField_132);
		sl_panel_5.putConstraint(SpringLayout.SOUTH, label_155, 0, SpringLayout.SOUTH, label_154);
		panel_5.add(label_155);
		
		textField_135 = new JTextField();
		sl_panel_5.putConstraint(SpringLayout.NORTH, textField_135, 0, SpringLayout.NORTH, label_154);
		sl_panel_5.putConstraint(SpringLayout.EAST, textField_135, 0, SpringLayout.EAST, label_140);
		panel_5.add(textField_135);
		textField_135.setColumns(10);
		
		JPanel panel_1 = new JPanel();
		tabbedPane.addTab("Содержание", null, panel_1, null);
		SpringLayout sl_panel_1 = new SpringLayout();
		panel_1.setLayout(sl_panel_1);
		
		JLabel lblNewLabel_1 = new JLabel("\u0421\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435");
		sl_panel_1.putConstraint(SpringLayout.NORTH, lblNewLabel_1, 10, SpringLayout.NORTH, panel_1);
		sl_panel_1.putConstraint(SpringLayout.WEST, lblNewLabel_1, 350, SpringLayout.WEST, panel_1);
		panel_1.add(lblNewLabel_1);
		
		JLabel label_24 = new JLabel("*\u041D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_1.putConstraint(SpringLayout.NORTH, label_24, 34, SpringLayout.NORTH, panel_1);
		sl_panel_1.putConstraint(SpringLayout.WEST, label_24, 30, SpringLayout.WEST, panel_1);
		panel_1.add(label_24);
		
		textField_19 = new JTextField();
		sl_panel_1.putConstraint(SpringLayout.NORTH, textField_19, 6, SpringLayout.SOUTH, label_24);
		sl_panel_1.putConstraint(SpringLayout.WEST, textField_19, 61, SpringLayout.WEST, panel_1);
		panel_1.add(textField_19);
		textField_19.setColumns(10);
		
		JLabel label_25 = new JLabel("*\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0439 \u0444\u0430\u0439\u043B");
		sl_panel_1.putConstraint(SpringLayout.NORTH, label_25, 0, SpringLayout.NORTH, label_24);
		sl_panel_1.putConstraint(SpringLayout.EAST, label_25, 0, SpringLayout.EAST, lblNewLabel_1);
		panel_1.add(label_25);
		
		JLabel label_26 = new JLabel("*\u0412\u0438\u0434 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u0433\u043E \u0444\u0430\u0439\u043B\u0430");
		sl_panel_1.putConstraint(SpringLayout.NORTH, label_26, 0, SpringLayout.NORTH, label_24);
		sl_panel_1.putConstraint(SpringLayout.WEST, label_26, 150, SpringLayout.EAST, label_25);
		panel_1.add(label_26);
		
		textField_20 = new JTextField();
		sl_panel_1.putConstraint(SpringLayout.NORTH, textField_20, 0, SpringLayout.NORTH, textField_19);
		sl_panel_1.putConstraint(SpringLayout.WEST, textField_20, 10, SpringLayout.WEST, label_25);
		panel_1.add(textField_20);
		textField_20.setColumns(10);
		
		JComboBox comboBox_3 = new JComboBox(SodTypeDoc);
		sl_panel_1.putConstraint(SpringLayout.NORTH, comboBox_3, 0, SpringLayout.NORTH, textField_19);
		sl_panel_1.putConstraint(SpringLayout.WEST, comboBox_3, -41, SpringLayout.WEST, label_26);
		sl_panel_1.putConstraint(SpringLayout.EAST, comboBox_3, -80, SpringLayout.EAST, panel_1);
		panel_1.add(comboBox_3);
		
		JPanel panel_3 = new JPanel();
		tabbedPane.addTab("Измерения", null, panel_3, null);
		SpringLayout sl_panel_3 = new SpringLayout();
		panel_3.setLayout(sl_panel_3);
		
		JLabel label_60 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u043D\u044B\u0445 \u0438\u0437\u043C\u0435\u0440\u0435\u043D\u0438\u044F\u0445 \u0438 \u0440\u0430\u0441\u0447\u0435\u0442\u0430\u0445");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_60, 10, SpringLayout.NORTH, panel_3);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_60, 10, SpringLayout.WEST, panel_3);
		panel_3.add(label_60);
		
		JLabel label_61 = new JLabel("*1. \u041C\u0435\u0442\u043E\u0434 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432 \u0438 \u0438\u0445 \u0447\u0430\u0441\u0442\u0435\u0439");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_61, 6, SpringLayout.SOUTH, label_60);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_61, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_61);
		
		JLabel label_62 = new JLabel("*\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_62, 6, SpringLayout.SOUTH, label_61);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_62, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_62);
		
		textField_51 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_51, -3, SpringLayout.NORTH, label_62);
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_51, 58, SpringLayout.EAST, label_62);
		panel_3.add(textField_51);
		textField_51.setColumns(10);
		
		JLabel label_63 = new JLabel("\u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_63, 6, SpringLayout.SOUTH, label_62);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_63, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_63);
		
		textField_52 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_52, 6, SpringLayout.SOUTH, label_62);
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_52, 6, SpringLayout.EAST, label_63);
		panel_3.add(textField_52);
		textField_52.setColumns(10);
		
		JLabel label_64 = new JLabel("\u041C\u0435\u0442\u043E\u0434 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442");
		sl_panel_3.putConstraint(SpringLayout.WEST, label_64, 28, SpringLayout.EAST, textField_52);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, label_64, 0, SpringLayout.SOUTH, label_63);
		panel_3.add(label_64);
		
		JComboBox comboBox_7 = new JComboBox(MetodCoord);
		sl_panel_3.putConstraint(SpringLayout.NORTH, comboBox_7, 0, SpringLayout.NORTH, label_63);
		sl_panel_3.putConstraint(SpringLayout.WEST, comboBox_7, 23, SpringLayout.EAST, label_64);
		panel_3.add(comboBox_7);
		
		JLabel label_65 = new JLabel("2. \u0422\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_65, 13, SpringLayout.SOUTH, label_63);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_65, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_65);
		
		JLabel label_66 = new JLabel("*\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_66, 6, SpringLayout.SOUTH, label_65);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_66, 10, SpringLayout.WEST, panel_3);
		panel_3.add(label_66);
		
		textField_53 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_53, 6, SpringLayout.EAST, label_66);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_53, 0, SpringLayout.SOUTH, label_66);
		panel_3.add(textField_53);
		textField_53.setColumns(10);
		
		JLabel label_67 = new JLabel("*\u0424\u043E\u0440\u043C\u0443\u043B\u044B, \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0435 \u0434\u043B\u044F \u0440\u0430\u0441\u0447\u0435\u0442\u0430 \u0441\u0440\u0435\u0434\u043D\u0435\u0439 \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u0438 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446 (Mt).. \u043C");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_67, 6, SpringLayout.SOUTH, label_66);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_67, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_67);
		
		textField_54 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_54, 5, SpringLayout.EAST, label_67);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_54, 0, SpringLayout.SOUTH, label_67);
		panel_3.add(textField_54);
		textField_54.setColumns(10);
		
		JLabel label_68 = new JLabel("3. \u0422\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446 \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_68, 9, SpringLayout.SOUTH, label_67);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_68, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_68);
		
		JLabel label_69 = new JLabel("* \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_69, 6, SpringLayout.SOUTH, label_68);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_69, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_69);
		
		textField_55 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_55, 6, SpringLayout.SOUTH, label_68);
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_55, 0, SpringLayout.WEST, textField_53);
		panel_3.add(textField_55);
		textField_55.setColumns(10);
		
		JLabel label_70 = new JLabel("* \u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_70, 10, SpringLayout.SOUTH, label_69);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_70, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_70);
		
		textField_56 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_56, 6, SpringLayout.SOUTH, label_69);
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_56, 6, SpringLayout.EAST, label_70);
		panel_3.add(textField_56);
		textField_56.setColumns(10);
		
		JLabel label_71 = new JLabel("* \u0424\u043E\u0440\u043C\u0443\u043B\u044B, \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0435 \u0434\u043B\u044F \u0440\u0430\u0441\u0447\u0435\u0442\u0430 \u0441\u0440\u0435\u0434\u043D\u0435\u0439 \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u0438 \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446 (Mt).. \u043C");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_71, 6, SpringLayout.SOUTH, label_70);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_71, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_71);
		
		textField_57 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_57, 6, SpringLayout.EAST, label_71);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_57, 0, SpringLayout.SOUTH, label_71);
		panel_3.add(textField_57);
		textField_57.setColumns(10);
		
		JLabel label_72 = new JLabel("4. \u0422\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_72, 6, SpringLayout.SOUTH, label_71);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_72, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_72);
		
		JLabel label_73 = new JLabel("* \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_73, 6, SpringLayout.SOUTH, label_72);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_73, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_73);
		
		textField_58 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_58, 0, SpringLayout.WEST, textField_53);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_58, 0, SpringLayout.SOUTH, label_73);
		panel_3.add(textField_58);
		textField_58.setColumns(10);
		
		JLabel label_74 = new JLabel("* \u041F\u043B\u043E\u0449\u0430\u0434\u044C (\u0420), \u043C2");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_74, 0, SpringLayout.NORTH, label_73);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_74, 6, SpringLayout.EAST, textField_58);
		panel_3.add(label_74);
		
		textField_59 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_59, 0, SpringLayout.WEST, textField_51);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_59, 0, SpringLayout.SOUTH, label_73);
		panel_3.add(textField_59);
		textField_59.setColumns(10);
		
		JLabel label_75 = new JLabel("* \u0424\u043E\u0440\u043C\u0443\u043B\u044B, \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0435 \u0434\u043B\u044F \u0440\u0430\u0441\u0447\u0435\u0442\u0430 \u043F\u0440\u0435\u0434\u0435\u043B\u044C\u043D\u043E \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 (\u0414\u0435\u043B\u044C\u0442\u0430\u0420), \u043C2");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_75, 6, SpringLayout.SOUTH, label_73);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_75, 10, SpringLayout.WEST, panel_3);
		panel_3.add(label_75);
		
		textField_60 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_60, 0, SpringLayout.SOUTH, label_75);
		sl_panel_3.putConstraint(SpringLayout.EAST, textField_60, 0, SpringLayout.EAST, comboBox_7);
		panel_3.add(textField_60);
		textField_60.setColumns(10);
		
		JLabel label_76 = new JLabel("5. \u0422\u043E\u0447\u043D\u043E\u0441\u0442\u044C \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u0438 \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_76, 16, SpringLayout.SOUTH, label_75);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_76, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_76);
		
		JLabel label_77 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_77, 6, SpringLayout.SOUTH, label_76);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_77, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_77);
		
		textField_61 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_61, 6, SpringLayout.SOUTH, label_76);
		sl_panel_3.putConstraint(SpringLayout.EAST, textField_61, 0, SpringLayout.EAST, label_68);
		panel_3.add(textField_61);
		textField_61.setColumns(10);
		
		JLabel label_78 = new JLabel("! \u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_78, 13, SpringLayout.SOUTH, label_77);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_78, 0, SpringLayout.WEST, label_60);
		panel_3.add(label_78);
		
		textField_62 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_62, 0, SpringLayout.WEST, textField_56);
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_62, 0, SpringLayout.SOUTH, label_78);
		panel_3.add(textField_62);
		textField_62.setColumns(10);
		
		JLabel label_79 = new JLabel("! \u041F\u043B\u043E\u0449\u0430\u0434\u044C (\u0420), \u043C2");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_79, 6, SpringLayout.SOUTH, textField_61);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_79, 59, SpringLayout.EAST, textField_62);
		panel_3.add(label_79);
		
		textField_63 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.NORTH, textField_63, 0, SpringLayout.NORTH, textField_62);
		sl_panel_3.putConstraint(SpringLayout.WEST, textField_63, 21, SpringLayout.EAST, label_79);
		panel_3.add(textField_63);
		textField_63.setColumns(10);
		
		JLabel label_80 = new JLabel("! \u0424\u043E\u0440\u043C\u0443\u043B\u044B, \u043F\u0440\u0438\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u0435 \u0434\u043B\u044F \u0440\u0430\u0441\u0447\u0435\u0442\u0430 \u043F\u0440\u0435\u0434\u0435\u043B\u044C\u043D\u043E \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0439 \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u043B\u043E\u0449");
		sl_panel_3.putConstraint(SpringLayout.NORTH, label_80, 16, SpringLayout.SOUTH, label_78);
		sl_panel_3.putConstraint(SpringLayout.WEST, label_80, 10, SpringLayout.WEST, panel_3);
		panel_3.add(label_80);
		
		textField_64 = new JTextField();
		sl_panel_3.putConstraint(SpringLayout.SOUTH, textField_64, 0, SpringLayout.SOUTH, label_80);
		sl_panel_3.putConstraint(SpringLayout.EAST, textField_64, 0, SpringLayout.EAST, textField_51);
		panel_3.add(textField_64);
		textField_64.setColumns(10);
		
		JPanel panel_4 = new JPanel();
		tabbedPane.addTab("Образуемые", null, panel_4, null);
		SpringLayout sl_panel_4 = new SpringLayout();
		panel_4.setLayout(sl_panel_4);
		
		JLabel label_81 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_81, 10, SpringLayout.NORTH, panel_4);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_81, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_81);
		
		textField_65 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_65, 22, SpringLayout.EAST, label_81);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_65, 0, SpringLayout.SOUTH, label_81);
		panel_4.add(textField_65);
		textField_65.setColumns(10);
		
		JLabel label_82 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_82, 6, SpringLayout.SOUTH, label_81);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_82, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_82);
		
		textField_66 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_66, 15, SpringLayout.EAST, label_82);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_66, 0, SpringLayout.SOUTH, label_82);
		panel_4.add(textField_66);
		textField_66.setColumns(10);
		
		JLabel label_83 = new JLabel("\u0423\u0447\u0430\u0441\u0442\u043E\u043A");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_83, 6, SpringLayout.SOUTH, textField_65);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_83, 0, SpringLayout.EAST, textField_65);
		panel_4.add(label_83);
		
		textField_67 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_67, 6, SpringLayout.EAST, label_83);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_67, 0, SpringLayout.SOUTH, label_82);
		panel_4.add(textField_67);
		textField_67.setColumns(10);
		
		JLabel label_84 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_84, 0, SpringLayout.NORTH, label_82);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_84, 6, SpringLayout.EAST, textField_67);
		panel_4.add(label_84);
		
		textField_68 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_68, -3, SpringLayout.NORTH, label_82);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_68, 13, SpringLayout.EAST, label_84);
		panel_4.add(textField_68);
		textField_68.setColumns(10);
		
		JLabel lblX = new JLabel("! X, \u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lblX, 9, SpringLayout.SOUTH, label_82);
		sl_panel_4.putConstraint(SpringLayout.WEST, lblX, 0, SpringLayout.WEST, label_81);
		panel_4.add(lblX);
		
		textField_69 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_69, 6, SpringLayout.SOUTH, label_82);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_69, 6, SpringLayout.EAST, lblX);
		panel_4.add(textField_69);
		textField_69.setColumns(10);
		
		JLabel lblNewLabel_6 = new JLabel("! Y, \u043C");
		sl_panel_4.putConstraint(SpringLayout.WEST, lblNewLabel_6, 6, SpringLayout.EAST, textField_69);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, lblNewLabel_6, 0, SpringLayout.SOUTH, lblX);
		panel_4.add(lblNewLabel_6);
		
		textField_70 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_70, 6, SpringLayout.SOUTH, label_82);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_70, 6, SpringLayout.EAST, lblNewLabel_6);
		panel_4.add(textField_70);
		textField_70.setColumns(10);
		
		JLabel label_85 = new JLabel("! \u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_85, 6, SpringLayout.EAST, textField_70);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_85, 0, SpringLayout.SOUTH, lblX);
		panel_4.add(label_85);
		
		textField_71 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_71, 6, SpringLayout.SOUTH, label_84);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_71, 6, SpringLayout.EAST, label_85);
		panel_4.add(textField_71);
		textField_71.setColumns(10);
		
		JLabel label_86 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_86, 0, SpringLayout.NORTH, lblX);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_86, 6, SpringLayout.EAST, textField_71);
		panel_4.add(label_86);
		
		textField_72 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_72, 6, SpringLayout.SOUTH, textField_68);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_72, 6, SpringLayout.EAST, label_86);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_72, 809, SpringLayout.WEST, panel_4);
		panel_4.add(textField_72);
		textField_72.setColumns(10);
		
		JLabel label_87 = new JLabel("2. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0433\u0440\u0430\u043D\u0438\u0446 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_87, 13, SpringLayout.SOUTH, textField_69);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_87, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_87);
		
		textField_73 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_73, 6, SpringLayout.EAST, label_87);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_73, 0, SpringLayout.SOUTH, label_87);
		panel_4.add(textField_73);
		textField_73.setColumns(10);
		
		JLabel label_88 = new JLabel("! \u041E\u0442\u0442\u043E\u0447\u043A\u0438 (\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446)");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_88, 12, SpringLayout.SOUTH, label_87);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_88, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_88);
		
		textField_74 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_74, 6, SpringLayout.EAST, label_88);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_74, 0, SpringLayout.SOUTH, label_88);
		panel_4.add(textField_74);
		textField_74.setColumns(10);
		
		JLabel label_89 = new JLabel("\u0414\u043E \u0442\u043E\u0447\u043A\u0438 (\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_89, 0, SpringLayout.WEST, label_83);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_89, 0, SpringLayout.SOUTH, label_88);
		panel_4.add(label_89);
		
		textField_75 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_75, 0, SpringLayout.NORTH, textField_74);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_75, 11, SpringLayout.EAST, label_89);
		panel_4.add(textField_75);
		textField_75.setColumns(10);
		
		JLabel lbls = new JLabel("\u0413\u043E\u0440\u0438\u0437\u043E\u043D\u0442\u0430\u043B\u044C\u043D\u043E\u0435 \u043F\u0440\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 (S), \u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lbls, 0, SpringLayout.NORTH, label_88);
		sl_panel_4.putConstraint(SpringLayout.WEST, lbls, 6, SpringLayout.EAST, textField_75);
		panel_4.add(lbls);
		
		textField_76 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_76, 0, SpringLayout.NORTH, textField_74);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_76, 6, SpringLayout.EAST, lbls);
		panel_4.add(textField_76);
		textField_76.setColumns(10);
		
		JLabel label_90 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_90, 9, SpringLayout.SOUTH, label_88);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_90, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_90);
		
		textField_77 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_77, 0, SpringLayout.SOUTH, label_90);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_77, 0, SpringLayout.EAST, textField_66);
		panel_4.add(textField_77);
		textField_77.setColumns(10);
		
		JLabel label_91 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0441\u043C\u0435\u0436\u043D\u044B\u0445 \u0417\u0423");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_91, 6, SpringLayout.SOUTH, textField_74);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_91, 6, SpringLayout.EAST, textField_77);
		panel_4.add(label_91);
		
		textField_78 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_78, -3, SpringLayout.NORTH, label_90);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_78, 19, SpringLayout.EAST, label_91);
		panel_4.add(textField_78);
		textField_78.setColumns(10);
		
		JLabel label_92 = new JLabel("3. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432 \u043F\u0443\u0442\u0435\u043C \u043F\u0435\u0440\u0435\u0440\u0430\u0441\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_92, 6, SpringLayout.SOUTH, label_90);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_92, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_92);
		
		JLabel label_93 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 (\u0443\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0433\u043E \u043A\u0432\u0430\u0440\u0442\u0430\u043B\u0430)");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_93, 13, SpringLayout.SOUTH, label_92);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_93, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_93);
		
		textField_79 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_79, -3, SpringLayout.NORTH, label_93);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_79, 6, SpringLayout.EAST, label_93);
		panel_4.add(textField_79);
		textField_79.setColumns(10);
		
		JLabel label_94 = new JLabel("! \u041F\u043B\u043E\u0449\u0430\u0434\u044C \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u0438\u044F (\u0420), \u043C2");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_94, 0, SpringLayout.NORTH, label_93);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_94, 6, SpringLayout.EAST, textField_79);
		panel_4.add(label_94);
		
		textField_80 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_80, 0, SpringLayout.WEST, textField_76);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_80, -6, SpringLayout.NORTH, label_94);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_80, -169, SpringLayout.EAST, panel_4);
		panel_4.add(textField_80);
		textField_80.setColumns(10);
		
		JLabel label_95 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432 (\u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0439)., \u0432\u043A\u043B\u044E\u0447\u0430\u0435\u043C\u044B\u0445 \u0432 \u0441\u043E\u0441\u0442\u0430\u0432 \u043E\u0431\u0440\u0430\u0437");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_95, 6, SpringLayout.SOUTH, label_93);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_95, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_95);
		
		textField_81 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_81, 6, SpringLayout.SOUTH, textField_79);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_81, 0, SpringLayout.WEST, label_84);
		panel_4.add(textField_81);
		textField_81.setColumns(10);
		
		JLabel label_96 = new JLabel("\u041F\u043B\u043E\u0449\u0430\u0434\u044C \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432 (\u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0439), \u0432\u043A\u043B\u044E\u0447\u0430\u0435\u043C\u044B\u0445 \u0432 \u0441");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_96, 12, SpringLayout.SOUTH, label_95);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_96, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_96);
		
		textField_82 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_82, 7, SpringLayout.SOUTH, textField_81);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_82, 0, SpringLayout.EAST, label_91);
		panel_4.add(textField_82);
		textField_82.setColumns(10);
		
		JLabel label_97 = new JLabel("4. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_97, 6, SpringLayout.SOUTH, label_96);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_97, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_97);
		
		JLabel label_98 = new JLabel("! \u0410\u0434\u0440\u0435\u0441 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 \u0438\u043B\u0438 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0435\u0433\u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_98, 6, SpringLayout.SOUTH, label_97);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_98, 0, SpringLayout.EAST, label_87);
		panel_4.add(label_98);
		
		textField_83 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_83, 0, SpringLayout.SOUTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_83, 0, SpringLayout.EAST, textField_73);
		panel_4.add(textField_83);
		textField_83.setColumns(10);
		
		JLabel label_99 = new JLabel("! \u0422\u0438\u043F \u0430\u0434\u0440\u0435\u0441\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_99, 0, SpringLayout.NORTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_99, 6, SpringLayout.EAST, textField_83);
		panel_4.add(label_99);
		
		JLabel label_101 = new JLabel("! \u041A\u0430\u0442\u0435\u0433\u043E\u0440\u0438\u044F \u0437\u0435\u043C\u0435\u043B\u044C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_101, 0, SpringLayout.NORTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_101, 0, SpringLayout.WEST, label_86);
		panel_4.add(label_101);
		
		JLabel label_100 = new JLabel("* \u0420\u0435\u043A\u0432\u0438\u0437\u0438\u0442\u044B \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430, \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u044E\u0449\u0435\u0433\u043E \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0438\u0438 \u0437\u0435\u043C\u0435\u043B\u044C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_100, 6, SpringLayout.SOUTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_100, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_100);
		
		textField_86 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_86, 6, SpringLayout.SOUTH, textField_83);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_86, 6, SpringLayout.EAST, label_100);
		panel_4.add(textField_86);
		textField_86.setColumns(10);
		
		JLabel label_102 = new JLabel("! \u0423\u043A\u0430\u0437\u0430\u0442\u044C \u0432\u0438\u0434 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_102, 0, SpringLayout.WEST, textField_78);
		panel_4.add(label_102);
		
		JComboBox comboBox_8 = new JComboBox(TypeAdr);
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_102, 6, SpringLayout.SOUTH, comboBox_8);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_8, -3, SpringLayout.NORTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_8, 0, SpringLayout.WEST, textField_71);
		sl_panel_4.putConstraint(SpringLayout.EAST, comboBox_8, 9, SpringLayout.EAST, textField_75);
		panel_4.add(comboBox_8);
		
		JComboBox comboBox_10 = new JComboBox(VidRazIs);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_10, 0, SpringLayout.NORTH, label_100);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_10, 6, SpringLayout.EAST, label_102);
		sl_panel_4.putConstraint(SpringLayout.EAST, comboBox_10, -34, SpringLayout.EAST, panel_4);
		panel_4.add(comboBox_10);
		
		JComboBox comboBox_9 = new JComboBox(CatZeml);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_9, -3, SpringLayout.NORTH, label_98);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_9, 7, SpringLayout.EAST, label_101);
		sl_panel_4.putConstraint(SpringLayout.EAST, comboBox_9, 293, SpringLayout.EAST, label_101);
		panel_4.add(comboBox_9);
		
		JLabel label_103 = new JLabel("\u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u043E\u043C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0438");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_103, 6, SpringLayout.SOUTH, label_100);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_103, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_103);
		
		JComboBox comboBox_11 = new JComboBox(DopSvedRaz);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_11, 6, SpringLayout.SOUTH, label_100);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_11, 0, SpringLayout.WEST, label_83);
		sl_panel_4.putConstraint(SpringLayout.EAST, comboBox_11, 225, SpringLayout.WEST, label_83);
		panel_4.add(comboBox_11);
		
		JLabel label_104 = new JLabel("* \u0420\u0435\u043A\u0432\u0438\u0437\u0438\u0442\u044B \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430, \u0443\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u044E\u0449\u0435\u0433\u043E \u0432\u0438\u0434 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_104, 6, SpringLayout.SOUTH, comboBox_10);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_104, 8, SpringLayout.EAST, comboBox_11);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_104, 328, SpringLayout.EAST, comboBox_11);
		panel_4.add(label_104);
		
		textField_84 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_84, 6, SpringLayout.SOUTH, comboBox_10);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_84, 12, SpringLayout.EAST, label_104);
		panel_4.add(textField_84);
		textField_84.setColumns(10);
		
		JLabel label_105 = new JLabel("! \u041F\u043B\u043E\u0449\u0430\u0434\u044C \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 +- \u0432\u0435\u043B\u0438\u0447\u0438\u043D\u0430 \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u043B\u043E\u0449\u0430\u0434\u0438 (\u0420 +- \u0414\u0435\u043B\u044C\u0442\u0430\u0420), \u043C2");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_105, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_105);
		
		textField_85 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_105, 3, SpringLayout.NORTH, textField_85);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_105, -50, SpringLayout.WEST, textField_85);
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_85, 12, SpringLayout.SOUTH, comboBox_11);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_85, 0, SpringLayout.EAST, textField_78);
		panel_4.add(textField_85);
		textField_85.setColumns(10);
		
		JLabel label_106 = new JLabel("\u041F\u0440\u0435\u0434\u0435\u043B\u044C\u043D\u044B\u0439 \u043C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439 \u0440\u0430\u0437\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 (\u0420\u043C\u0438\u043D), \u043C2");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_106, 9, SpringLayout.SOUTH, textField_84);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_106, 0, SpringLayout.WEST, label_86);
		panel_4.add(label_106);
		
		textField_87 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_87, 6, SpringLayout.SOUTH, textField_84);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_87, -59, SpringLayout.EAST, panel_4);
		panel_4.add(textField_87);
		textField_87.setColumns(10);
		
		JLabel label_107 = new JLabel("\u041F\u0440\u0435\u0434\u0435\u043B\u044C\u043D\u044B\u0439 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439 \u0440\u0430\u0437\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 (\u0420\u043C\u0430\u043A\u0441),\u043C2");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_107, 6, SpringLayout.SOUTH, label_105);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_107, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_107);
		
		textField_88 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_88, 0, SpringLayout.SOUTH, label_107);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_88, 0, SpringLayout.EAST, textField_67);
		panel_4.add(textField_88);
		textField_88.setColumns(10);
		
		JLabel label_108 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u0438\u043B\u0438 \u0438\u043D\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u043D\u0435\u0434\u0432\u0438\u0436\u0438\u043C\u043E\u0441\u0442\u0438, \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0445 \u043D\u0430 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u043C \u0443\u0447\u0430\u0441\u0442\u043A\u0435");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_108, 6, SpringLayout.SOUTH, label_106);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_108, 0, SpringLayout.WEST, label_84);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_108, 792, SpringLayout.WEST, panel_4);
		panel_4.add(label_108);
		
		textField_89 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_89, -3, SpringLayout.NORTH, label_107);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_89, 19, SpringLayout.EAST, label_108);
		panel_4.add(textField_89);
		textField_89.setColumns(10);
		
		JLabel label_109 = new JLabel("\u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u043B\u0435\u0441\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_109, 6, SpringLayout.SOUTH, label_107);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_109, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_109);
		
		JLabel lblNewLabel_7 = new JLabel("! \u0412\u0438\u0434 \u043E\u0431\u044A\u0435\u043A\u0442\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lblNewLabel_7, 6, SpringLayout.SOUTH, label_107);
		sl_panel_4.putConstraint(SpringLayout.EAST, lblNewLabel_7, 0, SpringLayout.EAST, textField_70);
		panel_4.add(lblNewLabel_7);
		
		textField_90 = new JTextField("Лес");
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_90, 6, SpringLayout.SOUTH, label_107);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_90, 0, SpringLayout.WEST, label_85);
		panel_4.add(textField_90);
		textField_90.setColumns(10);
		
		JLabel label_110 = new JLabel("\u0426\u0435\u043B\u0435\u0432\u043E\u0435 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 (\u043A\u0430\u0442\u0435\u0433\u043E\u0440\u0438\u044F) \u043B\u0435\u0441\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_110, 0, SpringLayout.WEST, textField_67);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_110, 0, SpringLayout.SOUTH, label_109);
		panel_4.add(label_110);
		
		JComboBox comboBox_12 = new JComboBox(CelNazForest);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_12, 6, SpringLayout.SOUTH, label_108);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_12, 0, SpringLayout.WEST, label_86);
		panel_4.add(comboBox_12);
		
		JLabel label_111 = new JLabel("* \u041D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u043B\u0435\u0441\u043D\u0438\u0447\u0435\u0441\u0442\u0432\u0430 (\u043B\u0435\u0441\u043E\u043F\u0430\u0440\u043A\u0430), \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432\u043E\u0433\u043E \u043B\u0435\u0441\u043D\u0438\u0447\u0435\u0441\u0442\u0432\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_111, 9, SpringLayout.SOUTH, textField_89);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_111, 7, SpringLayout.EAST, comboBox_12);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_111, 0, SpringLayout.EAST, textField_84);
		panel_4.add(label_111);
		
		textField_91 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_91, 0, SpringLayout.NORTH, label_109);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_91, -10, SpringLayout.EAST, panel_4);
		panel_4.add(textField_91);
		textField_91.setColumns(10);
		
		JLabel label_112 = new JLabel("* \u041D\u043E\u043C\u0435\u0440\u0430 \u043B\u0435\u0441\u043D\u044B\u0445 \u043A\u0432\u0430\u0440\u0442\u0430\u043B\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_112, 6, SpringLayout.SOUTH, label_109);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_112, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_112);
		
		textField_92 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_92, 6, SpringLayout.SOUTH, label_109);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_92, 6, SpringLayout.EAST, label_112);
		panel_4.add(textField_92);
		textField_92.setColumns(10);
		
		JLabel label_113 = new JLabel("* \u041D\u043E\u043C\u0435\u0440\u0430 \u043B\u0435\u0441\u043E\u0442\u0430\u043A\u0441\u0430\u0446\u0438\u043E\u043D\u043D\u044B\u0445 \u0432\u044B\u0434\u0435\u043B\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_113, 0, SpringLayout.WEST, label_85);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_113, 0, SpringLayout.SOUTH, textField_92);
		panel_4.add(label_113);
		
		textField_93 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_93, 0, SpringLayout.SOUTH, textField_92);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_93, 0, SpringLayout.EAST, textField_75);
		panel_4.add(textField_93);
		textField_93.setColumns(10);
		
		JLabel label_114 = new JLabel("* \u0412\u0438\u0434\u044B \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u043B\u0435\u0441\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_114, 0, SpringLayout.WEST, lbls);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_114, 0, SpringLayout.SOUTH, textField_92);
		panel_4.add(label_114);
		
		JComboBox comboBox_13 = new JComboBox(VidRazIsp);
		sl_panel_4.putConstraint(SpringLayout.NORTH, comboBox_13, 6, SpringLayout.SOUTH, label_111);
		sl_panel_4.putConstraint(SpringLayout.WEST, comboBox_13, 0, SpringLayout.WEST, textField_89);
		sl_panel_4.putConstraint(SpringLayout.EAST, comboBox_13, -37, SpringLayout.EAST, panel_4);
		panel_4.add(comboBox_13);
		
		JLabel label_115 = new JLabel("\u0423\u0441\u043B\u043E\u0432\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_115, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_115);
		
		textField_94 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_115, 3, SpringLayout.NORTH, textField_94);
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_94, 5, SpringLayout.SOUTH, textField_92);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_94, 0, SpringLayout.WEST, textField_66);
		panel_4.add(textField_94);
		textField_94.setColumns(10);
		
		JLabel label_116 = new JLabel("\u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u043C\u0435\u0436\u0435\u0432\u0430\u043D\u0438\u044F \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0438");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_116, 0, SpringLayout.WEST, label_91);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_116, 0, SpringLayout.SOUTH, label_115);
		panel_4.add(label_116);
		
		textField_95 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_95, 10, SpringLayout.EAST, label_116);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_95, 0, SpringLayout.SOUTH, textField_94);
		panel_4.add(textField_95);
		textField_95.setColumns(10);
		
		JLabel label_117 = new JLabel("\u0418\u043D\u044B\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_117, 6, SpringLayout.EAST, textField_95);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_117, 0, SpringLayout.SOUTH, textField_94);
		panel_4.add(label_117);
		
		textField_96 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_96, 6, SpringLayout.SOUTH, label_114);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_96, 0, SpringLayout.EAST, textField_76);
		panel_4.add(textField_96);
		textField_96.setColumns(10);
		
		JLabel lblNewLabel_8 = new JLabel("5. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445, \u0441\u043C\u0435\u0436\u043D\u044B\u0445 \u0441 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u043C \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u043C \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lblNewLabel_8, 6, SpringLayout.SOUTH, label_115);
		sl_panel_4.putConstraint(SpringLayout.WEST, lblNewLabel_8, 0, SpringLayout.WEST, label_81);
		panel_4.add(lblNewLabel_8);
		
		JLabel label_118 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 \u0438\u043B\u0438 \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_118, 6, SpringLayout.SOUTH, label_116);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_118, 0, SpringLayout.WEST, textField_79);
		panel_4.add(label_118);
		
		textField_97 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_97, 6, SpringLayout.SOUTH, textField_96);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_97, 0, SpringLayout.EAST, textField_72);
		panel_4.add(textField_97);
		textField_97.setColumns(10);
		
		JLabel label_119 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432., \u0441\u043C\u0435\u0436\u043D\u044B\u0445 \u0441 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u043C \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u043C \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_119, 6, SpringLayout.SOUTH, lblNewLabel_8);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_119, 10, SpringLayout.WEST, panel_4);
		sl_panel_4.putConstraint(SpringLayout.EAST, label_119, -14, SpringLayout.EAST, label_85);
		panel_4.add(label_119);
		
		textField_98 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_98, 6, SpringLayout.SOUTH, label_118);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_98, 0, SpringLayout.EAST, textField_78);
		panel_4.add(textField_98);
		textField_98.setColumns(10);
		
		JLabel label_120 = new JLabel("! \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043F\u0440\u0430\u0432\u043E\u043E\u0431\u043B\u0430\u0434\u0430\u0442\u0435\u043B\u044F\u0445 \u0441\u043C\u0435\u0436\u043D\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_120, 0, SpringLayout.WEST, label_86);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_120, 0, SpringLayout.SOUTH, label_119);
		panel_4.add(label_120);
		
		textField_99 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_99, 0, SpringLayout.SOUTH, label_119);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_99, 0, SpringLayout.EAST, textField_87);
		panel_4.add(textField_99);
		textField_99.setColumns(10);
		
		JLabel label_121 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430 1. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0433\u0440\u0430\u043D\u0438\u0446 \u0447\u0430\u0441\u0442\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_121, 6, SpringLayout.SOUTH, label_119);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_121, 10, SpringLayout.WEST, panel_4);
		panel_4.add(label_121);
		
		textField_100 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_100, 6, SpringLayout.SOUTH, label_120);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_100, 13, SpringLayout.EAST, label_121);
		panel_4.add(textField_100);
		textField_100.setColumns(10);
		
		JLabel label_122 = new JLabel("! \u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_122, 6, SpringLayout.EAST, textField_100);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_122, 0, SpringLayout.SOUTH, label_121);
		panel_4.add(label_122);
		
		textField_101 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_101, 6, SpringLayout.SOUTH, label_120);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_101, 0, SpringLayout.EAST, textField_84);
		panel_4.add(textField_101);
		textField_101.setColumns(10);
		
		JLabel lblX_1 = new JLabel("! X, \u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lblX_1, 6, SpringLayout.SOUTH, label_121);
		sl_panel_4.putConstraint(SpringLayout.WEST, lblX_1, 0, SpringLayout.WEST, label_81);
		panel_4.add(lblX_1);
		
		textField_102 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_102, 0, SpringLayout.SOUTH, lblX_1);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_102, 0, SpringLayout.EAST, textField_69);
		panel_4.add(textField_102);
		textField_102.setColumns(10);
		
		JLabel lblY = new JLabel("! Y, \u043C");
		sl_panel_4.putConstraint(SpringLayout.NORTH, lblY, 6, SpringLayout.SOUTH, label_121);
		sl_panel_4.putConstraint(SpringLayout.WEST, lblY, 0, SpringLayout.WEST, lblNewLabel_6);
		panel_4.add(lblY);
		
		textField_103 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_103, 0, SpringLayout.SOUTH, lblX_1);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_103, 0, SpringLayout.EAST, textField_70);
		panel_4.add(textField_103);
		textField_103.setColumns(10);
		
		JLabel label_123 = new JLabel("! \u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_123, 6, SpringLayout.SOUTH, label_121);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_123, 0, SpringLayout.WEST, label_85);
		panel_4.add(label_123);
		
		textField_104 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_104, 6, SpringLayout.SOUTH, label_121);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_104, 0, SpringLayout.EAST, textField_71);
		panel_4.add(textField_104);
		textField_104.setColumns(10);
		
		JLabel label_124 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_124, 6, SpringLayout.SOUTH, textField_100);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_124, 23, SpringLayout.EAST, textField_104);
		panel_4.add(label_124);
		
		textField_105 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_105, 6, SpringLayout.EAST, label_124);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_105, 0, SpringLayout.SOUTH, textField_104);
		panel_4.add(textField_105);
		textField_105.setColumns(10);
		
		JLabel label_125 = new JLabel("3. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_125, 6, SpringLayout.SOUTH, lblX_1);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_125, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_125);
		
		JLabel label_126 = new JLabel("! \u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_126, 6, SpringLayout.SOUTH, label_123);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_126, 0, SpringLayout.WEST, textField_73);
		panel_4.add(label_126);
		
		textField_106 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_106, 6, SpringLayout.SOUTH, textField_104);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_106, 0, SpringLayout.WEST, lbls);
		panel_4.add(textField_106);
		textField_106.setColumns(10);
		
		JLabel label_127 = new JLabel("! \u041F\u043B\u043E\u0449\u0430\u0434\u044C (\u0420), \u043C2");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_127, 15, SpringLayout.EAST, textField_106);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_127, 0, SpringLayout.SOUTH, textField_106);
		panel_4.add(label_127);
		
		textField_107 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_107, 0, SpringLayout.SOUTH, textField_106);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_107, 0, SpringLayout.EAST, textField_105);
		panel_4.add(textField_107);
		textField_107.setColumns(10);
		
		JLabel label_128 = new JLabel("+-\u0414\u0435\u043B\u044C\u0442\u0430\u0420, \u043C2");
		sl_panel_4.putConstraint(SpringLayout.WEST, label_128, 6, SpringLayout.EAST, textField_107);
		sl_panel_4.putConstraint(SpringLayout.SOUTH, label_128, 0, SpringLayout.SOUTH, textField_106);
		panel_4.add(label_128);
		
		textField_108 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.SOUTH, textField_108, 0, SpringLayout.SOUTH, textField_106);
		sl_panel_4.putConstraint(SpringLayout.EAST, textField_108, 0, SpringLayout.EAST, comboBox_10);
		panel_4.add(textField_108);
		textField_108.setColumns(10);
		
		JLabel label_129 = new JLabel("! \u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u0447\u0430\u0441\u0442\u0438\t");
		sl_panel_4.putConstraint(SpringLayout.NORTH, label_129, 6, SpringLayout.SOUTH, label_125);
		sl_panel_4.putConstraint(SpringLayout.WEST, label_129, 0, SpringLayout.WEST, label_81);
		panel_4.add(label_129);
		
		textField_109 = new JTextField();
		sl_panel_4.putConstraint(SpringLayout.NORTH, textField_109, 6, SpringLayout.SOUTH, label_125);
		sl_panel_4.putConstraint(SpringLayout.WEST, textField_109, 14, SpringLayout.EAST, label_129);
		panel_4.add(textField_109);
		textField_109.setColumns(10);
		
		JPanel panel_6 = new JPanel();
		tabbedPane.addTab("Доступ", null, panel_6, null);
		SpringLayout sl_panel_6 = new SpringLayout();
		panel_6.setLayout(sl_panel_6);
		
		JLabel label_156 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0435\u043D\u0438\u0438 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 (\u043F\u0440\u043E\u0445\u043E\u0434\u0430 \u0438\u043B\u0438 \u043F\u0440\u043E\u0435\u0437\u0434\u0430 \u043E\u0442 \u0437\u0435\u043C\u0435\u043B\u044C \u043E\u0431\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F, \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432 \u043E\u0431\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F, \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0438 \u043E\u0431\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F) \u043A \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u043C \u0438\u043B\u0438 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u043D\u044B\u043C \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u043C \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_6.putConstraint(SpringLayout.NORTH, label_156, 20, SpringLayout.NORTH, panel_6);
		sl_panel_6.putConstraint(SpringLayout.WEST, label_156, 10, SpringLayout.WEST, panel_6);
		sl_panel_6.putConstraint(SpringLayout.EAST, label_156, 1023, SpringLayout.WEST, panel_6);
		panel_6.add(label_156);
		
		JLabel label_157 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u043E\u0441\u0442\u0443\u043F");
		sl_panel_6.putConstraint(SpringLayout.NORTH, label_157, 16, SpringLayout.SOUTH, label_156);
		sl_panel_6.putConstraint(SpringLayout.WEST, label_157, 10, SpringLayout.WEST, panel_6);
		panel_6.add(label_157);
		
		textField_136 = new JTextField();
		sl_panel_6.putConstraint(SpringLayout.NORTH, textField_136, 10, SpringLayout.SOUTH, label_156);
		sl_panel_6.putConstraint(SpringLayout.WEST, textField_136, 38, SpringLayout.EAST, label_157);
		sl_panel_6.putConstraint(SpringLayout.EAST, textField_136, 436, SpringLayout.EAST, label_157);
		panel_6.add(textField_136);
		textField_136.setColumns(10);
		
		JLabel label_158 = new JLabel("! \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445 (\u0437\u0435\u043C\u043B\u044F\u0445 \u043E\u0431\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F, \u0442\u0435\u0440\u0440\u0438\u0442\u043E\u0440\u0438\u0438 \u043E\u0431\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F), \u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E\u043C \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442:");
		sl_panel_6.putConstraint(SpringLayout.NORTH, label_158, 23, SpringLayout.SOUTH, label_157);
		sl_panel_6.putConstraint(SpringLayout.WEST, label_158, 10, SpringLayout.WEST, panel_6);
		panel_6.add(label_158);
		
		textField_137 = new JTextField();
		sl_panel_6.putConstraint(SpringLayout.NORTH, textField_137, 17, SpringLayout.SOUTH, textField_136);
		sl_panel_6.putConstraint(SpringLayout.WEST, textField_137, 6, SpringLayout.EAST, label_158);
		sl_panel_6.putConstraint(SpringLayout.EAST, textField_137, 332, SpringLayout.EAST, label_158);
		panel_6.add(textField_137);
		textField_137.setColumns(10);
		
		JLabel label_159 = new JLabel("* \u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u044B - \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043B\u044F \u0432\u043D\u0435\u0441\u0435\u043D\u0438\u044F \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u0439");
		sl_panel_6.putConstraint(SpringLayout.NORTH, label_159, 27, SpringLayout.SOUTH, label_158);
		sl_panel_6.putConstraint(SpringLayout.WEST, label_159, 0, SpringLayout.WEST, label_156);
		panel_6.add(label_159);
		
		textField_138 = new JTextField();
		sl_panel_6.putConstraint(SpringLayout.NORTH, textField_138, 21, SpringLayout.SOUTH, label_158);
		sl_panel_6.putConstraint(SpringLayout.WEST, textField_138, 24, SpringLayout.EAST, label_159);
		sl_panel_6.putConstraint(SpringLayout.EAST, textField_138, 468, SpringLayout.EAST, label_159);
		panel_6.add(textField_138);
		textField_138.setColumns(10);
		
		JPanel panel_8 = new JPanel();
		tabbedPane.addTab("Части", null, panel_8, null);
		SpringLayout sl_panel_8 = new SpringLayout();
		panel_8.setLayout(sl_panel_8);
		
		JLabel label_197 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u044B\u0445 \u0447\u0430\u0441\u0442\u044F\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_197, 10, SpringLayout.NORTH, panel_8);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_197, 10, SpringLayout.WEST, panel_8);
		panel_8.add(label_197);
		
		JLabel label_198 = new JLabel("!\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_198, 6, SpringLayout.SOUTH, label_197);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_198, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_198);
		
		textField_168 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_168, 6, SpringLayout.SOUTH, label_197);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_168, 19, SpringLayout.EAST, label_198);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_168, 350, SpringLayout.EAST, label_198);
		panel_8.add(textField_168);
		textField_168.setColumns(10);
		
		JLabel label_199 = new JLabel("1. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0433\u0440\u0430\u043D\u0438\u0446 \u043E\u0431\u0440\u0430\u0437\u0443\u0435\u043C\u043E\u0439 \u0447\u0430\u0441\u0442\u0438 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_199, 19, SpringLayout.SOUTH, label_198);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_199, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_199);
		
		JLabel label_200 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_200, 8, SpringLayout.SOUTH, label_199);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_200, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_200);
		
		textField_169 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_169, 6, SpringLayout.SOUTH, label_199);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_169, 26, SpringLayout.EAST, label_200);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_169, 392, SpringLayout.EAST, label_200);
		panel_8.add(textField_169);
		textField_169.setColumns(10);
		
		JLabel lblNewLabel_10 = new JLabel("<html>!*Площадь части земельного участка +- величина<br>погрешности определения площади (Р+-ДельтаР),м2");
		sl_panel_8.putConstraint(SpringLayout.NORTH, lblNewLabel_10, 6, SpringLayout.SOUTH, label_200);
		sl_panel_8.putConstraint(SpringLayout.WEST, lblNewLabel_10, 10, SpringLayout.WEST, panel_8);
		sl_panel_8.putConstraint(SpringLayout.EAST, lblNewLabel_10, 12, SpringLayout.EAST, label_197);
		panel_8.add(lblNewLabel_10);
		
		textField_170 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_170, 10, SpringLayout.SOUTH, textField_169);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_170, 7, SpringLayout.EAST, lblNewLabel_10);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_170, 413, SpringLayout.EAST, lblNewLabel_10);
		panel_8.add(textField_170);
		textField_170.setColumns(10);
		
		JLabel label_201 = new JLabel("!*\u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_201, 6, SpringLayout.SOUTH, lblNewLabel_10);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_201, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_201);
		
		textField_171 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_171, 6, SpringLayout.SOUTH, lblNewLabel_10);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_171, 26, SpringLayout.EAST, label_201);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_171, 168, SpringLayout.EAST, label_201);
		panel_8.add(textField_171);
		textField_171.setColumns(10);
		
		JLabel label_202 = new JLabel("\u0421\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F (\u043E\u0431\u0440\u0435\u043C\u0435\u043D\u0435\u043D\u0438\u044F) \u043F\u0440\u0430\u0432\u0430");
		sl_panel_8.putConstraint(SpringLayout.WEST, label_202, 17, SpringLayout.EAST, textField_171);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, label_202, 0, SpringLayout.SOUTH, textField_171);
		panel_8.add(label_202);
		
		textField_172 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_172, 6, SpringLayout.EAST, label_202);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, textField_172, 0, SpringLayout.SOUTH, textField_171);
		panel_8.add(textField_172);
		textField_172.setColumns(10);
		
		JLabel label_203 = new JLabel("!\u0412\u0438\u0434 \u043E\u0431\u0440\u0435\u043C\u0435\u043D\u0435\u043D\u0438\u044F");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_203, 0, SpringLayout.NORTH, label_202);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_203, 25, SpringLayout.EAST, textField_172);
		panel_8.add(label_203);
		
		JComboBox comboBox_17 = new JComboBox();
		sl_panel_8.putConstraint(SpringLayout.NORTH, comboBox_17, 0, SpringLayout.NORTH, label_201);
		sl_panel_8.putConstraint(SpringLayout.WEST, comboBox_17, 18, SpringLayout.EAST, label_203);
		panel_8.add(comboBox_17);
		
		JLabel label_204 = new JLabel("\u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 \u043F\u043E\u043B\u044C\u0437\u0443");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_204, 10, SpringLayout.SOUTH, label_201);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_204, 10, SpringLayout.WEST, panel_8);
		panel_8.add(label_204);
		
		textField_173 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_173, 6, SpringLayout.SOUTH, textField_171);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_173, 16, SpringLayout.EAST, label_204);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_173, 147, SpringLayout.EAST, label_204);
		panel_8.add(textField_173);
		textField_173.setColumns(10);
		
		JLabel label_205 = new JLabel("!\u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442 - \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u0434\u043B\u044F \u0432\u043D\u0435\u0441\u0435\u043D\u0438\u044F \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u0439");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_205, 6, SpringLayout.SOUTH, label_202);
		panel_8.add(label_205);
		
		textField_174 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_174, 636, SpringLayout.WEST, panel_8);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_174, -230, SpringLayout.EAST, panel_8);
		sl_panel_8.putConstraint(SpringLayout.EAST, label_205, -28, SpringLayout.WEST, textField_174);
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_174, -3, SpringLayout.NORTH, label_204);
		panel_8.add(textField_174);
		textField_174.setColumns(10);
		
		JLabel label_206 = new JLabel("!*\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_206, 23, SpringLayout.SOUTH, label_204);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_206, 10, SpringLayout.WEST, panel_8);
		panel_8.add(label_206);
		
		JComboBox comboBox_18 = new JComboBox(SysCoord);
		comboBox_18.setEnabled(false);
		sl_panel_8.putConstraint(SpringLayout.NORTH, comboBox_18, 0, SpringLayout.NORTH, label_206);
		sl_panel_8.putConstraint(SpringLayout.WEST, comboBox_18, 15, SpringLayout.EAST, label_206);
		panel_8.add(comboBox_18);
		
		JLabel label_207 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_207, 6, SpringLayout.SOUTH, label_206);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_207, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_207);
		
		textField_175 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_175, 4, SpringLayout.SOUTH, comboBox_18);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_175, 6, SpringLayout.EAST, label_207);
		panel_8.add(textField_175);
		textField_175.setColumns(10);
		
		JLabel lblx = new JLabel("!X, \u043C");
		sl_panel_8.putConstraint(SpringLayout.NORTH, lblx, 7, SpringLayout.SOUTH, comboBox_18);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_175, -6, SpringLayout.WEST, lblx);
		sl_panel_8.putConstraint(SpringLayout.EAST, lblx, 0, SpringLayout.EAST, textField_169);
		panel_8.add(lblx);
		
		textField_176 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_176, 4, SpringLayout.SOUTH, comboBox_18);
		panel_8.add(textField_176);
		textField_176.setColumns(10);
		
		JLabel lbly_1 = new JLabel("!Y, \u043C");
		sl_panel_8.putConstraint(SpringLayout.NORTH, lbly_1, 47, SpringLayout.SOUTH, textField_174);
		sl_panel_8.putConstraint(SpringLayout.EAST, lbly_1, 0, SpringLayout.EAST, textField_172);
		panel_8.add(lbly_1);
		
		textField_177 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_177, 44, SpringLayout.SOUTH, textField_174);
		panel_8.add(textField_177);
		textField_177.setColumns(10);
		
		JLabel label_208 = new JLabel("\u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 (Mt), \u043C");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_208, 22, SpringLayout.SOUTH, label_207);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_208, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_208);
		
		textField_178 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_178, 30, SpringLayout.SOUTH, comboBox_18);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_178, 0, SpringLayout.EAST, textField_169);
		panel_8.add(textField_178);
		textField_178.setColumns(10);
		
		JLabel label_209 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_176, 0, SpringLayout.WEST, label_209);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_209, 11, SpringLayout.EAST, textField_178);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, label_209, 0, SpringLayout.SOUTH, label_208);
		panel_8.add(label_209);
		
		textField_179 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_177, 0, SpringLayout.EAST, textField_179);
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_179, 0, SpringLayout.NORTH, textField_178);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_179, 9, SpringLayout.EAST, label_209);
		panel_8.add(textField_179);
		textField_179.setColumns(10);
		
		JLabel label_210 = new JLabel("2. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_210, 6, SpringLayout.SOUTH, label_208);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_210, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_210);
		
		JLabel label_211 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_8.putConstraint(SpringLayout.NORTH, label_211, 6, SpringLayout.SOUTH, label_210);
		sl_panel_8.putConstraint(SpringLayout.WEST, label_211, 0, SpringLayout.WEST, label_197);
		panel_8.add(label_211);
		
		textField_180 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_180, 6, SpringLayout.SOUTH, label_210);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_180, 6, SpringLayout.EAST, label_211);
		sl_panel_8.putConstraint(SpringLayout.EAST, textField_180, -11, SpringLayout.EAST, label_197);
		panel_8.add(textField_180);
		textField_180.setColumns(10);
		
		JLabel label_212 = new JLabel("\u041F\u043B\u043E\u0449\u0430\u0434\u044C(\u0420), \u043C2");
		sl_panel_8.putConstraint(SpringLayout.WEST, label_212, 0, SpringLayout.WEST, textField_170);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, label_212, 0, SpringLayout.SOUTH, label_211);
		panel_8.add(label_212);
		
		textField_181 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.NORTH, textField_181, 0, SpringLayout.NORTH, label_211);
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_181, 6, SpringLayout.EAST, label_212);
		panel_8.add(textField_181);
		textField_181.setColumns(10);
		
		JLabel lblltkmnfhv = new JLabel("+-\u0414\u0435\u043B\u044C\u0442\u0430\u0420, \u043C2");
		sl_panel_8.putConstraint(SpringLayout.NORTH, lblltkmnfhv, 37, SpringLayout.SOUTH, label_209);
		sl_panel_8.putConstraint(SpringLayout.WEST, lblltkmnfhv, 0, SpringLayout.WEST, textField_176);
		panel_8.add(lblltkmnfhv);
		
		textField_182 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_182, 6, SpringLayout.EAST, lblltkmnfhv);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, textField_182, 0, SpringLayout.SOUTH, textField_180);
		panel_8.add(textField_182);
		textField_182.setColumns(10);
		
		JLabel label_213 = new JLabel("\u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_8.putConstraint(SpringLayout.WEST, label_213, 19, SpringLayout.EAST, textField_182);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, label_213, 0, SpringLayout.SOUTH, textField_180);
		panel_8.add(label_213);
		
		textField_183 = new JTextField();
		sl_panel_8.putConstraint(SpringLayout.WEST, textField_183, 12, SpringLayout.EAST, label_213);
		sl_panel_8.putConstraint(SpringLayout.SOUTH, textField_183, 0, SpringLayout.SOUTH, textField_180);
		panel_8.add(textField_183);
		textField_183.setColumns(10);
		
		JPanel panel_9 = new JPanel();
		tabbedPane.addTab("Заключение", null, panel_9, null);
		SpringLayout sl_panel_9 = new SpringLayout();
		panel_9.setLayout(sl_panel_9);
		
		JLabel label_160 = new JLabel("\u0417\u0430\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0433\u043E \u0438\u043D\u0436\u0435\u043D\u0435\u0440\u0430");
		sl_panel_9.putConstraint(SpringLayout.NORTH, label_160, 30, SpringLayout.NORTH, panel_9);
		sl_panel_9.putConstraint(SpringLayout.WEST, label_160, 24, SpringLayout.WEST, panel_9);
		panel_9.add(label_160);
		
		textField_139 = new JTextField();
		textField_139.setHorizontalAlignment(SwingConstants.LEFT);
		sl_panel_9.putConstraint(SpringLayout.NORTH, textField_139, 30, SpringLayout.NORTH, panel_9);
		sl_panel_9.putConstraint(SpringLayout.WEST, textField_139, 21, SpringLayout.EAST, label_160);
		sl_panel_9.putConstraint(SpringLayout.SOUTH, textField_139, 99, SpringLayout.NORTH, panel_9);
		sl_panel_9.putConstraint(SpringLayout.EAST, textField_139, 839, SpringLayout.EAST, label_160);
		panel_9.add(textField_139);
		textField_139.setColumns(10);
		
		JLabel label_161 = new JLabel("* \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0421\u0420\u041E");
		sl_panel_9.putConstraint(SpringLayout.NORTH, label_161, 88, SpringLayout.SOUTH, label_160);
		sl_panel_9.putConstraint(SpringLayout.WEST, label_161, 0, SpringLayout.WEST, label_160);
		panel_9.add(label_161);
		
		textField_140 = new JTextField();
		sl_panel_9.putConstraint(SpringLayout.NORTH, textField_140, 0, SpringLayout.NORTH, label_161);
		sl_panel_9.putConstraint(SpringLayout.WEST, textField_140, 23, SpringLayout.EAST, label_161);
		sl_panel_9.putConstraint(SpringLayout.SOUTH, textField_140, 62, SpringLayout.NORTH, label_161);
		sl_panel_9.putConstraint(SpringLayout.EAST, textField_140, 0, SpringLayout.EAST, textField_139);
		panel_9.add(textField_140);
		textField_140.setColumns(10);
		
		JPanel panel_7 = new JPanel();
		tabbedPane.addTab("Уточняемые", null, panel_7, null);
		SpringLayout sl_panel_7 = new SpringLayout();
		panel_7.setLayout(sl_panel_7);
		
		JLabel label_162 = new JLabel("\u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E\u0431 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_162, 10, SpringLayout.NORTH, panel_7);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_162, 10, SpringLayout.WEST, panel_7);
		panel_7.add(label_162);
		
		JLabel label_163 = new JLabel("\u0412\u044B\u0433\u0440\u0443\u0436\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0439 \u0440\u0430\u0437\u0434\u0435\u043B \u043A\u0430\u043A:");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_163, 53, SpringLayout.EAST, label_162);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_163, 0, SpringLayout.SOUTH, label_162);
		panel_7.add(label_163);
		
		JComboBox comboBox_15 = new JComboBox(VigDanRaz);
		sl_panel_7.putConstraint(SpringLayout.NORTH, comboBox_15, 0, SpringLayout.NORTH, label_162);
		sl_panel_7.putConstraint(SpringLayout.WEST, comboBox_15, 20, SpringLayout.EAST, label_163);
		panel_7.add(comboBox_15);
		
		JLabel label_164 = new JLabel("* \u0423\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0439 \u0443\u0447\u0430\u0441\u0442\u043E\u043A \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u0435\u0434\u0438\u043D\u043E\u0435 \u0437\u0435\u043C\u043B\u0435\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_164, 6, SpringLayout.SOUTH, label_162);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_164, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_164);
		
		JLabel label_165 = new JLabel("(\u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E (\u0435\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u0432\u044B\u0431\u0440\u0430\u043D\u043E \u0438\u0437 \u0441\u043F\u0438\u0441\u043A\u0430) \u0440\u0430\u0437\u0434\u0435\u043B \u0432\u044B\u0433\u0440\u0443\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u0432\u0435\u0442\u0432\u044C <SpecifyParcel> - \u0443\u0442\u043E\u0447\u043D\u0435\u043D\u0438\u0435 \u0433\u0440\u0430\u043D\u0438\u0446)");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_165, 6, SpringLayout.EAST, label_164);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_165, 0, SpringLayout.SOUTH, label_164);
		panel_7.add(label_165);
		
		JLabel label_166 = new JLabel("*\u0423\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0439 \u0443\u0447\u0430\u0441\u0442\u043E\u043A \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u0442 \u0441\u043E\u0431\u043E\u0439 \u0435\u0434\u0438\u043D\u043E\u0435 \u0437\u0435\u043C\u043B\u0435\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_166, 6, SpringLayout.SOUTH, label_164);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_166, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_166);
		
		JLabel label_167 = new JLabel("(\u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u0432\u044B\u0433\u0440\u0443\u0436\u0430\u044E\u0442\u0441\u044F \u0432 \u0432\u0435\u0442\u0432\u044C \"\u0415\u0434\u0438\u043D\u043E\u0435 \u0437\u0435\u043C\u043B\u0435\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\" (<ExistEZParcels>)");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_167, 0, SpringLayout.WEST, label_165);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_167, 0, SpringLayout.SOUTH, label_166);
		panel_7.add(label_167);
		
		JLabel label_168 = new JLabel("*\t\u0415\u0417\u041F, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u0445\u043E\u0434\u0438\u0442 \u0434\u0430\u043D\u043D\u044B\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0439 \u0443\u0447\u0430\u0441\u0442\u043E\u043A");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_168, 6, SpringLayout.SOUTH, label_166);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_168, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_168);
		
		textField_141 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_141, 6, SpringLayout.SOUTH, label_166);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_141, 6, SpringLayout.EAST, label_168);
		panel_7.add(textField_141);
		textField_141.setColumns(10);
		
		JLabel label_169 = new JLabel("1. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u043A\u0430\u0445 \u0433\u0440\u0430\u043D\u0438\u0446\u044B \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_169, 6, SpringLayout.SOUTH, label_166);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_169, 26, SpringLayout.EAST, textField_141);
		panel_7.add(label_169);
		
		JLabel label_170 = new JLabel("*\t\u041D\u043E\u043C\u0435\u0440 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0433\u043E \u043A\u0432\u0430\u0440\u0442\u0430\u043B\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_170, 6, SpringLayout.SOUTH, label_167);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_170, 17, SpringLayout.EAST, label_169);
		panel_7.add(label_170);
		
		textField_142 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_142, 0, SpringLayout.NORTH, label_168);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_142, 6, SpringLayout.EAST, label_170);
		panel_7.add(textField_142);
		textField_142.setColumns(10);
		
		JLabel label_171 = new JLabel("! \u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_171, 5, SpringLayout.SOUTH, label_168);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_171, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_171);
		
		JLabel label_172 = new JLabel("(\u0432\u0432\u043E\u0434\u0438\u0442\u0441\u044F \u0434\u043B\u044F \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0433\u043E \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0435 00:00:0000000)");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_172, 6, SpringLayout.SOUTH, textField_142);
		sl_panel_7.putConstraint(SpringLayout.EAST, label_172, 0, SpringLayout.EAST, textField_142);
		panel_7.add(label_172);
		
		textField_143 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_143, 6, SpringLayout.SOUTH, textField_141);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_143, 0, SpringLayout.WEST, label_163);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_143, 0, SpringLayout.EAST, label_166);
		panel_7.add(textField_143);
		textField_143.setColumns(10);
		
		JLabel label_173 = new JLabel("(\u0432\u0432\u043E\u0434\u0438\u0442\u0441\u044F \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0435 00:00:0000000:N)");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_173, 6, SpringLayout.SOUTH, label_171);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_173, 10, SpringLayout.WEST, panel_7);
		panel_7.add(label_173);
		
		JLabel label_174 = new JLabel("*\u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u043A\u043E\u043D\u0442\u0443\u0440\u0430 \u043C\u043D\u043E\u0433\u043E\u043A\u043E\u043D\u0442\u0443\u0440\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_174, 6, SpringLayout.SOUTH, label_173);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_174, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_174);
		
		textField_144 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_144, 0, SpringLayout.SOUTH, label_174);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_144, 0, SpringLayout.EAST, textField_141);
		panel_7.add(textField_144);
		textField_144.setColumns(10);
		
		JLabel label_175 = new JLabel("\u0417\u0430\u043F\u043E\u043B\u043D\u044F\u0435\u0442\u0441\u044F \u0435\u0441\u043B\u0438 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u0442\u0441\u044F \u0433\u0440\u0430\u043D\u0438\u0446\u0430 \u043C\u043D\u043E\u0433\u043E\u043A\u043E\u043D\u0442\u0443\u0440\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_175, 2, SpringLayout.SOUTH, label_174);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_175, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_175);
		
		JLabel label_176 = new JLabel("\u0421\u0438\u0441\u0442\u0435\u043C\u0430 \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_176, 3, SpringLayout.NORTH, textField_143);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_176, 19, SpringLayout.EAST, textField_143);
		panel_7.add(label_176);
		
		JLabel label_177 = new JLabel("<html>(значение выбирается из таблицы \"!Системы координат\" раздела \"Исходные\";<br>заполняется только для электронного документа, заполение обязательно)</html>");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_177, 6, SpringLayout.SOUTH, textField_143);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_177, 41, SpringLayout.EAST, textField_144);
		sl_panel_7.putConstraint(SpringLayout.EAST, label_177, -252, SpringLayout.EAST, panel_7);
		panel_7.add(label_177);
		
		JComboBox comboBox_16 = new JComboBox(SysCoord);
		sl_panel_7.putConstraint(SpringLayout.NORTH, comboBox_16, -3, SpringLayout.NORTH, label_172);
		sl_panel_7.putConstraint(SpringLayout.WEST, comboBox_16, 6, SpringLayout.EAST, label_176);
		sl_panel_7.putConstraint(SpringLayout.EAST, comboBox_16, -6, SpringLayout.WEST, label_172);
		panel_7.add(comboBox_16);
		
		JLabel label_178 = new JLabel("!\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_178, 6, SpringLayout.SOUTH, label_175);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_178, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_178);
		
		textField_145 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_145, 6, SpringLayout.SOUTH, label_175);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_145, 6, SpringLayout.EAST, label_178);
		panel_7.add(textField_145);
		textField_145.setColumns(10);
		
		JLabel label_179 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0445 \u0442\u043E\u0447\u0435\u043A (\u043D\u0435 \u0434\u043B\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432)");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_179, 6, SpringLayout.SOUTH, label_175);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_179, 6, SpringLayout.EAST, textField_145);
		panel_7.add(label_179);
		
		textField_146 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_146, 9, SpringLayout.EAST, label_179);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_146, 0, SpringLayout.SOUTH, label_178);
		panel_7.add(textField_146);
		textField_146.setColumns(10);
		
		JLabel lblX_5 = new JLabel("X \u0441\u0443\u0449, \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lblX_5, 6, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.WEST, lblX_5, 0, SpringLayout.WEST, label_162);
		panel_7.add(lblX_5);
		
		textField_147 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_147, 6, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_147, 6, SpringLayout.EAST, lblX_5);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_147, -977, SpringLayout.EAST, panel_7);
		panel_7.add(textField_147);
		textField_147.setColumns(10);
		
		JLabel lblY_4 = new JLabel("Y \u0441\u0443\u0449, \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lblY_4, 6, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.WEST, lblY_4, 6, SpringLayout.EAST, textField_147);
		panel_7.add(lblY_4);
		
		textField_148 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_148, 6, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_148, 6, SpringLayout.EAST, lblY_4);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_148, -881, SpringLayout.EAST, panel_7);
		panel_7.add(textField_148);
		textField_148.setColumns(10);
		
		JLabel lblX_6 = new JLabel("X \u0443\u0442\u043E\u0447, \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lblX_6, 6, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.WEST, lblX_6, 6, SpringLayout.EAST, textField_148);
		panel_7.add(lblX_6);
		
		textField_149 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_149, 0, SpringLayout.SOUTH, textField_145);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_149, 6, SpringLayout.EAST, lblX_6);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_149, 48, SpringLayout.EAST, lblX_6);
		panel_7.add(textField_149);
		textField_149.setColumns(10);
		
		JLabel lblY_5 = new JLabel("Y \u0443\u0442\u043E\u0447, \u043C");
		sl_panel_7.putConstraint(SpringLayout.WEST, lblY_5, 0, SpringLayout.WEST, label_163);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, lblY_5, 0, SpringLayout.SOUTH, lblX_5);
		panel_7.add(lblY_5);
		
		textField_150 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_150, 6, SpringLayout.SOUTH, label_179);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_150, 6, SpringLayout.EAST, lblY_5);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_150, 48, SpringLayout.EAST, lblY_5);
		panel_7.add(textField_150);
		textField_150.setColumns(10);
		
		JLabel label_180 = new JLabel("\u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 (Mt), \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_180, 9, SpringLayout.SOUTH, label_179);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_180, 15, SpringLayout.EAST, textField_150);
		sl_panel_7.putConstraint(SpringLayout.EAST, label_180, 121, SpringLayout.EAST, textField_146);
		panel_7.add(label_180);
		
		textField_151 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_151, 0, SpringLayout.WEST, label_170);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_151, 0, SpringLayout.SOUTH, textField_147);
		panel_7.add(textField_151);
		textField_151.setColumns(10);
		
		JLabel label_181 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_181, 20, SpringLayout.EAST, textField_146);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_181, 0, SpringLayout.SOUTH, label_178);
		panel_7.add(label_181);
		
		textField_152 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_152, 0, SpringLayout.SOUTH, label_178);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_152, 0, SpringLayout.EAST, comboBox_15);
		panel_7.add(textField_152);
		textField_152.setColumns(10);
		
		JLabel label_182 = new JLabel("2. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0433\u0440\u0430\u043D\u0438\u0446 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_182, 6, SpringLayout.SOUTH, textField_147);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_182, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_182);
		
		JLabel label_183 = new JLabel("!\u041E\u0442 \u0442\u043E\u0447\u043A\u0438 (\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446)");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_183, 17, SpringLayout.EAST, label_182);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_183, 0, SpringLayout.SOUTH, label_182);
		panel_7.add(label_183);
		
		textField_153 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_153, 6, SpringLayout.SOUTH, label_180);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_153, 0, SpringLayout.WEST, comboBox_16);
		panel_7.add(textField_153);
		textField_153.setColumns(10);
		
		JLabel label_184 = new JLabel("!\u0414\u043E \u0442\u043E\u0447\u043A\u0438 (\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446)");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_184, 6, SpringLayout.EAST, textField_153);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_184, 0, SpringLayout.SOUTH, label_182);
		panel_7.add(label_184);
		
		textField_154 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_154, 6, SpringLayout.SOUTH, textField_151);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_154, 6, SpringLayout.EAST, label_184);
		panel_7.add(textField_154);
		textField_154.setColumns(10);
		
		JLabel lbls_1 = new JLabel("\u0413\u043E\u0440\u0438\u0437\u043E\u043D\u0442\u0430\u043B\u044C\u043D\u043E\u0435 \u043F\u0440\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435 (S), \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lbls_1, 6, SpringLayout.SOUTH, label_182);
		sl_panel_7.putConstraint(SpringLayout.WEST, lbls_1, 0, SpringLayout.WEST, label_162);
		panel_7.add(lbls_1);
		
		textField_155 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_155, 6, SpringLayout.SOUTH, label_182);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_155, 0, SpringLayout.EAST, label_168);
		panel_7.add(textField_155);
		textField_155.setColumns(10);
		
		JLabel label_185 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u0447\u0430\u0441\u0442\u0438 \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_185, 0, SpringLayout.WEST, textField_141);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_185, 0, SpringLayout.SOUTH, lbls_1);
		panel_7.add(label_185);
		
		textField_156 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_156, 6, SpringLayout.SOUTH, label_183);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_156, 0, SpringLayout.WEST, comboBox_15);
		panel_7.add(textField_156);
		textField_156.setColumns(10);
		
		JLabel label_186 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0441\u043C\u0435\u0436\u043D\u044B\u0445 \u0417\u0423");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_186, 13, SpringLayout.EAST, textField_156);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_186, 0, SpringLayout.SOUTH, textField_155);
		panel_7.add(label_186);
		
		textField_157 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_157, 6, SpringLayout.SOUTH, label_184);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_157, 6, SpringLayout.EAST, label_186);
		panel_7.add(textField_157);
		textField_157.setColumns(10);
		
		JLabel label_187 = new JLabel("3. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043C\u0435\u0441\u0442\u043E\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0433\u0440\u0430\u043D\u0438\u0446 \u0447\u0430\u0441\u0442\u0438 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0437\u0430\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_187, 22, SpringLayout.SOUTH, lbls_1);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_187, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_187);
		
		JLabel label_188 = new JLabel("!\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_188, 0, SpringLayout.NORTH, label_187);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_188, 6, SpringLayout.EAST, label_187);
		panel_7.add(label_188);
		
		textField_158 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_158, 0, SpringLayout.WEST, label_184);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_158, 0, SpringLayout.SOUTH, label_187);
		panel_7.add(textField_158);
		textField_158.setColumns(10);
		
		JLabel lblxV = new JLabel("!X, \u043C");
		sl_panel_7.putConstraint(SpringLayout.WEST, lblxV, 6, SpringLayout.EAST, textField_158);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, lblxV, 0, SpringLayout.SOUTH, label_187);
		panel_7.add(lblxV);
		
		textField_159 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_159, 10, SpringLayout.SOUTH, textField_157);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_159, 14, SpringLayout.EAST, lblxV);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_159, 56, SpringLayout.EAST, lblxV);
		panel_7.add(textField_159);
		textField_159.setColumns(10);
		
		JLabel lbly = new JLabel("!Y, \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lbly, 0, SpringLayout.NORTH, label_187);
		sl_panel_7.putConstraint(SpringLayout.WEST, lbly, 6, SpringLayout.EAST, textField_159);
		panel_7.add(lbly);
		
		textField_160 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_160, 30, SpringLayout.SOUTH, textField_154);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_160, 5, SpringLayout.EAST, lbly);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_160, 47, SpringLayout.EAST, lbly);
		panel_7.add(textField_160);
		textField_160.setColumns(10);
		
		JLabel label_189 = new JLabel("\u0421\u0440\u0435\u0434\u043D\u044F\u044F \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u043E\u0433\u0440\u0435\u0448\u043D\u043E\u0441\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u043E\u0439 \u0442\u043E\u0447\u043A\u0438 (Mt), \u043C");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_189, 6, SpringLayout.SOUTH, label_187);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_189, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_189);
		
		textField_161 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_161, 6, SpringLayout.SOUTH, label_188);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_161, 0, SpringLayout.WEST, label_177);
		panel_7.add(textField_161);
		textField_161.setColumns(10);
		
		JLabel label_190 = new JLabel("\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0437\u0430\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0438\u044F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_190, 14, SpringLayout.EAST, textField_161);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_190, 0, SpringLayout.SOUTH, label_189);
		panel_7.add(label_190);
		
		textField_162 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_162, 0, SpringLayout.SOUTH, label_189);
		sl_panel_7.putConstraint(SpringLayout.EAST, textField_162, 0, SpringLayout.EAST, label_186);
		panel_7.add(textField_162);
		textField_162.setColumns(10);
		
		JLabel label_191 = new JLabel("5. \u041E\u0431\u0449\u0438\u0435 \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_191, 21, SpringLayout.SOUTH, label_189);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_191, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_191);
		
		JLabel label_192 = new JLabel("!\u0423\u0447\u0435\u0442\u043D\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_192, 6, SpringLayout.SOUTH, label_191);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_192, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_192);
		
		textField_163 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_163, 6, SpringLayout.EAST, label_192);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_163, 0, SpringLayout.SOUTH, label_192);
		panel_7.add(textField_163);
		textField_163.setColumns(10);
		
		JLabel label_193 = new JLabel("!\u041F\u043B\u043E\u0449\u0430\u0434\u044C (\u0420), \u043C2");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_193, 6, SpringLayout.SOUTH, label_191);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_193, 0, SpringLayout.WEST, label_179);
		panel_7.add(label_193);
		
		textField_164 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_164, 0, SpringLayout.WEST, label_188);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_164, 0, SpringLayout.SOUTH, label_192);
		panel_7.add(textField_164);
		textField_164.setColumns(10);
		
		JLabel label_194 = new JLabel("+- \u0414\u0435\u043B\u044C\u0442\u0430\u0420\u0431 \u043C2");
		sl_panel_7.putConstraint(SpringLayout.WEST, label_194, 16, SpringLayout.EAST, textField_164);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, label_194, 0, SpringLayout.SOUTH, label_192);
		panel_7.add(label_194);
		
		textField_165 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_165, 6, SpringLayout.EAST, label_194);
		sl_panel_7.putConstraint(SpringLayout.SOUTH, textField_165, 0, SpringLayout.SOUTH, label_192);
		panel_7.add(textField_165);
		textField_165.setColumns(10);
		
		JLabel label_195 = new JLabel("!\u0422\u0438\u043F \u0447\u0430\u0441\u0442\u0438");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_195, 6, SpringLayout.SOUTH, label_192);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_195, 0, SpringLayout.WEST, label_162);
		panel_7.add(label_195);
		
		textField_166 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_166, 6, SpringLayout.SOUTH, label_192);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_166, 6, SpringLayout.EAST, label_195);
		panel_7.add(textField_166);
		textField_166.setColumns(10);
		
		JLabel label_196 = new JLabel("!\u0425\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u0438\u0441\u0442\u0438\u043A\u0430 \u0447\u0430\u0441\u0442\u0438");
		sl_panel_7.putConstraint(SpringLayout.NORTH, label_196, 0, SpringLayout.NORTH, label_195);
		sl_panel_7.putConstraint(SpringLayout.WEST, label_196, 6, SpringLayout.EAST, textField_166);
		panel_7.add(label_196);
		
		textField_167 = new JTextField();
		sl_panel_7.putConstraint(SpringLayout.NORTH, textField_167, 6, SpringLayout.SOUTH, textField_163);
		sl_panel_7.putConstraint(SpringLayout.WEST, textField_167, 0, SpringLayout.WEST, textField_141);
		panel_7.add(textField_167);
		textField_167.setColumns(10);
		
		JLabel lblNewLabel_9 = new JLabel("<html>Таблица: 5. Общие сведения о частях уточняемого земельного участка<br>\r\n" + 
				"54. Общие сведения о частях земельных участков в <...> реквизите \"5\" раздела<br>\r\n" + 
				"\"Сведения об уточняемых земельных участках и их частях\" <...> заполняются в <br>\r\n" + 
				"отношении существующих частей земельных участков, которые сохраняются в прежних <br>\r\n" + 
				"либо уточняемых границах на измененных или уточняемых земельных участках, а также <br>\r\n" + 
				"в отношении образуемых частей земельных участков. При этом погрешность определения <br>\r\n" + 
				"площади \"+/-дельтаР, м2\" заполняется в отношении образуемых или уточняемых частей <br>\r\n" + 
				"земельных участков в случае, если в результате такого уточнения изменилась ее площадь.</html>");
		sl_panel_7.putConstraint(SpringLayout.NORTH, lblNewLabel_9, 23, SpringLayout.SOUTH, label_195);
		sl_panel_7.putConstraint(SpringLayout.WEST, lblNewLabel_9, 0, SpringLayout.WEST, label_162);
		panel_7.add(lblNewLabel_9);
		
		JPanel panel_2 = new JPanel();
		tabbedPane.addTab("Исходные", null, panel_2, null);
		SpringLayout sl_panel_2 = new SpringLayout();
		panel_2.setLayout(sl_panel_2);
		
		JLabel lblNewLabel_2 = new JLabel("*1. \u041F\u0435\u0440\u0435\u0447\u0435\u043D\u044C \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u043D\u044B\u0445, \u043F\u0440\u0438 \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043A\u0435 \u043C\u0435\u0436\u0435\u0432\u043E\u0433\u043E \u043F\u043B\u0430\u043D\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblNewLabel_2, 10, SpringLayout.NORTH, panel_2);
		sl_panel_2.putConstraint(SpringLayout.WEST, lblNewLabel_2, 10, SpringLayout.WEST, panel_2);
		panel_2.add(lblNewLabel_2);
		
		JLabel label_27 = new JLabel("*\u041A\u043E\u0434 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_27, 6, SpringLayout.SOUTH, lblNewLabel_2);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_27, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_27);
		
		JComboBox comboBox_4 = new JComboBox(DocCode);
		sl_panel_2.putConstraint(SpringLayout.NORTH, comboBox_4, 6, SpringLayout.SOUTH, lblNewLabel_2);
		sl_panel_2.putConstraint(SpringLayout.WEST, comboBox_4, 50, SpringLayout.EAST, label_27);
		sl_panel_2.putConstraint(SpringLayout.EAST, comboBox_4, -10, SpringLayout.EAST, panel_2);
		panel_2.add(comboBox_4);
		
		JLabel label_28 = new JLabel("\u041D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_28, 19, SpringLayout.SOUTH, label_27);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_28, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_28);
		
		textField_21 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_21, 10, SpringLayout.SOUTH, comboBox_4);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_21, 3, SpringLayout.EAST, label_28);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_21, 151, SpringLayout.EAST, label_28);
		panel_2.add(textField_21);
		textField_21.setColumns(10);
		
		JLabel label_29 = new JLabel("\u0421\u0435\u0440\u0438\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_29, 0, SpringLayout.NORTH, label_28);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_29, 18, SpringLayout.EAST, textField_21);
		panel_2.add(label_29);
		
		textField_22 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_22, 7, SpringLayout.SOUTH, comboBox_4);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_22, 26, SpringLayout.EAST, label_29);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_22, 164, SpringLayout.EAST, label_29);
		panel_2.add(textField_22);
		textField_22.setColumns(10);
		
		JLabel label_30 = new JLabel("*\u041D\u043E\u043C\u0435\u0440 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_30, 9, SpringLayout.SOUTH, label_28);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_30, -6, SpringLayout.EAST, label_28);
		panel_2.add(label_30);
		
		textField_23 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_23, 3, SpringLayout.SOUTH, textField_21);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_23, 6, SpringLayout.EAST, label_30);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_23, 144, SpringLayout.EAST, label_30);
		panel_2.add(textField_23);
		textField_23.setColumns(10);
		
		JLabel label_31 = new JLabel("\u0414\u0430\u0442\u0430 \u0432\u044B\u0434\u0430\u0447\u0438 (\u043F\u043E\u0434\u043F\u0438\u0441\u0430\u043D\u0438\u044F) \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.WEST, label_31, 23, SpringLayout.EAST, textField_23);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, label_31, 0, SpringLayout.SOUTH, label_30);
		panel_2.add(label_31);
		
		textField_24 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_24, 6, SpringLayout.SOUTH, textField_22);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_24, 25, SpringLayout.EAST, label_31);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_24, 227, SpringLayout.EAST, label_31);
		panel_2.add(textField_24);
		textField_24.setColumns(10);
		
		JLabel label_32 = new JLabel("\u041E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u044F, \u0432\u044B\u0434\u0430\u0432\u0448\u0430\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442. \u0410\u0432\u0442\u043E\u0440 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_32, 16, SpringLayout.SOUTH, label_30);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_32, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_32);
		
		textField_25 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_25, 6, SpringLayout.SOUTH, textField_24);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_25, 0, SpringLayout.WEST, label_29);
		panel_2.add(textField_25);
		textField_25.setColumns(10);
		
		JLabel label_33 = new JLabel("\u041E\u0441\u043E\u0431\u044B\u0435 \u043E\u0442\u043C\u0435\u0442\u043A\u0438");
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_25, -6, SpringLayout.WEST, label_33);
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_33, 0, SpringLayout.NORTH, label_32);
		panel_2.add(label_33);
		
		textField_26 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_26, 329, SpringLayout.WEST, textField_24);
		panel_2.add(textField_26);
		textField_26.setColumns(10);
		
		JLabel label_34 = new JLabel("\u0412\u0438\u0434 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u0433\u043E \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_34, 18, SpringLayout.SOUTH, label_32);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_34, 10, SpringLayout.WEST, panel_2);
		panel_2.add(label_34);
		
		JComboBox comboBox_5 = new JComboBox(SodTypeDoc);
		sl_panel_2.putConstraint(SpringLayout.NORTH, comboBox_5, -3, SpringLayout.NORTH, label_34);
		sl_panel_2.putConstraint(SpringLayout.WEST, comboBox_5, 6, SpringLayout.EAST, label_34);
		sl_panel_2.putConstraint(SpringLayout.EAST, comboBox_5, -503, SpringLayout.EAST, panel_2);
		panel_2.add(comboBox_5);
		
		JLabel label_35 = new JLabel("\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0439 \u0444\u0430\u0439\u043B");
		sl_panel_2.putConstraint(SpringLayout.WEST, label_35, 26, SpringLayout.EAST, comboBox_5);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, label_35, 0, SpringLayout.SOUTH, label_34);
		panel_2.add(label_35);
		
		textField_27 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_27, 0, SpringLayout.SOUTH, label_34);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_27, 761, SpringLayout.EAST, panel_2);
		panel_2.add(textField_27);
		textField_27.setColumns(10);
		
		JLabel label_36 = new JLabel("\u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u043A \u043A\u0430\u0440\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u043E\u043C\u0443 \u043C\u0430\u0442\u0435\u0440\u0438\u0430\u043B\u0443");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_36, 28, SpringLayout.SOUTH, label_34);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_36, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_36);
		
		JCheckBox chckbxNewCheckBox = new JCheckBox("");
		sl_panel_2.putConstraint(SpringLayout.NORTH, chckbxNewCheckBox, 0, SpringLayout.NORTH, label_36);
		sl_panel_2.putConstraint(SpringLayout.WEST, chckbxNewCheckBox, 0, SpringLayout.WEST, label_35);
		panel_2.add(chckbxNewCheckBox);
		
		JLabel label_37 = new JLabel("*\u041C\u0430\u0441\u0448\u0442\u0430\u0431 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0432\u0443\u044E\u0449\u0435\u0433\u043E \u043A\u0430\u0440\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u044F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_37, 0, SpringLayout.NORTH, label_36);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_37, 6, SpringLayout.EAST, chckbxNewCheckBox);
		panel_2.add(label_37);
		
		textField_28 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_26, -57, SpringLayout.NORTH, textField_28);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_26, 0, SpringLayout.EAST, textField_28);
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_28, -3, SpringLayout.NORTH, label_36);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_28, 16, SpringLayout.EAST, label_37);
		panel_2.add(textField_28);
		textField_28.setColumns(10);
		
		JLabel label_38 = new JLabel("*\u0414\u0430\u0442\u0430 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u043A\u0430\u0440\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u044F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_38, 6, SpringLayout.SOUTH, label_36);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_38, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_38);
		
		textField_29 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_29, 6, SpringLayout.SOUTH, chckbxNewCheckBox);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_29, 6, SpringLayout.EAST, label_38);
		panel_2.add(textField_29);
		textField_29.setColumns(10);
		
		JLabel label_39 = new JLabel("\u0414\u0430\u0442\u0430 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0433\u043E \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F \u043A\u0430\u0440\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u043E\u0433\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u044F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_39, 3, SpringLayout.NORTH, textField_29);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_39, 0, SpringLayout.EAST, label_37);
		panel_2.add(label_39);
		
		textField_30 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_30, 0, SpringLayout.NORTH, textField_29);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_30, 0, SpringLayout.WEST, textField_28);
		panel_2.add(textField_30);
		textField_30.setColumns(10);
		
		JLabel label_40 = new JLabel("*\u0421\u0438\u0441\u0442\u0435\u043C\u044B \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442 (\u043D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435)");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_40, 23, SpringLayout.SOUTH, label_38);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_40, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_40);
		
		JComboBox comboBox_6 = new JComboBox(SysCoord);
		sl_panel_2.putConstraint(SpringLayout.NORTH, comboBox_6, 6, SpringLayout.SOUTH, textField_29);
		sl_panel_2.putConstraint(SpringLayout.WEST, comboBox_6, 16, SpringLayout.EAST, label_40);
		sl_panel_2.putConstraint(SpringLayout.EAST, comboBox_6, -213, SpringLayout.EAST, panel_2);
		comboBox_6.setEditable(true);
		panel_2.add(comboBox_6);
		
		JLabel label_41 = new JLabel("2. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0433\u0435\u043E\u0434\u0435\u0437\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u043E\u0441\u043D\u043E\u0432\u0435 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u0430, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u043F\u0440\u0438 \u043F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043A\u0435 \u043C\u0435\u0436\u0435\u0432\u043E\u0433\u043E \u043F\u043B\u0430\u043D\u0430 (\u0432 \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u0438 \u043D\u0430)");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_41, 6, SpringLayout.SOUTH, comboBox_6);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_41, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_41);
		
		textField_31 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_31, -3, SpringLayout.NORTH, label_41);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_31, 32, SpringLayout.EAST, label_41);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_31, -50, SpringLayout.EAST, panel_2);
		panel_2.add(textField_31);
		textField_31.setColumns(10);
		
		JLabel label_42 = new JLabel("\u041F\u0443\u043D\u043A\u0442 \u041E\u041C\u0421 (\u0413\u0413\u0421)");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_42, 6, SpringLayout.SOUTH, label_41);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_42, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_42);
		
		textField_32 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_32, 6, SpringLayout.SOUTH, label_41);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_32, 6, SpringLayout.EAST, label_42);
		panel_2.add(textField_32);
		textField_32.setColumns(10);
		
		JLabel lblNewLabel_3 = new JLabel("*\u0422\u0438\u043F \u0437\u043D\u0430\u043A\u0430 \u0433\u0435\u043E\u0434\u0435\u0437\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u0441\u0435\u0442\u0438");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblNewLabel_3, 0, SpringLayout.NORTH, label_42);
		sl_panel_2.putConstraint(SpringLayout.WEST, lblNewLabel_3, 6, SpringLayout.EAST, textField_32);
		panel_2.add(lblNewLabel_3);
		
		textField_33 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_33, 6, SpringLayout.SOUTH, label_41);
		panel_2.add(textField_33);
		textField_33.setColumns(10);
		
		JLabel lblNewLabel_4 = new JLabel("*\u041A\u043B\u0430\u0441\u0441 \u0433\u0435\u043E\u0434\u0435\u0437\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u0441\u0435\u0442\u0438");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblNewLabel_4, 3, SpringLayout.NORTH, textField_32);
		panel_2.add(lblNewLabel_4);
		
		textField_34 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_34, 6, SpringLayout.SOUTH, textField_31);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_34, 0, SpringLayout.EAST, textField_24);
		panel_2.add(textField_34);
		textField_34.setColumns(10);
		
		JLabel lblxM = new JLabel("*X, m");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblxM, 18, SpringLayout.SOUTH, label_42);
		sl_panel_2.putConstraint(SpringLayout.WEST, lblxM, 10, SpringLayout.WEST, panel_2);
		panel_2.add(lblxM);
		
		textField_35 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_35, 6, SpringLayout.SOUTH, textField_32);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_35, 6, SpringLayout.EAST, lblxM);
		panel_2.add(textField_35);
		textField_35.setColumns(10);
		
		JLabel lblyM = new JLabel("*Y, m");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblyM, 0, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, lblyM, 15, SpringLayout.EAST, textField_35);
		panel_2.add(lblyM);
		
		textField_36 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_36, 6, SpringLayout.SOUTH, textField_32);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_36, 6, SpringLayout.EAST, lblyM);
		panel_2.add(textField_36);
		textField_36.setColumns(10);
		
		JLabel label_43 = new JLabel("\u041D\u0430\u0440\u0443\u0436\u043D\u044B\u0439 \u0437\u043D\u0430\u043A \u043F\u0443\u043D\u043A\u0442\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_43, 0, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_43, 0, SpringLayout.WEST, textField_29);
		panel_2.add(label_43);
		
		textField_37 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_37, -3, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_37, 6, SpringLayout.EAST, label_43);
		panel_2.add(textField_37);
		textField_37.setColumns(10);
		
		JLabel label_44 = new JLabel("\u0426\u0435\u043D\u0442\u0440 \u0437\u043D\u0430\u043A\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_44, 0, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_44, 6, SpringLayout.EAST, textField_37);
		panel_2.add(label_44);
		
		textField_38 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_38, -3, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_38, 3, SpringLayout.EAST, label_44);
		panel_2.add(textField_38);
		textField_38.setColumns(10);
		
		JLabel label_45 = new JLabel("\u041C\u0430\u0440\u043A\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_45, 0, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_45, 6, SpringLayout.EAST, textField_38);
		panel_2.add(label_45);
		
		textField_39 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_39, -3, SpringLayout.NORTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_39, 0, SpringLayout.EAST, textField_31);
		panel_2.add(textField_39);
		textField_39.setColumns(10);
		
		JLabel label_46 = new JLabel("3. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043F\u0440\u0438\u0431\u043E\u0440\u0435 \u0438\u0437\u043C\u0435\u0440\u0435\u043D\u0438\u044F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_46, 6, SpringLayout.SOUTH, lblxM);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_46, 0, SpringLayout.EAST, textField_32);
		panel_2.add(label_46);
		
		JLabel label_47 = new JLabel("*\u041D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u0440");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_47, 6, SpringLayout.SOUTH, label_46);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_47, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_47);
		
		textField_40 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_40, 6, SpringLayout.SOUTH, label_46);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_40, 6, SpringLayout.EAST, label_47);
		panel_2.add(textField_40);
		textField_40.setColumns(10);
		
		JLabel label_48 = new JLabel("*\u041D\u043E\u043C\u0435\u0440 \u0432 \u0433\u043E\u0441 \u0440\u0435\u0435\u0441\u0442\u0440\u0435 \u0441\u0440\u0435\u0434\u0441\u0442\u0432 \u0438\u0437\u043C\u0435\u0440\u0435\u043D\u0438\u044F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_48, 0, SpringLayout.NORTH, label_47);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_48, 0, SpringLayout.WEST, comboBox_6);
		panel_2.add(label_48);
		
		textField_41 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_33, 0, SpringLayout.EAST, textField_41);
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_41, -3, SpringLayout.NORTH, label_47);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_41, 6, SpringLayout.EAST, label_48);
		panel_2.add(textField_41);
		textField_41.setColumns(10);
		
		JLabel label_49 = new JLabel("*\u0421\u0440\u043E\u043A \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441\u0432\u0438\u0434\u0435\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_49, 0, SpringLayout.NORTH, label_47);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_49, 0, SpringLayout.EAST, label_45);
		panel_2.add(label_49);
		
		textField_42 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_42, -3, SpringLayout.NORTH, label_47);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_42, 20, SpringLayout.EAST, label_49);
		panel_2.add(textField_42);
		textField_42.setColumns(10);
		
		JLabel label_50 = new JLabel("*\u0420\u0435\u043A\u0432\u0438\u0437\u0438\u0442\u044B \u0441\u0432\u0438\u0434\u0435\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0430 \u043E \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0435 ");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_50, 6, SpringLayout.SOUTH, textField_40);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_50, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_50);
		
		textField_43 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_43, 6, SpringLayout.SOUTH, label_48);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_43, 0, SpringLayout.WEST, comboBox_6);
		panel_2.add(textField_43);
		textField_43.setColumns(10);
		
		JLabel lblNewLabel_5 = new JLabel("4. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u043D\u0430\u043B\u0438\u0447\u0438\u0438 \u0437\u0434\u0430\u043D\u0438\u0439, \u0441\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u0438\u0439, \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u043D\u0435\u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u0441\u0442\u0440\u043E\u0438\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0430 \u043D\u0430 \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u0430\u0445");
		sl_panel_2.putConstraint(SpringLayout.NORTH, lblNewLabel_5, 6, SpringLayout.SOUTH, label_50);
		sl_panel_2.putConstraint(SpringLayout.WEST, lblNewLabel_5, 10, SpringLayout.WEST, panel_2);
		panel_2.add(lblNewLabel_5);
		
		JLabel label_51 = new JLabel("*\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_51, 6, SpringLayout.SOUTH, lblNewLabel_5);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_51, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_51);
		
		textField_44 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_44, 6, SpringLayout.EAST, label_51);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_44, 0, SpringLayout.SOUTH, label_51);
		panel_2.add(textField_44);
		textField_44.setColumns(10);
		
		JLabel label_52 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u0438\u043B\u0438 \u0438\u043D\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0437\u0434\u0430\u043D\u0438\u0439, \u0441\u043E\u043E\u0440\u0443\u0436\u0435\u043D\u0438\u0439, \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u043D\u0435\u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u043D\u043E\u0433\u043E \u0441\u0442\u0440\u043E\u0438\u0442\u0435\u043B\u044C\u0441\u0442\u0432\u0430, \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0445 \u043D\u0430 \u0437\u0443\u0447\u0430\u0441\u0442\u043A\u0435");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_52, 6, SpringLayout.SOUTH, label_51);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_52, 0, SpringLayout.WEST, lblNewLabel_2);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_52, 0, SpringLayout.EAST, textField_38);
		panel_2.add(label_52);
		
		textField_45 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_45, 6, SpringLayout.EAST, label_52);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_45, 0, SpringLayout.SOUTH, label_52);
		panel_2.add(textField_45);
		textField_45.setColumns(10);
		
		JLabel label_53 = new JLabel("5. \u0421\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043E \u0447\u0430\u0441\u0442\u044F\u0445 \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u0445 \u0438\u043B\u0438 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u044B\u0445 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_53, 3, SpringLayout.SOUTH, label_52);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_53, 0, SpringLayout.WEST, lblNewLabel_2);
		panel_2.add(label_53);
		
		JLabel label_54 = new JLabel("*\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_2.putConstraint(SpringLayout.EAST, label_33, 0, SpringLayout.EAST, label_54);
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_54, 6, SpringLayout.SOUTH, label_52);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_54, 0, SpringLayout.WEST, label_37);
		panel_2.add(label_54);
		
		textField_46 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_46, 6, SpringLayout.SOUTH, label_52);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_46, 6, SpringLayout.EAST, label_54);
		panel_2.add(textField_46);
		textField_46.setColumns(10);
		
		JLabel label_55 = new JLabel("*\u0423\u0447\u0435\u0442\u043D\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0447\u0430\u0441\u0442\u0435\u0439 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_55, 8, SpringLayout.SOUTH, label_53);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_55, 10, SpringLayout.WEST, panel_2);
		panel_2.add(label_55);
		
		textField_47 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_47, 0, SpringLayout.SOUTH, label_55);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_47, 0, SpringLayout.EAST, label_36);
		panel_2.add(textField_47);
		textField_47.setColumns(10);
		
		JLabel label_56 = new JLabel("*\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0435 \u043D\u043E\u043C\u0435\u0440\u0430 \u0417\u0423, \u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E\u043C \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u0423\u0423");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_56, 6, SpringLayout.SOUTH, label_55);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_56, 10, SpringLayout.WEST, panel_2);
		panel_2.add(label_56);
		
		JLabel label_57 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u043E\u0432\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0443\u0440\u0430 \u0443\u0442\u043E\u0447\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u043C\u043D\u043E\u0433\u043E\u043A\u043E\u043D\u0442\u0443\u0440\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u043E\u0441\u0442\u0443\u043F");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_57, 7, SpringLayout.SOUTH, label_56);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_57, 0, SpringLayout.WEST, lblNewLabel_2);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_57, -350, SpringLayout.EAST, comboBox_6);
		panel_2.add(label_57);
		
		textField_48 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_48, 6, SpringLayout.SOUTH, label_56);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_48, 6, SpringLayout.EAST, label_57);
		panel_2.add(textField_48);
		textField_48.setColumns(10);
		
		JLabel label_58 = new JLabel("\u041A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u044B\u0439 \u043D\u043E\u043C\u0435\u0440 \u0438\u043B\u0438 \u043E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u043E\u0433\u043E \u0443\u0447\u0430\u0441\u0442\u043A\u0430, \u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E\u043C \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0432\u0430");
		sl_panel_2.putConstraint(SpringLayout.NORTH, label_58, 0, SpringLayout.NORTH, label_57);
		sl_panel_2.putConstraint(SpringLayout.WEST, label_58, 7, SpringLayout.EAST, textField_48);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_58, -284, SpringLayout.EAST, panel_2);
		panel_2.add(label_58);
		
		textField_49 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.EAST, lblNewLabel_4, 0, SpringLayout.EAST, textField_49);
		sl_panel_2.putConstraint(SpringLayout.WEST, textField_49, 6, SpringLayout.EAST, label_58);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, textField_49, 0, SpringLayout.SOUTH, label_57);
		panel_2.add(textField_49);
		textField_49.setColumns(10);
		
		JLabel label_59 = new JLabel("\u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u044B - \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043B\u044F \u0432\u043D\u0435\u0441\u0435\u043D\u0438\u044F \u0441\u0432\u0435\u0434\u0435\u043D\u0438\u0439");
		sl_panel_2.putConstraint(SpringLayout.WEST, label_59, 19, SpringLayout.EAST, textField_49);
		sl_panel_2.putConstraint(SpringLayout.SOUTH, label_59, -22, SpringLayout.SOUTH, panel_2);
		sl_panel_2.putConstraint(SpringLayout.EAST, label_59, 167, SpringLayout.EAST, textField_49);
		panel_2.add(label_59);
		
		textField_50 = new JTextField();
		sl_panel_2.putConstraint(SpringLayout.NORTH, textField_50, 0, SpringLayout.NORTH, label_56);
		sl_panel_2.putConstraint(SpringLayout.EAST, textField_50, 0, SpringLayout.EAST, textField_28);
		panel_2.add(textField_50);
		textField_50.setColumns(10);
		
		JPanel panel_11 = new JPanel();
		tabbedPane.addTab("Расположение", null, panel_11, null);
		SpringLayout sl_panel_11 = new SpringLayout();
		panel_11.setLayout(sl_panel_11);
		
		JLabel label_238 = new JLabel("\u0421\u0445\u0435\u043C\u0430 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0437\u0435\u043C\u0435\u043B\u044C\u043D\u044B\u0445 \u0443\u0447\u0430\u0441\u0442\u043A\u043E\u0432");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_238, 10, SpringLayout.NORTH, panel_11);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_238, 10, SpringLayout.WEST, panel_11);
		panel_11.add(label_238);
		
		textField_202 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_202, 0, SpringLayout.NORTH, label_238);
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_202, 11, SpringLayout.EAST, label_238);
		panel_11.add(textField_202);
		textField_202.setColumns(10);
		
		JScrollPane scrollPane = new JScrollPane();
		sl_panel_11.putConstraint(SpringLayout.NORTH, scrollPane, 9, SpringLayout.SOUTH, textField_202);
		sl_panel_11.putConstraint(SpringLayout.WEST, scrollPane, 10, SpringLayout.WEST, panel_11);
		sl_panel_11.putConstraint(SpringLayout.SOUTH, scrollPane, 57, SpringLayout.SOUTH, textField_202);
		sl_panel_11.putConstraint(SpringLayout.EAST, scrollPane, 1031, SpringLayout.WEST, panel_11);
		panel_11.add(scrollPane);
		
		table = new JTable();
		table.setModel(new DefaultTableModel(
			new Object[][] {
				{null, null, null, null, null, null, null, null, null},
			},
			new String[] {
				"\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446\u044B", "X,\u043C", "Y, \u043C", "\u0422\u0438\u043F \u0442\u043E\u0447\u043A\u0438", "\u0426\u0432\u0435\u0442 \u0442\u043E\u0447\u043A\u0438", "\u0422\u0438\u043F \u043B\u0438\u043D\u0438\u0438", "\u0426\u0432\u0435\u0442 \u043B\u0438\u043D\u0438\u0438", "\u041F\u043E\u0434\u0447\u0435\u0440\u043A\u0438\u0432\u0430\u043D\u0438\u0435", "\u041F\u0440\u0438\u043C\u0435\u0447\u0430\u043D\u0438\u0435"
			}
		));
		scrollPane.setViewportView(table);
		
		JLabel label_239 = new JLabel("\u0414\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u043C\u0435\u0436\u0434\u0443 \u0442\u043E\u0447\u043A\u0430\u043C\u0438");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_239, 6, SpringLayout.SOUTH, scrollPane);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_239, 0, SpringLayout.WEST, label_238);
		panel_11.add(label_239);
		
		JScrollPane scrollPane_1 = new JScrollPane();
		sl_panel_11.putConstraint(SpringLayout.NORTH, scrollPane_1, 6, SpringLayout.SOUTH, label_239);
		sl_panel_11.putConstraint(SpringLayout.WEST, scrollPane_1, 10, SpringLayout.WEST, panel_11);
		sl_panel_11.putConstraint(SpringLayout.SOUTH, scrollPane_1, 54, SpringLayout.SOUTH, label_239);
		sl_panel_11.putConstraint(SpringLayout.EAST, scrollPane_1, 963, SpringLayout.WEST, panel_11);
		panel_11.add(scrollPane_1);
		
		table_1 = new JTable();
		table_1.setModel(new DefaultTableModel(
			new Object[][] {
				{null, null, null, null, null, null},
			},
			new String[] {
				"\u041D\u0430\u0447\u0430\u043B\u044C\u043D\u0430\u044F \u0442\u043E\u0447\u043A\u0430", "\u041A\u043E\u043D\u0435\u0447\u043D\u0430\u044F \u0442\u043E\u0447\u043A\u0430", "\u0422\u0438\u043F \u043B\u0438\u043D\u0438\u0438", "\u0426\u0432\u0435\u0442 \u043B\u0438\u043D\u0438\u0438", "\u0420\u0430\u0441\u0441\u0442\u043E\u044F\u043D\u0438\u0435 \u043F\u043E\u0434\u043F\u0438\u0441\u0430\u0442\u044C", "\u041F\u0440\u0438\u043C\u0435\u0447\u0430\u043D\u0438\u0435"
			}
		));
		scrollPane_1.setViewportView(table_1);
		
		JLabel label_240 = new JLabel("\u041C\u0430\u0441\u0448\u0442\u0430\u04311");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_240, 6, SpringLayout.SOUTH, scrollPane_1);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_240, 0, SpringLayout.WEST, label_238);
		panel_11.add(label_240);
		
		textField_203 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_203, 6, SpringLayout.SOUTH, scrollPane_1);
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_203, 6, SpringLayout.EAST, label_240);
		panel_11.add(textField_203);
		textField_203.setColumns(10);
		
		JLabel label_241 = new JLabel("\u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u0447\u0438\u0441\u043B\u043E, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, 1000, 2000,10000, \u043B\u0438\u0431\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u0435 \u0440\u0430\u0441\u0447\u0435\u0442.");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_241, 6, SpringLayout.SOUTH, label_240);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_241, 0, SpringLayout.WEST, label_238);
		panel_11.add(label_241);
		
		JLabel label_242 = new JLabel("\u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043B\u0438\u0441\u0442\u043E\u0432 \u043F\u043E \u0433\u043E\u0440\u0438\u0437\u043E\u043D\u0442\u0430\u043B\u0438");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_242, 3, SpringLayout.NORTH, textField_203);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_242, 223, SpringLayout.EAST, textField_203);
		panel_11.add(label_242);
		
		textField_204 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_204, 6, SpringLayout.EAST, label_242);
		sl_panel_11.putConstraint(SpringLayout.SOUTH, textField_204, 0, SpringLayout.SOUTH, textField_203);
		panel_11.add(textField_204);
		textField_204.setColumns(10);
		
		JLabel label_243 = new JLabel("(\u043D\u0435 \u0437\u0430\u043F\u043E\u043B\u043D\u044F\u0435\u0442\u0441\u044F, \u0435\u0441\u043B\u0438 \u043D\u0435 \u043D\u0443\u0436\u043D\u043E \u0434\u0435\u043B\u0438\u0442\u044C \u043D\u0430 \u043B\u0438\u0441\u0442\u044B)");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_243, 6, SpringLayout.SOUTH, label_242);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_243, 120, SpringLayout.EAST, label_241);
		panel_11.add(label_243);
		
		JLabel label_244 = new JLabel("\u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043B\u0438\u0441\u0442\u043E\u0432 \u043F\u043E \u0432\u0435\u0440\u0442\u0438\u043A\u0430\u043B\u0438");
		sl_panel_11.putConstraint(SpringLayout.WEST, label_244, 28, SpringLayout.EAST, textField_204);
		sl_panel_11.putConstraint(SpringLayout.SOUTH, label_244, 0, SpringLayout.SOUTH, label_240);
		panel_11.add(label_244);
		
		textField_205 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_205, 6, SpringLayout.SOUTH, scrollPane_1);
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_205, 19, SpringLayout.EAST, label_244);
		panel_11.add(textField_205);
		textField_205.setColumns(10);
		
		JLabel label_245 = new JLabel("\u0418\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0433\u043E\u0442\u043E\u0432\u043E\u0433\u043E \u0447\u0435\u0440\u0442\u0435\u0436\u0430 \u0434\u043B\u044F \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0432 \u043F\u0435\u0447\u0430\u0442\u043D\u044B\u0439 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_245, 6, SpringLayout.SOUTH, label_241);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_245, 0, SpringLayout.WEST, label_238);
		panel_11.add(label_245);
		
		textField_206 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_206, 0, SpringLayout.NORTH, label_245);
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_206, 0, SpringLayout.WEST, label_242);
		panel_11.add(textField_206);
		textField_206.setColumns(10);
		
		JLabel label_246 = new JLabel("* \u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0439 \u0444\u0430\u0439\u043B \u0441 \u043E\u0431\u0440\u0430\u0437\u043E\u043C");
		sl_panel_11.putConstraint(SpringLayout.WEST, label_246, 10, SpringLayout.WEST, panel_11);
		panel_11.add(label_246);
		
		textField_207 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_207, -3, SpringLayout.NORTH, label_246);
		sl_panel_11.putConstraint(SpringLayout.WEST, textField_207, 19, SpringLayout.EAST, label_246);
		panel_11.add(textField_207);
		textField_207.setColumns(10);
		
		JLabel label_247 = new JLabel("\u041F\u0443\u0442\u044C \u043A \u0440\u0430\u0441\u0442\u0440\u0443 \u0434\u043B\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438");
		sl_panel_11.putConstraint(SpringLayout.EAST, label_247, 0, SpringLayout.EAST, label_246);
		panel_11.add(label_247);
		
		textField_208 = new JTextField();
		sl_panel_11.putConstraint(SpringLayout.NORTH, textField_208, -3, SpringLayout.NORTH, label_247);
		sl_panel_11.putConstraint(SpringLayout.EAST, textField_208, 0, SpringLayout.EAST, textField_207);
		panel_11.add(textField_208);
		textField_208.setColumns(10);
		
		JLabel label_248 = new JLabel("(\u0435\u0441\u043B\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0447\u0435\u0440\u0442\u0435\u0436 \u043F\u043E \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442\u0430\u043C, \u0442\u043E \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435\u0441\u044C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C\u044E \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0438 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u0440\u0430\u0441\u0442\u0440\u0430)");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_246, 6, SpringLayout.SOUTH, label_248);
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_248, 6, SpringLayout.SOUTH, label_245);
		sl_panel_11.putConstraint(SpringLayout.EAST, label_248, 0, SpringLayout.EAST, textField_204);
		panel_11.add(label_248);
		
		JLabel label_249 = new JLabel("(\u0434\u043B\u044F \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0433\u043E \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043F\u0440\u0438\u043A\u043B\u0430\u0434\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0444\u0430\u0439\u043B \u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0435 pdf \u0432 \u043E\u0434\u043D\u043E\u043C \u0438\u0437 \u0440\u0430\u0437\u0434\u0435\u043B\u043E\u0432 \"\u0420\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u0435\")");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_247, 6, SpringLayout.SOUTH, label_249);
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_249, 6, SpringLayout.SOUTH, label_246);
		sl_panel_11.putConstraint(SpringLayout.EAST, label_249, 0, SpringLayout.EAST, textField_204);
		panel_11.add(label_249);
		
		JLabel label_250 = new JLabel("(\u0435\u0441\u043B\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0447\u0435\u0440\u0442\u0435\u0436 \u043F\u043E \u043C\u0430\u0441\u0448\u0442\u0430\u0431\u0443, \u0442\u043E\u0433\u0434\u0430 \u0432\u044B\u0431\u0435\u0440\u0438\u0442\u0435 \u0432 \u0434\u0430\u043D\u043D\u043E\u043C \u043F\u043E\u043B\u0435 \u0444\u0430\u0439\u043B \u0440\u0430\u0441\u0442\u0440\u0430 \u0438 \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0439\u0442\u0435 \u0435\u0433\u043E \u043F\u043E \u0434\u0432\u0443\u043C \u0442\u043E\u0447\u043A\u0430\u043C)");
		sl_panel_11.putConstraint(SpringLayout.NORTH, label_250, 6, SpringLayout.SOUTH, textField_208);
		sl_panel_11.putConstraint(SpringLayout.WEST, label_250, 10, SpringLayout.WEST, label_247);
		panel_11.add(label_250);
		
		JPanel panel_10 = new JPanel();
		tabbedPane.addTab("Построения", null, panel_10, null);
		SpringLayout sl_panel_10 = new SpringLayout();
		panel_10.setLayout(sl_panel_10);
		
		JLabel label_214 = new JLabel("\u041A\u0430\u0442\u0430\u043B\u043E\u0433 \u043A\u043E\u043E\u0440\u0434\u0438\u043D\u0430\u0442 \u0442\u043E\u0447\u0435\u043A");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_214, 10, SpringLayout.NORTH, panel_10);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_214, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_214);
		
		textField_184 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_184, 0, SpringLayout.NORTH, label_214);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_184, 6, SpringLayout.EAST, label_214);
		panel_10.add(textField_184);
		textField_184.setColumns(10);
		
		JLabel label_215 = new JLabel("\u041E\u0431\u043E\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440\u043D\u044B\u0445 \u0442\u043E\u0447\u0435\u043A \u0433\u0440\u0430\u043D\u0438\u0446\u044B");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_215, 6, SpringLayout.SOUTH, label_214);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_215, 0, SpringLayout.WEST, label_214);
		panel_10.add(label_215);
		
		textField_185 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_185, 30, SpringLayout.NORTH, panel_10);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_185, 10, SpringLayout.EAST, label_215);
		sl_panel_10.putConstraint(SpringLayout.EAST, textField_185, 128, SpringLayout.EAST, label_215);
		panel_10.add(textField_185);
		textField_185.setColumns(10);
		
		JLabel lblX_7 = new JLabel("X, \u043C");
		sl_panel_10.putConstraint(SpringLayout.WEST, lblX_7, 6, SpringLayout.EAST, textField_185);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, lblX_7, 0, SpringLayout.SOUTH, label_215);
		panel_10.add(lblX_7);
		
		textField_186 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_186, 0, SpringLayout.NORTH, label_215);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_186, 6, SpringLayout.EAST, lblX_7);
		panel_10.add(textField_186);
		textField_186.setColumns(10);
		
		JLabel lblY_6 = new JLabel("Y, \u043C");
		sl_panel_10.putConstraint(SpringLayout.NORTH, lblY_6, 0, SpringLayout.NORTH, label_215);
		sl_panel_10.putConstraint(SpringLayout.WEST, lblY_6, 6, SpringLayout.EAST, textField_186);
		panel_10.add(lblY_6);
		
		textField_187 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_187, 0, SpringLayout.NORTH, label_215);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_187, 6, SpringLayout.EAST, lblY_6);
		panel_10.add(textField_187);
		textField_187.setColumns(10);
		
		JLabel label_216 = new JLabel("\u0422\u0438\u043F \u0442\u043E\u0447\u043A\u0438");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_216, 6, SpringLayout.EAST, textField_187);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_216, 0, SpringLayout.SOUTH, label_215);
		panel_10.add(label_216);
		
		JComboBox comboBox_19 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_19, 6, SpringLayout.EAST, label_216);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, comboBox_19, 0, SpringLayout.SOUTH, textField_185);
		panel_10.add(comboBox_19);
		
		JLabel label_217 = new JLabel("\u0426\u0432\u0435\u0442 \u0442\u043E\u0447\u043A\u0438");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_217, 37, SpringLayout.EAST, comboBox_19);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_217, 0, SpringLayout.SOUTH, label_215);
		panel_10.add(label_217);
		
		JComboBox comboBox_20 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.NORTH, comboBox_20, 0, SpringLayout.NORTH, label_215);
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_20, 7, SpringLayout.EAST, label_217);
		panel_10.add(comboBox_20);
		
		JLabel label_218 = new JLabel("\u0422\u0438\u043F \u043B\u0438\u043D\u0438\u0438");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_218, 27, SpringLayout.EAST, comboBox_20);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_218, 0, SpringLayout.SOUTH, label_215);
		panel_10.add(label_218);
		
		JComboBox comboBox_21 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_21, 13, SpringLayout.EAST, label_218);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, comboBox_21, 0, SpringLayout.SOUTH, textField_185);
		panel_10.add(comboBox_21);
		
		JLabel label_219 = new JLabel("\u0426\u0432\u0435\u0442 \u043B\u0438\u043D\u0438\u0438");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_219, 21, SpringLayout.SOUTH, label_215);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_219, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_219);
		
		JComboBox comboBox_22 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_22, 16, SpringLayout.EAST, label_219);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, comboBox_22, 0, SpringLayout.SOUTH, label_219);
		panel_10.add(comboBox_22);
		
		JLabel label_220 = new JLabel("\u041A\u0443\u0440\u0441\u0438\u0432");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_220, 0, SpringLayout.NORTH, label_219);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_220, 21, SpringLayout.EAST, comboBox_22);
		panel_10.add(label_220);
		
		textField_188 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_188, 6, SpringLayout.SOUTH, textField_185);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_188, 9, SpringLayout.EAST, label_220);
		panel_10.add(textField_188);
		textField_188.setColumns(10);
		
		JLabel label_221 = new JLabel("\u041F\u043E\u0434\u0447\u0435\u0440\u043A\u0438\u0432\u0430\u043D\u0438\u0435");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_221, 0, SpringLayout.NORTH, label_219);
		sl_panel_10.putConstraint(SpringLayout.EAST, label_221, 0, SpringLayout.EAST, lblX_7);
		panel_10.add(label_221);
		
		textField_189 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_189, 0, SpringLayout.WEST, textField_186);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_189, 0, SpringLayout.SOUTH, label_219);
		panel_10.add(textField_189);
		textField_189.setColumns(10);
		
		JLabel label_222 = new JLabel("\u041F\u0440\u0438\u043C\u0435\u0447\u0430\u043D\u0438\u0435");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_222, 19, SpringLayout.EAST, textField_189);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_222, 0, SpringLayout.SOUTH, label_219);
		panel_10.add(label_222);
		
		textField_190 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_190, 6, SpringLayout.EAST, label_222);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_190, 0, SpringLayout.SOUTH, label_219);
		panel_10.add(textField_190);
		textField_190.setColumns(10);
		
		JLabel label_223 = new JLabel("\u0414\u043E\u043F\u043E\u0434\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u043C\u0435\u0436\u0434\u0443 \u0442\u043E\u0447\u043A\u0430\u043C\u0438");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_223, 19, SpringLayout.SOUTH, label_219);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_223, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_223);
		
		JLabel label_224 = new JLabel("\u041D\u0430\u0447\u0430\u043B\u044C\u043D\u0430\u044F \u0442\u043E\u0447\u043A\u0430");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_224, 6, SpringLayout.SOUTH, label_223);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_224, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_224);
		
		textField_191 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_191, 6, SpringLayout.SOUTH, label_223);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_191, 9, SpringLayout.EAST, label_224);
		panel_10.add(textField_191);
		textField_191.setColumns(10);
		
		JLabel label_225 = new JLabel("\u041A\u043E\u043D\u0435\u0447\u043D\u0430\u044F \u0442\u043E\u0447\u043A\u0430");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_225, 6, SpringLayout.SOUTH, label_223);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_225, 6, SpringLayout.EAST, textField_191);
		panel_10.add(label_225);
		
		textField_192 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_192, 6, SpringLayout.EAST, label_225);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_192, 0, SpringLayout.SOUTH, textField_191);
		panel_10.add(textField_192);
		textField_192.setColumns(10);
		
		JLabel label_226 = new JLabel("\u0422\u0438\u043F \u043B\u0438\u043D\u0438\u0438");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_226, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_226, 10, SpringLayout.EAST, textField_192);
		panel_10.add(label_226);
		
		JLabel lblNewLabel_11 = new JLabel("\u0426\u0432\u0435\u0442 \u043B\u0438\u043D\u0438\u0438");
		sl_panel_10.putConstraint(SpringLayout.NORTH, lblNewLabel_11, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, lblNewLabel_11, 0, SpringLayout.WEST, textField_187);
		panel_10.add(lblNewLabel_11);
		
		JComboBox comboBox_23 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.NORTH, comboBox_23, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_23, 6, SpringLayout.EAST, label_226);
		panel_10.add(comboBox_23);
		
		JComboBox comboBox_24 = new JComboBox();
		sl_panel_10.putConstraint(SpringLayout.NORTH, comboBox_24, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, comboBox_24, 6, SpringLayout.EAST, lblNewLabel_11);
		panel_10.add(comboBox_24);
		
		JLabel label_227 = new JLabel("\u0420\u0430\u0441\u0441\u0442\u043E\u044F\u043D\u0438\u0435");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_227, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_227, 23, SpringLayout.EAST, comboBox_24);
		panel_10.add(label_227);
		
		textField_193 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_193, 0, SpringLayout.NORTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_193, 6, SpringLayout.EAST, label_227);
		panel_10.add(textField_193);
		textField_193.setColumns(10);
		
		JLabel label_228 = new JLabel("\u041F\u0440\u0438\u043C\u0435\u0447\u0430\u043D\u0438\u0435");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_228, 0, SpringLayout.WEST, comboBox_20);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_228, 0, SpringLayout.SOUTH, label_224);
		panel_10.add(label_228);
		
		textField_194 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_194, 6, SpringLayout.EAST, label_228);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_194, 0, SpringLayout.SOUTH, textField_191);
		panel_10.add(textField_194);
		textField_194.setColumns(10);
		
		JLabel label_229 = new JLabel("\u041C\u0430\u0441\u0448\u0442\u0430\u0431 1:");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_229, 6, SpringLayout.SOUTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_229, 0, SpringLayout.WEST, label_214);
		panel_10.add(label_229);
		
		textField_195 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_195, 6, SpringLayout.SOUTH, label_224);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_195, 6, SpringLayout.EAST, label_229);
		panel_10.add(textField_195);
		textField_195.setColumns(10);
		
		JLabel label_230 = new JLabel("\u041A\u043A\u043E\u043B-\u0432\u043E \u043B\u0438\u0441\u0442\u043E\u0432 \u043F\u043E \u0433\u043E\u0440\u0438\u0437\u043E\u043D\u0442\u0430\u043B\u0438");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_230, 6, SpringLayout.SOUTH, textField_191);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_230, 0, SpringLayout.WEST, textField_188);
		panel_10.add(label_230);
		
		textField_196 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_196, 6, SpringLayout.SOUTH, textField_192);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_196, 6, SpringLayout.EAST, label_230);
		panel_10.add(textField_196);
		textField_196.setColumns(10);
		
		JLabel label_231 = new JLabel("\u041A\u043E\u043B-\u0432\u043E \u043B\u0438\u0441\u0442\u043E\u0432 \u043F\u043E \u0432\u0435\u0440\u0442\u0438\u043A\u0430\u043B\u0438");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_231, 10, SpringLayout.WEST, comboBox_23);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_231, 0, SpringLayout.SOUTH, textField_195);
		panel_10.add(label_231);
		
		textField_197 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_197, 6, SpringLayout.EAST, label_231);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_197, 0, SpringLayout.SOUTH, textField_196);
		panel_10.add(textField_197);
		textField_197.setColumns(10);
		
		JLabel label_232 = new JLabel("\u0418\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0433\u043E\u0442\u043E\u0432\u043E\u0433\u043E \u0447\u0435\u0440\u0442\u0435\u0436\u0430 \u0434\u043B\u044F \u0432\u0441\u0442\u0430\u0432\u043A\u0438 \u0432 \u043F\u0435\u0447\u0430\u0442\u043D\u044B\u0439 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_232, 6, SpringLayout.SOUTH, textField_196);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_232, 0, SpringLayout.WEST, label_214);
		panel_10.add(label_232);
		
		textField_198 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_198, 6, SpringLayout.SOUTH, textField_196);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_198, 0, SpringLayout.WEST, lblX_7);
		panel_10.add(textField_198);
		textField_198.setColumns(10);
		
		JLabel label_233 = new JLabel("*\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0439 \u0444\u0430\u0439\u043B \u0441 \u043E\u0431\u0440\u0430\u0437\u043E\u043C");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_233, 0, SpringLayout.NORTH, label_232);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_233, 0, SpringLayout.WEST, lblY_6);
		panel_10.add(label_233);
		
		textField_199 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_199, 6, SpringLayout.SOUTH, textField_197);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_199, 0, SpringLayout.WEST, comboBox_19);
		panel_10.add(textField_199);
		textField_199.setColumns(10);
		
		JLabel label_234 = new JLabel("\u041F\u0443\u0442\u044C \u043A \u0440\u0430\u0441\u0442\u0440\u0443 \u0434\u043B\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438");
		sl_panel_10.putConstraint(SpringLayout.WEST, label_234, 6, SpringLayout.EAST, textField_199);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, label_234, 0, SpringLayout.SOUTH, textField_198);
		panel_10.add(label_234);
		
		textField_200 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_200, 6, SpringLayout.EAST, label_234);
		sl_panel_10.putConstraint(SpringLayout.SOUTH, textField_200, 0, SpringLayout.SOUTH, textField_198);
		panel_10.add(textField_200);
		textField_200.setColumns(10);
		
		JLabel label_235 = new JLabel("\u041D\u043E\u043C\u0435\u0440 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0433\u043E \u043A\u0432\u0430\u0440\u0442\u0430\u043B\u0430");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_235, 14, SpringLayout.SOUTH, label_232);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_235, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_235);
		
		textField_201 = new JTextField();
		sl_panel_10.putConstraint(SpringLayout.NORTH, textField_201, 2, SpringLayout.SOUTH, textField_198);
		sl_panel_10.putConstraint(SpringLayout.WEST, textField_201, -86, SpringLayout.EAST, textField_186);
		sl_panel_10.putConstraint(SpringLayout.EAST, textField_201, 0, SpringLayout.EAST, textField_186);
		panel_10.add(textField_201);
		textField_201.setColumns(10);
		
		JLabel label_236 = new JLabel("\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0440\u0430\u0441\u0442\u0440 \u0438\u0437 \u043F\u0443\u0431\u043B\u0438\u0447\u043D\u043E\u0439 \u043A\u0430\u0434\u0430\u0441\u0442\u0440\u043E\u0432\u043E\u0439 \u043A\u0430\u0440\u0442\u044B");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_236, 6, SpringLayout.SOUTH, label_235);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_236, 10, SpringLayout.WEST, panel_10);
		panel_10.add(label_236);
		
		JCheckBox checkBox = new JCheckBox("");
		sl_panel_10.putConstraint(SpringLayout.NORTH, checkBox, 0, SpringLayout.NORTH, label_236);
		sl_panel_10.putConstraint(SpringLayout.WEST, checkBox, 0, SpringLayout.WEST, textField_192);
		panel_10.add(checkBox);
		
		JLabel label_237 = new JLabel("\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0440\u0430\u0441\u0442\u0440 - \u043A\u043E\u0441\u043C\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0441\u043D\u0438\u043C\u043E\u043A");
		sl_panel_10.putConstraint(SpringLayout.NORTH, label_237, 6, SpringLayout.SOUTH, label_236);
		sl_panel_10.putConstraint(SpringLayout.WEST, label_237, 0, SpringLayout.WEST, label_214);
		panel_10.add(label_237);
		
		JCheckBox checkBox_1 = new JCheckBox("");
		sl_panel_10.putConstraint(SpringLayout.NORTH, checkBox_1, 6, SpringLayout.SOUTH, label_236);
		sl_panel_10.putConstraint(SpringLayout.WEST, checkBox_1, 20, SpringLayout.EAST, label_237);
		panel_10.add(checkBox_1);
		
		JPanel panel_12 = new JPanel();
		tabbedPane.addTab("Чертеж", null, panel_12, null);
		panel_12.setLayout(new SpringLayout());
		
		JPanel panel_13 = new JPanel();
		tabbedPane.addTab("Абрисы", null, panel_13, null);
		
		JPanel panel_14 = new JPanel();
		tabbedPane.addTab("Акт", null, panel_14, null);
		
		JPanel panel_15 = new JPanel();
		tabbedPane.addTab("Извещение", null, panel_15, null);

		JPanel panel_16 = new JPanel();
		tabbedPane.addTab("Знак", null, panel_16, null);
		
		JPanel panel_17 = new JPanel();
		tabbedPane.addTab("Схема", null, panel_17, null);
		
		JPanel panel_18 = new JPanel();
		tabbedPane.addTab("ДекларацияВС", null, panel_18, null);
		
		JPanel panel_19 = new JPanel();
		tabbedPane.addTab("XML", null, panel_19, null);
		
		JButton btnXml = new JButton("\u0421\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C XML");
		springLayout.putConstraint(SpringLayout.SOUTH, btnXml, -10, SpringLayout.SOUTH, frmvb.getContentPane());
		springLayout.putConstraint(SpringLayout.EAST, btnXml, -484, SpringLayout.EAST, frmvb.getContentPane());
		frmvb.getContentPane().add(btnXml);
		
		JButton button = new JButton("\u0417\u0430\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u043C\u0438");
		springLayout.putConstraint(SpringLayout.NORTH, button, 0, SpringLayout.NORTH, btnXml);
		springLayout.putConstraint(SpringLayout.WEST, button, 25, SpringLayout.EAST, btnXml);
		button.addActionListener(new ActionListener() {
			public void actionPerformed(ActionEvent arg0) {
				String comboBoxString="образованием двух земельных участков путем раздела земельного участка с кадастровым номером 50:20:0010203:156, расположенного по адресу: обл. Московская, р-н Одинцовский, гп Одинцово, с. Ромашково, ул. Каширина, дом 15а";
				comboBox.setSelectedItem(comboBoxString);
				comboBox_1.setSelectedIndex(2);
				textField_1.setText("Иванов");
				textField_2.setText("Иван");
				textField_3.setText("Иванович");
				textField_4.setText("СНИЛС 12345678901");
				textField_9.setText("Сидоров");
				textField_10.setText("Петр");
				textField_11.setText("Иванович");
				textField_12.setText("12-12-5");
				textField_13.setText("473147");
				textField_14.setText("Московская обл., Одинцовский р-н, Чапаевка д., д.19");
				textField_15.setText("sidorov@mail.ru");
				comboBox_4.setSelectedIndex(123);
				textField_23.setText("MO-15/ЗВ-762645");
				textField_24.setText("5/24/2015");
				textField_25.setText("Филиал федерального государственного бюджетного учреждения \"Федеральная кадастровая палата Росреестра\" по Московской области");
				//123
				//223123
				
				
			}
		});
		frmvb.getContentPane().add(button);
	}
}
